{"2020-10-01": ["NVDA and apple are both all but guaranteed. Yeet that 1k after the next crash", "Say it does crash, would you do AAPL or NVDA? I could buy more AAPL but I feel the upside to NVDA is much higher, but it has a way higher share price"], "2020-10-02": ["preciate these \n$GIII $NVDA $MRNA $OSTK"], "2020-10-04": ["The consoles have been known for months and nothing with them is going to move AMD's price unless we get news about good sales or higher orders. THAT SAID: I also think AMD is going to moon and am long stock in it still despite having doubled my money already. \n\nI think this because I don't think their potential strength in PC GPU (both consumer and enterprise) markets is priced in. They're going to be newly competitive with NVDA up and down the product line (not at the very top end, but for every segment below, that there will be compelling reasons to buy the AMD equivalent over the NVDA). This could be huge- we might be looking at a repeat of Zen 1 vs Intel here."], "2020-10-05": ["I am very long on NVDA as I think they're going to be a HUGE player in AI.  I have increased my position recently. That said, I encourage you to do as much research as you can and make your own determination.", "Just think about 10 years from now when NVDA’s killer robot overlords see this post. You’re gonna get in trouble", "NVDA rocks- best performer I have by far- I like it at 500 but that is probably not going to happen", "What’s too good? You are just being long term bullish on AMD and NVDA and long term bearish on ZM", "If you just heard about the NVDA AI play I’ve got an electric car company name that will knock your socks off", "thinking AMD is even the hint of a threat to NVDA is the most retarded thing Ive read in a while", "All in NVDA. \n\nGaming+Stonks = Life"], "2020-10-06": ["Kind of a tough one and I need to sit down and start some resources for this. I've written some hacks for Emacs that will read text, etc., and use those every day. NVDA is great but it can be a hard transition for a sighted person, the control scheme can feel restrictive if you're not that blind. Some IDEs to try with it are Notepad++ and I think Visual Studio is reasonably accessible.\n\nMy hacks for Emacs are kind of outdated, I'll need to update them when I hand in my dissertation but here they are:\n\nhttps://github.com/smythp/eloud", "I use discord if you want to try it. It's free, mainly used for gamers but anyone can use it. And they are super cool on PC version. I use NVDA and they are currently making their own screen reader. for now however they have a function where they can track what your screen reader is doing, only if you allow it, so that they can make one that is adequate and up to the level of the screen readers we would normally have. I can't wait to see what the do with that.", "I didn't notice it change, maybe I just didn't get the update yet. Also I'm not on NVDA.", "The NVDA website has some training materials that might work. I don't know of any other resources.", "You have your dates wrong, that's why. NVDA reports Nov 18th after the close. Nov 13 expiration is not post-E like you stated. Either way, when one is bullish in the short term around earnings, there are strategies you could consider. Check out this channel for examples of actual trades: [https://www.youtube.com/channel/UCFIyWqPyzUreNDLaJl28qrA](https://www.youtube.com/channel/UCFIyWqPyzUreNDLaJl28qrA)", "Sounds like windows and NVDA could be the best choice here.\n\nI see in their latest release notes for 2020.3 RC1 there is mention of specific improvements for VSCode. I believe it focuses on making the UI more responsive on suggestions etc. So there is a definite focus on making a great accessible dev environment.\n\nI personally use NVDA on windows for VSCode and a few other bits. BUt, i also heavily use emacs with emacspeak on the Mac. I like the power of emacs and the fact with emacspeak it is incredibly accessible, not to mention geared towards developers and none mouse based interaction. With the latter having benefits to blind people as we mainly use the keyboard.\n\nAlso worth noting, WSL works well with NVDA. I have an Ubuntu instance, that i run through windows terminal and use NVDA with."], "2020-10-07": ["From TOGGLE's Daily Brief\n\n&gt;Today, we look at an NVIDIA pattern: this is a particularly interesting one because TOGGLE highlights a relationship between the DXI DRAM index and NVDA stock price. DXI index tracks spot pricing of Random Access memory chips: small digital electronic semiconductor devices essential for computer memory. Moves in DXI often indicate the balance of short-term supply and demand in the electronics industry. TOGGLE points out that across the 8 episodes in the past when DXI was so far negative, it typically preceded a 15% rally in NVDA stock in the following 2-3 months.\n\n[tldr in Youtube](https://www.youtube.com/watch?v=1NrajSTRJ_s&amp;feature=youtu.be&amp;ab_channel=ToggleAI) \\+ [full article](https://toggle.ai/f/a/0b161e54-0777-11eb-9957-126addc0f4d4)"], "2020-10-08": ["Here is what you want to do:\n\nLet w\\[0\\] = \\[1/3, 1/3, /3\\] be an initial vector representing your fraction of wealth in INTC, AMD, NVDA respectively. You will need to get a table of daily close prices for each and then calculate their returns, in matrix form call this R such that R\\[i\\] represents the returns of each asset on day i. Notice that w\\[i\\] = (w\\[i-1\\] \\* R\\[i\\]) / sum(w\\[i-1\\] \\* R\\[i\\])  (\\* represents elementwise multiplication) and your return on day i will be R\\[i\\].dot(w\\[i-1\\]). Many people make the mistake of just taking 1/3 of each return on each day and adding those up, but this is not correct since your wealth composition in each asset changes as the assets grow / shrink in value."], "2020-10-09": ["I'd also consider INTC to be a hedge against China. With the US cracking down on Chinese tech companies, I wonder if they could eventually use TSM to put a squeeze on US chip designers like AMD and NVDA? If TSM is eventually pressured to no longer support US chip production, or even just forced to scale back production for US companies, INTC has fabs to support their business. I see INTC as isolated from US/China trade tensions, and could be very important for US domestic production. If The US starts delisting Chinese companies, I'd want to be in INTC."], "2020-10-11": [" \n\n\\#NVDA IS IN PLAY\n\nMultiplier (X) to 1.226932. from 1.228384.\n\nBuy Stop Limit (BSL) to 550.77. from 551.77.\n\nConverted Cash Reserve (CR) to Trade (T) at approximately 551.77. (Share: 1) bringing the Average Price Paid (APP) to about 551.77.\n\nJust to reiterate, I placed the following order(s):  \n\\+ Buy 1. Shares @ Limit Price: 550.77."], "2020-10-12": ["NVDA", "It’s just all about your appetite for risk. There are no sure things in the stock market.\n\nTSLA is a favorite of many people on here but some have concerns that it is overvalued because it’s market cap is about 10 times that of GM.\n\nNVDA is certainly cutting edge but is also at a high valuation compared to similar companies. You have to be betting they keep putting out the better product and that the market continues paying a premium for the better product (sometimes the market prefers the cheaper option).\n\nARKK gives you diversification but you have to pay management fees. \n\nSo if you’re sure those companies will continue increasing in value, go for it. You could make lots of money. However, if those companies hit a profitability wall a few years from now and can’t make enough to justify their high valuations, you could lose money.", " \n\n\\#NVDA IS IN PLAY\n\nMultiplier (X) to 1.190541. from 1.226932.\n\nBuy Stop Limit (BSL) to ASSESSING. from 550.77.\n\nSell Stop Limit (SSL) to 569.30. from ASSESSING.\n\nConverted Trade (T) to Investment (I) (Share: 1) bringing the Average Price Paid (APP) to about 551.77.\n\nJust to reiterate, I placed the following order(s):  \n– Sell 1. Shares @ Limit Price: 569.30."], "2020-10-13": ["Bought 10 NVDA calls at 590", "I bought NVDA at $26... and sold at $150.\n\nFML", "Has NVDA even used a stock split move yet? Pretty sure they still have one they could use that to increase their market cap by 20-30% easily", "I got out at 574. Good luck to you, sir.\n\nI think NVDA to 694.20, no doubt... maybe just not until (this) Friday. Maybe next, tho?", "I’m too cheap to play NVDA so I play MRVL as hard as I can. IV is wayyy lower too.", "Trump would never to do anything to crash stonks. If anything, he's gonna say something that'll make the cum/piss shoot even higher; aka NVDA to 600, instead.", "If you think NVDA is going to hit 590, why not just buy the stock now at a cheaper price instead of a call at 590?", "I know its just stock but I've been holding NVDA since 104, its been my best stock by a long shot. Funny part is it basically tripled from 30 to 90 in late 2016, and I hesitated buying because I thought it mightve missed my chance at tendies, and soon after Citron research said to sell, but diamond hands prevented me from that fortunately"], "2020-10-14": ["I think NVDA commits to keeping the jobs in UK and it sails through.", "NVDA is in California. And no, it's not substantial. European markets sell when the US buys, and buys when the US sells. It's a nuisance, at best."], "2020-10-15": ["But that's the thing, there is no opportunity cost for holding open the trade to squeeze the final few dollars. For example, keeping the NVDA 440 that expires Friday isn't stopping me from selling any other puts.", "Well that suck, didn't get in NVDA, but able to get NFLX, still lost out, on to the next play\n\nStill think it going to breakout early next week, that hasn't changed.", "All these technical posts on NVDA, there no way the rest of the sub can they were caught unaware 😉"], "2020-10-16": ["In ~2018-2019 my largest holdings were SQ(flat) Amazon(flat), NVDA (massive tanking)\n\nAt the beginning of 2020 I became more active sold SQ and picked up Tesla, Shop and SE and easily beat the market. SQ did come back but theres no argument that reallocating to things like Tesla made me more money still.", "&gt;Because Reddit seems to be good at picking out winners not only in the short term, but in 4-5 year time spans as well… I’ve seen a lot of topics from 2016-2017 where people were bullish on companies like AMD (40x), MSFT (4x), NVDA (20x), TSLA (9x). Some were bullish on failures like GE, and Intel but even if you picked those as well, you still would’ve been up tremendously over the market.\n\nSo seems like there's a lot of personal anecdotes without any baseline data here - reddit's userbase is big on stocks that 18 - 29 year old white males actively use in their everyday lives, no big surprise there, which I guess is underpinning your theory that \"efficient market hypothesis applies to money managers, but not to the userbase of /r/investing, /r/stocks, etc\", no? \n\nYou also claim that \n\n&gt;Some were bullish on failures like GE, and Intel but even if you picked those as well, you still would’ve been up tremendously over the market.\n\nSo I'm sort of confused - the non-standard reddit basket of equities that you'd commonly expect (AMD, NVDA, TSLA, and more recently BEP or whatever renewables stock de jeur is making the rounds on the front page) out performs the market (and we'll just ignore measurement dates for now and just leave that statement as handy waive-y as you made it), but their non tech-picks are failures.....but \"if you picked those as well, you still would've been up tremendously over the market\" (again, without any return figures or multiples.....)\n\nSorry man, I get where you're trying to go with this, but you're argument just sounds like it's based on anecdotal evidence from browsing /r/investing and not on any sort of hard-and-fast, sound data. \n\nI also think it'd do you some good to beef up your academic background/knowledge on how asset pricing fundamentals work, and why your goal of  \"I’d rather take a medium risk, high reward opportunity, than a very-low risk low-reward opportunity\" is inherently flawed - you're compensated for two things in a liquid, efficient capital market: bearing risk and committing capital. Thinking that you're going to be rewarded with an incremental return greater than the incremental risk your taking on is....well, not going to end well."], "2020-10-17": ["BABA, NVDA, SQ, AMZN, DIS", "AMD, AMZN, NVDA, SQ, TSLA (I'd wait for a bit of a pullback for the last two). That's just my personal opinion.", "Might recover, but will take quite a while.\n\nTheir debacle at 7 nm chips put them way behind other chipmakers, who are already focusing on 5 nm.\n\nYes, they have other assets outside of CPUs to buffer them.\n\nMeanwhile, NVDA is not only making progress on their processors but expanding to self-driving technologies, too.", "NVDA all the way. NVDA this year for me has been my bread and butter not once did it hit red.", "I only have INTC atm. If I have to choose INTC vs NVDA, wondering which one is better bet for 5-10 year growth.", "NVDA", "Value investors will say Intel just because it's cheap, but there's way more growth potential in NVDA.", "NVDA has more room to grow revenue for sure, but with current valuation does it have room to grow in value?", "&gt; but there's way more growth potential in NVDA.\n\nYea, and most of it has been priced in, which is why it grew so rapidly. In order to make more money off of NVDA, you have to expect even more growth than the hype.", "NVDA is such a hot stock; it comes with this lavish story of ruling the world because of their GPU and AI and machine learning. And it might be deserved. It truly has been growing at a tremendous rate, and its future prospects look clear and positive. That is what makes it very non-risky IMO. It has such a clear path to growth and that inherently makes it less risky. As a side-effect, its expected future growth is kind of low. Of course, this would be fine if you are looking for low risk stocks.\n\nSide note: volatility is not a great measure of risk if you are intending to hold instead of swing trading.\n\nIntel, especially with the whole 7nm debacle, has been discounted A LOT because now its future growth potential is a lot more cloudy. It is actually very risky. Will Intel succeed in its new data-centric model? Will they beat AMD again? Will they retain their market share? All these questions are risks for no growth in the company.\n\nSo there you are. If you are looking for risk, Intel is probably the better option. NVDA is a safer growth stock.\n\nDisclaimer: I hold INTC. I have done quite a bit of analysis on them, and I just can't believe how severely undervalued they are.", "INTC is quite attractive at the moment, although it's a short-term play for me and one I'll probably be exiting fairly soon.\n\nNVDA is one of my favourite long-term holds and one of my portfolios largest positions. It's expensive at the moment though. I haven't added to the position in quite a while.", "Yes, your conclusions make sense, and I agree. Intel and RTX are much more risky and have a bigger upside because of it. Value stocks are riskier stocks and more risk = more reward.\n\nHow can I be sure? Well, NVDA is trading at a PE of 100, and don't even get me started on TSLA. These metrics indicate that the market is expecting massive growth in profits over the next years and the PE will after a while return to \"normal\". Like NVDA might maybe have another 25-50% upside, but over what time frame? Maybe a year? After that how much unexpected growth can you really have in NVDA or TSLA? These guys are massive and are going to get massive. Their growth indicates that most people believe that. If a 100 PE isn't pricing in huge growth, idk what is.", "AMD would of been a much better buy in 1H 2020 IMO, much more room to grow than INTC, stick with it it will recover + you get dividends. NVDA is quite overpriced atm best to wait for a dip, it will come."], "2020-10-18": ["Growth would be one factor. It depends on what you picked most of mine have beaten the broader ETFs. There are some unicorns like Tesla, but even if I don’t include that NVDA , AAPL, SQ , MSFT ,CRM, AMD, JD and TECHY to name a few have done exceptionally well for me . \nThings that didn’t go so well, but holding on to my long term strategy BA ( currently at a loss overall) PFE (not much movement ) and NTDOY ( even with sales numbers being good - slow growth ) I have held most of these for the  past 4-5 years with adding positions overtime along with dividend reinvestment. Stocks that I sold or changed strategy on FB ( good gain) UBER ( barely broke even) Solar stocks ( over all lost 10-12%) . I am invested in ETFs and mutual funds via 401k and other managed accounts for the account I manage I prefer individual stocks after some good DD. So far it has paid off, but market won’t always appreciate a good company so don’t get too attached if you do go this route .", "There is a guy on yt who makes pretty good videos about calculating valuations based on fundamentals/cash flow. He did both of those a while back:  \n\n\nAMD: [https://www.youtube.com/watch?v=OdBge8nclfE](https://www.youtube.com/watch?v=OdBge8nclfE)  \nNVDA: [https://www.youtube.com/watch?v=e4bK8IO8ZGY](https://www.youtube.com/watch?v=e4bK8IO8ZGY)", "When you own individual stocks in a non tax shelter account (so not your RRSP/TFSA for Canadians) you could sell one of your winners and take the cap gain that you can then offset against one of your dogs. I have a big NVDA position with nice gains but I also have a dog that blew up (not buying that one again ...not 31 days later, not ever,)So with individual stocks you get to control what and when is sold to your max benefit.", "ARKF (SQ, AAPL, SE)\nKARS (NVDA, TSLA, NIO)\nARKQ (TSLA, JD)"], "2020-10-20": ["&gt;What should scare you is that you could take a serious haircut and the company would STILL be overvalued regardless of what you want to tell yourself.\n\nYes, this is a commonly overlooked fact: just because the market is pricing a sector currently at P/E 40 (or 30) is not some universal law that could not change. People are forgetting that 20 used to be a common multiple for growth stocks. To get a \"look through\" view of this market, forget SNOW and look at MCD trading at PE 36 and a dividend yield of 2.25%. That's what low interest rates get you.\n\nAgain, this is why I mentioned DCF because despite being nonpractical in many ways, it is a sound way to reason about price whereas relative comparisons are not.\n\nWith NVDA, if it crashes 70% from its current level but the business or its prospects do not change, I am fine with that. In other words, I am immune to multiple compression and would welcome it (but there's no way in hell I'd expect it).", "The core flaw here is that based on *your* research NVDA isn’t actually overvalued. A lot of the people who have trouble with value investing, do because they have trouble understanding value. You can’t just plug in a DCF calculation and think you have it figured out.\n\nStocks are a lot more complex than a single equation. You’re not only predicting cash flows but future growth also. Because 3 years from now some other guy is also going to be predicting cash flows, so you have to factor in an estimate of *his* prediction. After all, that’s the guy you’ll be selling to.", "With respect, I never said it was based on research. In fact I said it out of sheer humility at this point (something that I think might not be a bad idea for NVDA investors in general). Do you have a ballpark number for what the DPU business revenues are going to be in 5 years from now? What will have happened to Intel, AMD? At this point it's pure thematic investing, not value investing.\n\n&gt;You can’t just plug in a DCF calculation\n\nNo shit. DCF is handicapped and useless in many ways, but for some things it at least makes some sense. I think once you cannot even consider it, that's where things get hairy. At least NVDA pays a dividend which is some indication value will eventually get returned to shareholders (compare this to e.g. Google that has never retired more shares than it has issued to its employees...).\n\n&gt;After all, that’s the guy you’ll be selling to.\n\nThis is buy high and sell higher / greater fool thinking. I don't care about the next guy, I only care about my claims on future cash (even if we cannot accurately predict that).", "To me value investing just means buying companies below their intrinsic value. Often that means mature companies with low PEs, but ‘expensive’ companies can still be undervalued—for example I think Amazon and Peloton are undervalued even though they are trading at ‘expensive’ valuations. \n\nNo matter what, I’m never buying a company that I believe is trading above its intrinsic value. I do financial analysis for every company I consider buying because ultimately cash flow is the only thing that matters in the long term.\n\nNow if you plug NVDA into a simple DCF equation, it looks overvalued. But with due diligence you may also think their earnings growth rate is higher than what the market expects (those “hopes and dreams” you mention), in which case it could be good value for you. \n\nI’m not sure if that answers your question but that’s just how I look at it. No matter how much you love a company, valuing them on anything but future cash flows is a losing strategy.", "Btw the comment about \"next big thing\" is great. I feel that these crowded ideas are where you find most of today's \"thematic\" investors. What I generally try to look for would be:\n\n- Misunderstood companies or disliked sectors (e.g. energy companies with strong balance sheets right now?)\n- Sentiment changes (e.g. NVDA in 2018 when I bought it after the crypto crash)\n- \"Busted\" IPOs\n- Forced selling unrelated to the business (e.g. spinoffs or ETF constituent changes)\n- Good businesses emerging from bankruptcy with new potential (e.g. DPZ or NVR a long time ago)\n\nAnything else I'm missing?", "i mean thats where the investment world is at these days. I agree NVDA is a great business but once you get out of the value investing framework youre basically hoping for the best. Youre telling me youre willing to accept a 70% slash to your equity value? Even if that is unlikely that mentality should raise warning bells. A 70% downside is like a 300% gain, ask yourself if you can see as much upside as downside. Personally I dont see it, if nvda goes to like a 1trillion mcap thats means that the market is in major trouble and we have real economic issues. pretty much all good businesses are starting to trend this way, where even though the underlying businesses are good the shares are just so overbought it wont matter how good the business is because their actual earnings are being priced so highly. \n\n&amp;#x200B;\n\nDividends are nice because they come out of the companies real revenues and arent tied to the craziness going on right now."], "2020-10-21": ["NVDA may drop. But not because it’s canceling an unannounced upgraded version of the card that they released just a month ago. You know what would be better business? To sell their current new card and then release the upgrade in 6 months to a year.", "Puts on NVDA? Let me sell them to you $100p 10/23", "Buy NVDA 10/30 600c for like 1.00 tomorrow and thank me next week"], "2020-10-22": ["I think NVDA is a $1000 stock, but I picture that in the next 3 years. Not by the end of next year. But if it does hit $1000 in a year my shares won’t be complaining."], "2020-10-24": ["You could turn the NVDA into a spread if youre still bullish and recover some money and cap out your profit . The $ZM call is kinda a lost cause at this point imo unless some huge catalyst comes out.", "I'd feel real bad if I gave you advice that ended up being bad, but my take is to sell the ZM call soon and hold on to the NVDA calls. Nevermind that ZM is trending downwards, the call has a high theta and IV so I think the odds are stacked against you. In comparison to ZM, I would think that NVDA has a lot more going for it, it's one that's has before and likely again to benefit from a earnings runup, and I think it will continue to benefit in the short term from the perceived weakness of INTC standing in the semic market. Also the calls just look a lot better in terms of the Greeks. Anyways hope the best for you and whatever you decide to do!!!", "I think the CEO is playing finance games to prop up the stock: Selling its NAND division for $9 billion to make its margins look bigger, and using the money to fund a $10 billion stock buyback.\n\nI'm holding, exiting at $55, but not buying any more.\n\nI'm not buying NVDA or AMD because they might be overvalued. I do have synthetic stock in MU(since they don't pay dividends).", "INTC seems to be averaging 10% growth a year.  That's not bad, but its not as good as AMD or NVDA.  INTC looks like its set to be a decent value stock.  But I don't see how it could get back to $60 anytime soon.", "Buy AMD on Monday sell Tuesday then see where Intel is at. I think there are way better plays.  I bet it trades sideways for at least the next 3 weeks and will fall some more as NVDA and AMD have good news and go up.", "I hold a small position recently made smaller. \n\nThe company has a ton of cash and definitely has the tools to make great products, but it seems they were content resting in their laurels and missed out on most tech trends.\n\nNow they’re playing catch up in fab process, something that can’t be fixed quickly and they’ll enter the discrete GPU business. This’ll be the third time they try to enter this market and will have to go directly against AMD and NVDA... \n\nI’m holding my remaining stock but won’t be buying more and as another poster said: if it hits 54/55 again, I’m out.", "Removed post for vague title.  \n\nPlease indicate the content of your post via your title as a courtesy to the readers and the archive. \n\nIn your case, what would be desirable, something like:  \n\"Advice on losing positions: NVDA call 462.50 Nov 27, Zoom $580 call, both down more than 40%.\"\n\nThousands of traders have been waiting for these down moves."], "2020-10-25": ["Sorry I dont know if I completely understand. NVDA for example it says \"bearish\" but the strike is a few dollars above ITM calls. How are we supposed to interpret the seemingly disagreeing datapoints?"], "2020-10-27": ["It’s just a trade or a successful investment. Might’ve been a short or long one (0-5 years) but it’s not the end of the world. You made money and I think you should be happy with that.\n\nThis line of thinking is unhealthy and will lead to FOMO chasing if you keep this train of thought up. We’ve all been here, should’ve bought TSLA, AAPL, SHOP, NVDA, etc. at the bottom. I could be a multimillionaire by now! Why didn’t I go all in on all my margin... wait I should’ve bought calls! To the moon!\n\nSee the problem? Accept and move on, be happy you made money and hopefully more profits than losers. Find another trade or investment, even if unfortunately it means buying back in at a higher price (not what I’m recommending). It sucks, you feel like an idiot. But the world moves forward, you booked a profit and that’s what matters. Don’t beat yourself over 20-30% returns."], "2020-10-28": ["I have a few on my list. Some of them I already own and I’d like to add more, some I’m hoping to add for the first time.\n\nSHOP, SE, NVDA, GOOG, GOOGL, ZM, ADBE, AAPL, TSLA, PYPL, AMZN, NIO, NFLX"], "2020-10-29": ["Really? Even with windows and NVDA?\n\nI've looked through the manual for the orbit and it doesn't mention pressing H, B and all that. If this is true, it's great!", "It wouldn’t, because the gestures are passed on to the screen reader. You can configure NVDA to take any type of input from the orbit, with a few very minor exceptions, and do what you want with it.\nYou can even emulate the keys, for example to press control and S, I press space and see for control, then  Braille and S.", "I was thinking SQ and NVDA have biggest drops but now that you mention FB and looking at its graph since march i think you may be right. Thanks", "I just have a bad feeling in my gut about FB, I also passionately dislike zuckerburg lol, I was going to put down NVDA but I decided it wouldn’t be as big as FB and SQ"], "2020-10-31": ["NVDA is an AI/data center company unless you can prove that part of their business is failing. Don't even bother buying puts on NVDA. AMD's GPU's look good but they won't make a noticeable dent in the NVDA GPU earnings any time soon.", "Have you seen the current revenue streams of NVDA compared to 2018 or their guidance?", "If you think NVDA's market is just related to video games you should do a little research :)", "Intel has a PE of 10 I believe. NVDA and AMD have 60+. I know which ones are the better choice though.."], "2020-11-02": ["I do think that ARM is a good acquisition for NVDA, but it is also riskier than the xilinx deal. Assuming it gets approval (long shot), it will be a race to change its business model, which will disrupt ARM's existing revenue streams. The bigger licensees will look at alternatives like risc-v as they know nvidia will become a competitor with huge time to market advantage.\n\nXilinx and AMD can take its \"do no harm\" approach towards integration to seek synergy without destroying the value of the original company.", "Yes, the risk of NVDA acquiring ARM is clients goes to other alternatives. I guess some may already start the transition project.", "I think China won't approve this acquisition. Unless NVDA decides not to sell products in China.", "Yeah. That’s a good idea. Investors see more possibility from NVDA/ARM deal. Not a lot people understand FPGA, so it’s hard to image what AMD can do with it.", "Since Oct 28:\n\nAMD -5.2%\n\nNVDA -6%\n\nAAPL -6.7%"], "2020-11-03": ["Given the circumstances AMD was in a few years ago, a valuation of 2-3$ wasn't unreasonable. \n\nHowever, they have improved their business significantly (obviously) and gained market share as well as margin increases. We are at a different stadium in the game now where they are the leader in CPU technology and going head to head with NVDA in GPU. \n\nEvery valuation depends on how the outlook and current situation is at that point in time. And I have given my reasons why **at this point** a valuation of 75 is definitely a bargain. \n\nYou can't just look at graphs and make investments decisions based on the lines you see.\n\n&amp;#x200B;\n\nBut hey, everyone can have their own methods I guess..", "Valid points well. But you have to take into account that these markets are increasing as well. Especially in the current lockdowns. Record demand in laptops, data centers etc. And there is still market share to be gained from competitors. Intel and NVDA trade at 200B and 320B valuation I believe, AMD is 'still' at 90B.  I am not saying this stock is going x10 soon. But the way they are positions it could easily reach 150-250B valuation.", "INTC also seems to be priced in that they will never figure out how to mfg the next set of chips.\n\nAMD, NVDA &amp; AAPL should be at a discount as their chips are made in Taiwan and what happens when China decides to finally take action on Taiwan?", "That's a bit comparing apples and oranges if you don't add perspective.\n\nNVDA has 2x revenue and gross profit of AMD.\n\nINTC has 10x revenue and gross profit of AMD.\n\nSo, NVDAs and AMDs valuation are currently similar, all other metrics left aside.\n\nINTC has a lot of decline priced in, which is yet to happen - as well as AMD has a lot of growth priced in which is yet to happen.\n\n\"easily reach 150-250B valuation\" basically means that you expect AMD to keep or expand their growth of 50% yoy over the next 2 years and still maintain that high P/E ratio.", "Was in at 28 sold at 34.  It was my first 100 stocks i ever bought. My DD as a gamer was geez. AMD is only 28 and NVDA is like 160.  I should buy AMD and it'll go up to 160 too!.", "all right OP, selling 10 NVDA and getting 65 AMD (got 25 shares @ 131 in January 2019)\n\ndiversify, thnx"], "2020-11-04": ["AMD finally has good gaming GPUs, though Nvidia still has a monopoly on datacenter GPUs. That said, supply shortage and real competition from AMD... looks to me like NVDA should take a diver after earnings", "Also consider AMD getting their GPUs out there. If NVDA is strained on supply and AMD has been able to stockpile some extra cards, their internal performance testing could suggest a bump their share of sales. Ryzen 5000s + RX6000s looks rather enticing to gamers, which could impact NVDA outlook.", "Made 500 off NVDA today off a 5k I put in yesterday", "NVDA will be at least 750 a share this time next year. This is one stock I just keep buying every time it dips 7-10%.. been at it since it was 45 a share. Long."], "2020-11-06": ["Can I have your thoughts on NVDA. Been looking at it for weeks now. I already have a position. Currently thinking of trimming to average in here. I see massive growth w them next 5-10 years", "Dont try to time the market. Waiting for a dip can make you lose many opportunities. Follow the trend. Dont ever go against it. I am getting closer to 1000% gain this year alone. Investing blue chips if you dont have 5-6 digits is useless imo. Most people in this sub will say 20-40% gain a year is good but its really not, especially this year. You should be aiming a lot higher than that if you want an early retirement or financially independent. I am not trying to be cocky or anything. Just find a good 2-3 growth company and invest in them. Stocks like NVDA will make you 2-3 baggers possibly in 3-5 years if you invest in them now but if you find a solid growth company, you can make 5-10 bagger in months. Not trying to be offensive, but this post is kind of useless for new investors. You basically made an ETF on your own. If you just invested in a solid etf and it wouldve made more than that in march. This post is very misleading imo", "NVDA 83%? Jealous, can I ask what price you got in?", "Also want to chime in: when picking individual tickers instead of indexes or ETFs, you should really have a good understanding of the industry and/or the company and it’s current standing. Not faulting OP, but INTC’s woes have been written on the wall for a year - good play on NVDA but a major oversight/blind spot in semis to pick INTC over AMD at any time in the last 16 months. \nDiversification preserves wealth, concentration builds it. If you are comfortable with the risk and knowledgeable about the sector, it’s okay to pick a handful of industry leaders/innovators instead of the sector index. But you’ll also get burned if your picks are not grounded in reality", "I agree. Market sentiment playing a big part right now - for $NVDA and pretty much every other tech stock out there. I’m in this long-term.", "Yup NVDA is great!", "I've got 3 videos that cover NVDA. Just search for my YouTube channel: Not Dumb Money. You'll recognize the bull 😉", "I think it's time to take profits and diversify. Everything NVDA does AMD will do better. Even Mellanox uses AMD Fpga (xilinx).\n\nARM acquisition will fail but even if it went through I don't see any immediate benefit. Nothing is stopping them from making ARM chips today. They already do.\n\nI just can't justify 4x the market cap over a company that has a bigger TAM and more leading fundamental tech. Even Tesla switched to AMD in their cars.", "Did you ever have NVDA?", "i got in at that time too. I bought a mercedes with early road sensing technology that adjusted the suspension accordingly. Spurred me to learn about this and it looked like a huge future was in store which seems obvious now. NVDA has grown into such an outsized part of my portfolio that my investing day is determined by how NVDA does. But i cant sell it because its so solid. I mean what am i going to buy that better?"], "2020-11-07": ["I love how the autists think that anyone trading TSLA, SNAP, NVDA are browsing this sub lmao"], "2020-11-08": ["You can use Steam with NVDA, but it is a bit difficult, you need to work with NVDA OCR. Also is Steam a streaming service? I did not know that."], "2020-11-09": ["**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**NVDA**|**$600**|**BUY CALL**|**2020-11-13**|**$1.07**|**$553.44**|**3190**|**18332**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckhay9q65g9pi0738stz11xja) | [Track Record](https://www.pickmojo.com/user/Responsible-Intern31/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "Honestly looking at NVDA, AMD, and INTC it puzzles me... NVDA aside... how is AMD down while INTC was up this morning ...\n\nLike in what world", "More competition from AMD (-3.21%) graphics cards could also be playing a small role. Also (some) other tech companies are down as it may not be NVDA itself.\n\n* NFLX: -8.59%\n* AMZN: -5.06%\n* FB: -4.99%\n* MSFT: -2.38%\nTSLA: -2.02%", "I was just looking at that. AAPL, MSFT, NVDA, AMD, all got clipped. Maybe with a vaccine looming people won't be getting new gaming rigs for Christmas?", "Rotation in reopening stocks today and unwinding of lofty tech valuations. \n\nCheck the chart, your immediate (short term) downside risk is 50d EMA at 521. \n\nNVDA been knocking at the ATH door before today's sell off.", "NVDA its in a bubble and fueled by hype, so its very sensible to any event and overreact strongly for any new related, good or bad.", "I'm very bullish on all three and have significant positions in all of them.  If NVDA successfully acquires ARM, look out.  I doubled my AMD to 400 shares when it dipped to $75 recently.  Cash is dead, and PayPal is a fintech leader with a lot going on. Also consider SQ.", "LOL YOU'RE 19!? lmao why do you have the portfolio of a 65 year old man trying to retire on dividends. The good news is you absolutely hit the jackpot on timing the bottom. The bad news is REITs, Airlines, and Oil will probably never net you these kind of gains ever again, but definitely hold on to them if you got them at a the bottom. PYPL, AMD, NVDA are all good companies I would also throw in INTC for the value play might as well make it a semiconductor basket. AAPL, MSFT, and FB are must own companies imo especially if you're comfortable with PYPL, AMD, and NVDA valuations."], "2020-11-10": ["NVDA’s hit this same level a couple of times the past 1-2 months...", "Intel took the big hit when they admitted they had leadership and internal fab competition issues. Not to mention pinning their CPUs thermal limits while AMD innovated and this year became the market leader in desktop CPU performance (especially gaming).\n\nMy take: AMD and especially NVDA are overvalued. INTC is under valued (apparently ~40%), and is probably getting much less investor eyes b/c they are now a mature “me too” company. No longer an innovator or market leader, with less future growth potential.\n\nThis is paired with AMD and NVDA notably becoming “darlings” in the tech world. Even with a fraction of the earnings AMD was toping out 2x INTC price this year.", "I'm not confident that they've had a lot of 3000 series cards to sell this quarter, so my guess is that segment of their business will not end up reporting particularly good numbers. NVDA's a good long term play though"], "2020-11-11": ["You have to account for number of shares outstanding.\n\nApple has 17 Billion outstanding shares, NVDA has 620 million, whereas Lindt only has 195k.", "&amp;#x200B;\n\nSorry to hear it, but all I can say is that it just takes time.  If you're using Windows as an OS I believe either NVDA or Jaws will work just fine.  If you're using LINUX I can highly recommend Orca as a screen reader as that's what I personally use.\n\n&amp;#x200B;\n\nAside from that, it simply takes time to get used to it.  I can recommend a wireless keyboard with a quality set of head phones.  Trying to type on a laptop keyboard albeit possible, is very difficult for me now.  However, a nice full sized USB keyboard works great.\n\n&amp;#x200B;\n\nThen again, it's just time.  Personally, upon going blind it took me about 6 months to become efficient at using a computer again, and I'm a very technically savvy software developer myself.  I remember upon first going blind I assumed typing would be no problem, as hey, I never looked at the keyboard anyway.  Then when I began typing absolute gibberish, I realized it's going to be a little more difficult than what I originally thought.\n\n&amp;#x200B;\n\nTake care man, and reach out if you need any assistance or a friend.  Best regards,", "I’m afraid that Wizards has not done a great job of making the game accessible. For somewhat better experience, I can recommend a program called Forge, which is basically a free version of MTG with a fairly good AI. It's not multi-player friendly, however, so it isn't the same in that regard. \n\nReally though, you’re going to be using the screen meeting program quite a bit, and those take getting used to all on their own. I definitely recommend NVDA, and possibly voiceover on an iOS device if you have one.", "I wish you luck on your journey to recovery. Honestly a lot of the games like mtg or dnd aren't accessible without work arounds. I don't play mtg myself just dnd with sighted friends. as far as screenreaders go voiceover on IOS devices is pretty easy to use. NVDA is free for windows and talkback is your friend if you are and androyd user. I wouldn't reccomend paying money for JAWS for windows because while it is customizible it is expensicve and your situation is temperary. I've been blind since birth so if you need any quick fix lifehacks hit me up here or in my inbox and I'll get back with you ASAP.", "Welcome to the blind world mate. Congratulations, you've ran into your first case of inaccessibility out there.\n\nUnless the dev allows support for accessibility, you'd be hard pressed to continue playing the game.\n\nNVDA is your best bet screen reader on Windows, but again, it's not NVDA's fault that it doesn't work with MTGA, it's MTGA's fault for not allowing NVDA to work with it's interface.\n\nWhile you're there, check out VoiceOver on IOS or TalkBack on Android, you should be able to find them under Settings &gt; Accessibility &gt; VoiceOver / TalkBack / Voice Assistant if it's a Samsung phone.\n\nGood luck, and do reach out if you need any help with adapting to screen readers or just want to talk about techy stuff in general from a blind perspective."], "2020-11-12": ["I mean the downside is that you hit a huge dip, get assigned, and end up buying 100 shares of NVDA for $50,000. It's not unreasonable NVDA will be at \\~$480 in the next few months, and some sort of disasterous event could drive it as low as $300. \n\nWhat will probably happen is you make $750. What could happen is you lose $1,250, with an outside shot at losing \\~$15,000.", "You'll never hear me say a bad word about NVDA, but market fluctuations happen. If you told me you wanted to buy 100 shares for a long hold to sell covered calls I'd say the puts are fine, but IMO you're picking up pennies in front of a steamroller.", "Hold up. NVDA went from 582 to 511 in 4 trading days (11/6 to 11/10) for a combined 12.2% drop. I’d say a 10% drop in 10 days is pretty damn realistic.\n\nMind you. I’m long NVDA as well but if they don’t crush ER this stock can easily drop below $500.", "Ive been selling NVDA put premium in and out for the past month for a swing.  ER is next week so you might want to trade after.  Selling premium right now is very risky unless you dont mind buying the stock.", "I'm long nvda and think its a great company even at this price.\n\nHowever $50,000 is too much money for me to drop on one company, so I wouldn't be comfortable getting assigned. \n\nBe real with yourself though, NVDA can lose a ton/per share if sentiment or growth trajectory changes.   Its not like the cashflow alone is enough to justify the price.", "Where is your edge? Did you back test NVDA at earnings using any conditions?  Are you basing this decision on price action? When I read this, you sound emotional.", "I think if you told someone in January that by September NVDA would be up over 100% they’d have laughed in your face. But here we are. It can go the other way too. That said, I’m an NVDA fan but more of a hold perspective at this price."], "2020-11-13": ["If NVDA crashes in near term it isn’t going to be specific to NVDA.. it will be macro specific, you are overthinking.. the fragility in NVDA is within the Nasdaq.. buy a put on QQQ", "Hate to break the news to you but NVDAs pricing has more to do with just 2nd gen RTX cards. [30 series]", "perhaps your wife will eventually seek comfort in her boyfriend’s ARM; NVDA $700C", "Its set up for a run into earnings.  It bounced off the 50 day EMA today, the Stoch RSI on the daily is crossing bullish, and the MACD is crossing bullish on the hourly.  They are expected to show a 46% growth in revenue year over year, and 44% increase in EPS.  There have been 35 upward estimate revisions leading to this earnings, and no downward.  Expectations are crazy high, and the stock is coming off a 14% sell off.  If the market is stagnant or green over the next week, I think we see NVDA run up to 590-600 again, then tank on earnings.  I think they beat, but not enough to justify a share price of $600.\n\nPosition:  11/4 545 call.  IV is only 53%.  Gonna hopefully ride the wave up then sell before earnings.", "Apple also announced its own chip for MACS... cutting into Intel.  \n\nThink that coupled with AWS is a concerning trend for sure for NVDA. \n\nAWS makes up ~35% of the cloud market and data center has been NVDAs huge bright spot."], "2020-11-14": ["So I need to both buy and sell NVDA. Thanks, you’re a life saver.", "Thanks again to the only bear worth a shit! \n\nAlso, NVDA to 700.", "I’m with you NVDA gang is back. Gonna use my gains to pay double for a 3080 on eBay.", "NVDA is doing good although not too sure if they’re priced in, they had that supercomputer deal and also the 3000 series but they’re not too hot on that scene because their supply is bad. They took forever to send them to manufacturers so manufacturers hardly have/had any time to make something good. The power draw is insane as well. Not to mention even if they have good earnings, AMD releases their DIRECT COMPETITION (6000 series GPU’s) the same day which will be sold out and reviewed and should specs be confirmed equal or greater. NVDA will not benefit from the positive earning. They’d likely stay same price or even over react and oversell which would have IV crush destroy you. Although that’s a pessimistic view of it and they could do incredibly well. But there’s just too much uncertainty, at least in my eyes, for me to try and make an earnings play. Best of luck to any that do!", "NVDA is doing good although not too sure if they’re priced in, they had that supercomputer deal and also the 3000 series but they’re not too hot on that scene because their supply is bad. They took forever to send them to manufacturers so manufacturers hardly have/had any time to make something good. The power draw is insane as well. Not to mention even if they have good earnings, AMD releases their DIRECT COMPETITION (6000 series GPU’s) the same day which will be sold out and reviewed and should specs be confirmed equal or greater. NVDA will not benefit from the positive earning. They’d likely stay same price or even over react and oversell which would have IV crush destroy you. Although that’s a pessimistic view of it and they could do incredibly well. But there’s just too much uncertainty, at least in my eyes, for me to try and make an earnings play. Best of luck to any that do!", "Oh I’m hyped. But the lack of BP in my account, on the other hand, is not.\n\nEdit: right now, I couldn’t even afford a NVDA 12/24 $980c", "NVDA market cap $330 billion, PE of 100.  Not even Netflix has that retarded of a PE anymore.  Intel has a PE of 9.  And AMD's new video cards are surprisingly good and may have caught NVDA with their pants down.  NVDA is a mature stock now.  It is a great stock and should keep growing but if it grows a reasonable 15% a year for the next 5 years that's a $660 billion dollar company in 2025.  And it would have to grow earnings 50% a year every single year to have a reasonable PE in 2025.  Also, you understand \"price targets\" aren't for right fucking now, right?  They're the target price they hope the stock to be at in 12 months!", "Lisa Su has her uncle's secret. NVDA's CEO is Lisa's uncle FYI. Family LEAKS.", "I've played the NVDA game before and learned my lesson. Crushed earnings, tanked 5%, then went up 30% the next month. Wait for IV crush then ride the wave.", "Also slight counterpoint: the valuation from my understanding has been exploding not because of their chips but because of their data center revenue and mellanox, both of which have been revising and increasing guidance. There is a data storage race going on (look at burry positions with Google, and other plays with snowflake, AWS adjacent services) and NVDA is seen as one of the key, front of the pack players.", "Gay mod and OP are NVDA simp", "You really think a company with as large of a pocket book as NVDA would fail to anticipate the demand for their revolutionary product and not produce enough of it? \n\nIt’s not that there not enough GPUs to go around  fairly to their customers (ie a traditional shortage) but bots are scalping them because they were literally able to order dozens/hundreds at a time because there was no safeguards on the website against it, thus creating an artificial shortage, kind of similar to all the panic buying of toilet paper/paper towels in March. \n\nNVDA has since fixed this problem and is only allowing 1 per customer and I hope they’re also in the midsts of taking other precautions to prevent bots as well like with recaptcha or something of the sorts.", "poor boys : AMD calls will print if NVDA kills earnings", "You're literally retarded so I'm glad you're here but this is some new level of retard. I'll explain this to you like you're 10.\n\nNVDA does not have enough GPUs for everyone. If they did, then everyone that wants one would get one. People buy many NVDA GPUs because they know a lot of people need them so they know they can resell them at higher prices. If NVDA made a lot more GPUs then people could buy from NVDA instead. People that bought several GPUs would not make enough money buying and reselling more GPUs than there is demand for.", "Bots are made by the scalpers. The reason they are active is because scalpers know they can buy all the GPUs available and deliver a profit. Take for example NVDA produces an arbitrary number of additional GPUs. Demand for GPUs stays the same but supply increases. There's 2 things that happen in this scenario:\n\n1. Bots continue to buy all GPUs available, their profit margins reduce (possibly to zero or below) because demand stays the same but supply drastically increases. They suddenly have an insanely large quantity of graphics cards and demand cannot support their profit. They stop the bots from buying.\n\n2. If bots don't stop buying all the additional GPUs available, scalpers have to increase the price to compensate for the loss of profit. At a point, people will look for complimentary complimentary goods. Then, scalpers stop bots from buying all NVDA supply.\n\n\nI'm glad they're fixing the bot issue but this is why supply was the fundamental issue with NVDA. Definitely dug themselves a hole.", "counter counterpoint, alternative chips and specialized chips are being designed by everyone and their grandmother.  \"monopoly\" on one type of chip.  just like pepsi has a monopoly on \"triangle shaped cheese dusted chips\" because they own doritos.  And again, the PE and valuation show the expectation that Nvidia will grow the data center business tremendously.  So they better put out some amazing earnings or they'll drop.  And Intel's data center revenue is still about 3.5 times Nvidias.  So NVDA would still have to grow data center revenue 50% a year for 3 years straight would still take in less than Intel.  Nvidia's main hype comes not from the chip sales, which by comparison to Intel, shows they're wildly overvalued, but on the promise/speculation that they'll be the big winner of the AI explosion in the next decade just as we just saw the cloud explosion last decade.  And not from chip sales, but from software and other solutions they sell with recurring revenue.", "If you turn off ray tracing it’s probably close. I’m just salty cause NVDA dropped ah"], "2020-11-15": ["Normally nvda doesn't move much after ER, +- 3% in either direction I've ver seen. But as stated before me, NVDA still has to trample those already high expectations AND raise future guidance by a decent amount. They normally always beat, but lower the bar for the future(which mostly always leads to selling off.). Im a huge NVDA bull, but there's this voice inside me saying there's less risk with puts than calls and would probably be better off just hedging my long shares. HOWEVER, I am currently holding:\n\n530c 11/20\n555c 11/20\n580c 1/15\n720c 3/19\nAs well as a handful of shares.", "Oh alright yea short term looks good for NVDA", "My concern is more of a general concern rather than NVDA. If MRNA or another vaccine company reports something unexpected vaccine wise does that trigger another sell off of anything tech related. I am being extremely cautious with options right now and most are not earnings plays so I agree with your process of caution leading up to", "Well, speaking of ARM... Guess who just bought ARM? That's right - NVDA", "I luv NVDA and it’s a beautiful LONG play stonk. But I was irked by its price fluctuation, something was off - with its advances, deals and fundamentals,  price should be hard rock.  \nTl;dr: it didn’t rub my dick the right way.  \nCashed out at 580 (from 490).", "NVDA is trying to purchase ARM", "NIO puts\nLOW calls\nNVDA straddles", "Many are: the whales account saw some [1200% gains on NVDA](https://twitter.com/unusual_whales/status/1326226563969380352) recently!", "Plays on NVDA?"], "2020-11-16": ["Jaws/VO/NVDA is for blind people. WCAG covers more than just blindness. I would ditch all those, and focus on the standards. WebAIM has a good WCAG checklist, Deque has one as well. Have them adopt one and stick to it, since WCAG doesn't require assistive technology to meet it. \n\nIt sounds like something in your VO settings is goofed. I am not an expert on VO.", "Pretty sure you can turn off that function thing but I'm not sure how, I've been on mac for a few years now and only use windows occasionally. May want to check around in NVDA preferences, or even keyboard settings on the computer itself. May not even be an NVDA issue. My guess is its not, but better to cover all bases.\nHope that helps, at least a little bit.", "try switching keyboard modes in NVDA's settings, and also try hitting function plus escape.\n\nPressing the numlock key may help too.", "Escape and function turned off having to hold down the function key and whatever F key I needed to use. Thanks.\nThe JAWS commands work fine to read by line, word, and character by not the NVDA ones."], "2020-11-17": ["Ummm I don’t think so.  AMD has been a stock darling with crazy high volume for years which is why this exists.  NVDA is more of an institutional hold Bc of its price.  I would search some of the other subs for stocks, options, day trading, wsb(sometimes they get it right), etc and just search NVDA and sort by most recent.", "557.5 isn't out of play.  If you care about saving a grand, take the pu$$y way out and close.  If it's chump change to you and you don't care, just let it go until the 26th and see what happens.\n\nIf you remain bullish on NVDA like you were when you originally opened this position, double down on that shit.", "As well as knowing some of the basic keyboard commands, it's worth knowing that NVDA can be a little buggy and behave weird. If you're finding it not acting as you'd expect, try restarting. It's also best to select the proper mode at startup - if you select the laptop configuration then make sure you're using a laptop keyboard or NVDA can get confused.", "This is flat out not true; I use the laptop layout on a desktop computer because I'm used to it and it doesn't actually remove any functionality. You just need to know the keyboard command differences. For instance, NVDA+a is now your read all command.", "No. I mean it's not true. NVDA doesn't get confused. There are some things you can't do without a number pad, which is basically why the laptop layout exists. If you use it on a desktop, as I've been doing for 10 years, it works great!", "Right. But you need to know the differences. So if you use laptop commands with a full-size keyboard, NVDA won't respond as you expect, i.e. you will confuse it. Which is why I suggested that a novice should make sure that they're aware of the configuration they're using. I'm not making this up, this is a user experience issue I've observed people do."], "2020-11-18": ["that's Options AI in app charts. There's a free access to stuff based on the prior close here: https://tools.optionsai.com/earnings-calendar/this-week#NVDA", "Sold a put so I can buy 3080. Probably gonna say something similar to PTON. \n\nOur shit is flying off the shelves and we have no idea how to make more!\n\nBut unlike PTON, NVDA has been at it for years now and still suck at releases.\n\nGamers think it's cuz NVDA wants money, but how is having terrible supply chains good for stocks?", "Glad I sold strangles on NVDA. Shit has some really juicy premiums expiring this Friday", "one word: datacenter.  not growing as much as it should if you exclude mellanox.  NVDA is still heavily reliant on discrete graphics card sales...", "to be fair, the guide was for record earnings. And they beat their anticipated record earnings. But i agree with your statement. stock price for NVDA and AMD are already very high.", "It's  people  playing earnings.  Price gets pump up before hand and just before  earnings release  people  sell off to take profits. They don't know if the earnings will be great or show that they are going bankrupt.  Buy the rumor sell the news. But since  NVDA had good earnings  it'll  recover  over the next couple of weeks", "I did a similar iron condor my strikes were 600/605 - 490/485, I was a bit more conservative knowing how NVDA has the possibility to absolutely sky rocket on great earnings", "I think NVDA will hold steady in the 520-530 range or so, unless the whole market tanks (which I kind of think it might - we just bounced down off the huge mega trend line that we also bounced off of on Sept 2nd).", "Happens every single time. NVDA crushes earnings but that was already expected so the stock dips, I buy more because people are silly", "Okay that’s what I calculated, wow pretty heavy call slee before ER then \n\nNVDA was ranging 535-542 today. Usually OTM puts are farrr more", "Ahoy Yoyocuber! Nay bad but me wasn't convinced. Give this a sail:\n\nOkay that’s what me calculated, wow pretty heavy call slee afore ER then \n\nNVDA be ranging 535-542 today. Usually OTM puts be farrr more", "Is there a single person in this thread who yesterday thought NVDA was a bad investment, and today because of these earnings thinks it's a good investment? Did anyone think they would not have record earnings this quarter?This is all priced in. They're up 158% over the past year, this is a good quarter, but it's not a surprising quarter.", "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**NVDA**|**$560**|**BUY CALL**|**2020-11-20**|**$6.43**|**$537.15**|**3733**|**3621**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckhod8ighk6hg0700w73okwfj) | [Track Record](https://www.pickmojo.com/user/Pfc_Pyle/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "Basically because everyone was expecting a fantastic quarter from NVDA, and that expectation had been baked into the stock price.", "Except the post market has NVDA dropping.  I'm hoping he's right, my position would like that.\n\nStill, look to the sales increase supporting a return to the all-time high.. 590.. plus.", "looking at **Nvidia** financials on [aquiloo](https://www.aquiloo.com/app/stocks/NVDA) this is such an amazing company, just waiting for the price to go down", "I also had some condors with a 575/580 upside that would have cancelled it out. I know NVDA is having supply issues and bet there would be a modest beat thats priced in. My whole strategy revolves around finding companies that I think the IV is too high. Hardly any ER for major companies spike up high and stay high without a selloff.", "NVDA used Samsung for their 8nm ampere chips, not TSMC.\n\nRumor has it NVDA is planning on moving to tsmc for their next release. Samsung has struggled get their euv yeilds high enough.", "Nvidia is known for beating its own projections. It has done so since 2010.\n\nhttps://www.streetinsider.com/ec_earnings.php?q=NVDA\n\nYou make a good point about the competitive situation. The financials show a different story. That does not mean you are wrong.", "Niceeee! My put credit spread is up 30% \n\nI’m holding m, I expect NVDA to hold 535+ \n\nIf it dips down, I’ll add more into position", "Said it before but owning  AMD *and* NVDA  (with some AAPL) is a really good idea long term IMO.\n\nToo often people look at stock ownership as they do sports teams and the like. These are *all* top class companies that are leading the future of tech."], "2020-11-19": ["NVDA is open source software and thus free. JAWS is still considered the “gold standard” for screen readers particularly for older generations that grew up with it as the only option.", "[JAWS](https://assistivlabs.com/assistive-tech/screen-readers/jaws) was originally released in 1995, while [NVDA](https://assistivlabs.com/assistive-tech/screen-readers/nvda) started development in 2006. JAWS started before the Windows OS offered accessibility APIs (like MSAA) to programmatically understand what was on the screen, so JAWS has a history of creative solutions to \"get the job done\", at any cost.\n\nFor example, JAWS installs a custom display driver which it can use to scrape raw graphics data (via OCR and other methods) to gather information from programs that don't expose any information over the OS accessibility APIs. Going above and beyond like that isn't an easy feat for JAWS's developers to code and maintain, so I'd say that explains the cost to a degree.\n\nNVDA came into the picture after the Windows MSAA accessibility API was introduced, so it tends to do things more \"by the book\", which in my opinion leads to it finding bugs that JAWS may employ a workaround for.\n\nBut both are completely separate, complex, mature codebases that [hundreds of thousands](https://www.nvaccess.org/post/in-process-31st-july/#:~:text=Well%20over) of people rely on. If you're a developer, it's worth testing to make sure your code works in both (if you can only pick one, I'd suggest NVDA). If you're trying to decide which one you'd prefer for personal or work use, you can try either for free. NVDA is 100% free, and JAWS has a demo mode.", "AAPL announcing that with their newfound extremely efficient M1 architecture, they are going to acquire intel and begin fabbing server chips in a vertically integrated computational monster of a company. NVDA announces a new ARM architecture specifically designed for monster server CPUs and that it's going to cost a hefty premium to license. \n\nI got a boner typing that.", "I couldn’t be more long on NVDA. Crazy cause I’m young and I missed the good times already most would say but I love their future with AI"], "2020-11-20": ["The article gives me a 404 error. Also I don't think there's much you can do, there's just some characters NVDA can't read. You could try switching to ESpeak and seeing if it reads them then but I don't think it will.", "That page is doing some strange things with CSS styling in that table. You can get NVDA to read those characters, but it doesn’t help at all because they seem to be using CSS to style each character as either a dash or dot. So the underlying character is the same, it is just a visual trick they seem to be using to make each character look different.\n\nThis doesn’t look accessible with any screen reader."], "2020-11-21": ["He can use NVDA + S to mute NVDA, NVDA key is usually insert.", "That would be rather tedious tho, right? Having to constantly cycle through the speech states with \\[NVDA\\]+s every time he wanted to read something.", " \n\n\\#NVDA IS IN PLAY\n\nMultiplier (X) to 1.291674. from 1.190541.\n\nBuy Stop Limit (BSL) to 538.30. from ASSESSING.\n\nSell Stop Limit (SSL) to ASSESSING. from 569.30.\n\nConverted Investment (I) to Cash Reserve (CR) at approximately 569.30. (Share: 1) generating about +3.18% ROI (Return on Investment).\n\nJust to reiterate, I placed the following order(s):  \n\\+ Buy 1. Shares @ Limit Price: 538.30."], "2020-11-22": ["If NVDA hits $505 I will sell my wife into slave labor and buy more shares.", "Uhh that actually helps tech. Like if you own tech, you actually want a lockdown, although it will do fine without one too. If you own like ZM, PTON, CRWD, DOCU, or even AMZN, you would actually want a lockdown. If you own like NVDA, AMD, FB, AAPL, you are indifferent but a lockdown doesn't hurt. The one thing you don't want is a 100% effective vaccine that can be distributed right away. Vaccine news is the worst case for tech.", "Good stuff, I like these picks. \n\nThe Dec. 18 $900 SHOP put looks pretty good at $16.90. That's a lot of stock to take all at once though. If you're thinking of going long, how do you pick your swing entry spot? I think a net $883 entry by selling that put is pretty appealing. I'll be curious to see where you choose to buy in. \n\nI'm still short a 12/18 NVDA strangle at $455/670 from a couple of weeks ago. I'm tempted to roll the put up to $500 and hope it comes down close to there for an entry.", "No you're not, a vertical spread is a DEFINED RISK. If you're assigned on the short strike, you'd sell the shares on your long strike to cover it. Your max loss is the spread between the strikes - the premium you received selling it. \n\nI don't see your point of the second paragraph. You have to manage many strategies, including your short put strategy, typically by rolling out and down to future dates.\n\nYour gains are faster without the spread, because you're not buying a put. But your capital and loss potential is much higher. \n\nHere's an example. NVDA 10/18 510/520 credit spread. Max profit $455(credit), Max Loss $545, BP $545. Now get rid of that 510 leg, and your Max Profit jumps to $2215, with a Max Loss of $49,785(this is your tied up capital for assignment) with a BP of $10,166. Now if that stock goes far south of $520 you've bought 100 shares at $520 for a potentially $0 stock. \n\nDo you get it yet?", "No need to bash my strategy. You literally just said it yourself. On a spread you have defined risk where if the stock price goes below your long put strike you're on the hook for MAX LOSS. The max loss you gave me on NVDA is if the stock goes to zero. I will wire-transfer you $10 million dollars if NVDA goes to $0 in the next 5 years. If it doesn't you wire me $10k, does that sound like a good deal to you?\n\nLike I mentioned in my post I do this on stocks I actually don't mind being assigned and then wheeling. What I am doing is getting in on a stock at a price I like, if not I collect the premium and do it again. If I am assigned I wheel back to profitability without taking the realized loss on the position.", "I made a fun money account because we can't freakin travel; Albania, Japan, Ukraine.\n\nThe fun money account is up almost 107%, just with solid picks around March; ZM, CCL, MGM, NVDA, and SPCE up 16.75%.  Now I got more places to pick out when that is a good idea again!\n\n\nEdit:  SPCE up 16.75% since buying last week.", "It also depends on if you have margin. With PM the buying power required to naked short NVDA is a lot less than 100%. And if you really think NVDA is going to $0, then selling either puts or spreads is a mistake. \n\nJust because a spread is defined risk doesn't automatically mean it's less risky.", "I'm not bashing your strategy, use whatever works for you. I'm correcting your wrong statements so people reading this wall don't get the wrong information.\n\nYou start your strategy with\n\n**1.** I don't do spreads  because if the stock price blows past your long strike and you assume  max loss you need a lot of capital to actually be assigned the shares. (which is wrong)\n\nThen in the very next line you say\n\n**2.** I only sell cash-secured puts with the capability to be assigned if need be.\n\nSo you don't do spread because you're afraid of being assigned(you won't be), but you do cash-secured puts because you don't mind being assigned. Got it.\n\nNVDA would only have to drop more than $5 below your strike for you to start realizing losses greater than the spread max loss. Besides, if you REALLY wanted to, you could just convert the spread back into a short put by selling the long put you initially purchased. Then you'll get assigned, and apparently that will make you happy.", "I completely understand what you are saying. In your scenario (the one you gave me for NVDA), you are accepting a $500 loss.\n\nYou had $500 max profit and $500 max loss. The stock going below the long put strike price would leave you being assigned 0 shares and a realized loss of $500.\n\nWith CSPs I don't realize any loss. I am assigned the shares and begin the wheel strategy (something something works until it doesnt). The whole premise of my strategy is to not realize a loss and run \"the wheel\" on any assigned shares.\n\nWe're on the same page, but I don't think we're articulating it properly to the other person. Let's just agree to disagree my man.", "Except you've now tied up $50,000 in capital purchasing 100 shares of NVDA, and hoping selling calls against it will offset potential losses in stock price decline. If it works for you it works, the wheel is a pretty conservative strategy that has been around forever. Again, my problem isn't with that however, it's with your wrong information elsewhere.", "When you sell a naked 520 NVDA put, your max loss really isn't 49,785. You can cap that max loss anytime by just turning it into a spread, delta hedging it, or getting rid of the option. That's just a theoretical number since NVDA won't go to 0. In fact your \"loss\" on that naked put position is a LESS than the loss on the 520/510 spread if the stock goes down to 510.", "Not with the delta hedge. Sell the put, sell 45 shares, dynamaically adjust it to spot (I probably sell 25 to underhedge it and buy back to 0 flat if NVDA starts going up). Then it's 100% pure theta/gamma play. Sure if you never delta hedge, then whether it's a spread or just short naked puts, there's both a theta and delta component.", "What do you think about AMD vs NVDA", "Both are good, I made money off AMD last week, check my profile for the post. AMD stock is over-extended right now up a lot in just 7 days. I prefer the risk to reward on NVDA at this very moment.", "Well, just a couple of points:\n\n-\tMarvell is not a product company, it’s more of a services company. They rely on projects from customer to design their chips.\n-\tDefinitely the smaller product companies don’t have resources to design their own chips, so they get something off the shelves from Marvell or have them custom design it.\n-\tThese days there is a trend that all the FAANGs of the worlds are designing their own custom chips catering to their need. E.g - XYZ is designing their own server chips now, for which earlier the contract went to Marvell, so Marvell had to shut their server business due to lack of interest and lay off 150 people this month.\n-\tAny smaller company with a successful 1st gen product is going to move to their own in-house designs for their next versions, so Marvell’s business is very volatile.\n-\tIf the projects keep changing, they are not really improving on their product, they are just improving on their services.\n-\tSo it’s definitely not comparable to NVDA/AMD/INTC etc; However the stock price will be on par with semiconductor index.", "Mixed bag of whats happened in years past in NVDA, some up, some down. The technicals here say NVDA down.", "I updated the thread at 11am with positions. SHOP and NVDA I must do shares unfortunately. I could sell a SHOP $900 put and buy a $700 strike for a couple bucks, but that would open me up to more risk if I enter more positions.", " clearly consolidating for another leg up. if it was gonna dump it would have done it by now $NVDA $WIMI", " having a hard time breaking this level but once it does 👍🏽 $GOOG $NVDA $WIMI"], "2020-11-23": ["That's pretty cool. I use the NVDA screen reader. I will Google on that for a bit. Not sure yet.", "There isn't a text block command for NVDA unfortunately.", "NVDA does support jumping to the next non-link text by pressing N in browse mode.", "&gt; How do you stay enough effective and productive with just using a screen reader? Can you learn to be almost as effective as a sighted person?\n\nPersonally I can't, and as a result I do not develop professionally anymore as I'm extremely self conscious about my limitations as a blind developer.\n\n&gt; How do you deal with accessibility issues such as using VoiceOver in Visual Code? Do you just try hundreds of IDEs and programs? VoiceOver is a bit clumsy in my opinion compared to NVDA.\n\nI use Xcode as an IDE for developing apps for the Apple ecosystem and as an editor for developing other kinds of things, which is more or less what I used to do back when I had sight but instead of using Xcode as an editor I used vim on the terminal.  The only difference between now and back when I had sight is the way I mark large source files for navigation: Xcode has rotor settings such as jump to next error, jump to next breakpoint, jump to next mark, and jump to next function which are extremely important to me now.  You can access these settings by pressing Control+Option+Command+Arrows, where Left and Right moves you to the previous and next rotor setting while Up and Down moves you to the previous and next item.  Marks can be added to code by either using `#pragma mark` followed by a description of the mark in the C family of languages or by making a single-line comment with \"mark\" as its first word.\n\nI also use the terminal a lot, which is an old habit from my sighted days, and that too has extremely helpful keyboard shortcuts such as Command+Arrows where Up and Down moves you to the next and previous marks on the terminal, Command+U drops a mark on whichever line the cursor is positioned, and Command+Shift+A selects all the text between two marks, which by default are dropped on every command line prompt.\n\n&gt; How do you deal with missing semi colons, brackets and indentation when building your code?\n\nRegarding pairs of quotes, parens, brackets, or braces I just type both the opening and closing pair before typing the text inside, and have the option to do that automatically disabled in Xcode's preferences so I know exactly what I type.  Regarding semicolons (which I tend to forget after coding in Swift for a while) compilers do a pretty good job at reminding me.  Regarding indentation that's something you learn to live without, just like you learn to live without syntax highlighting, but if you truly need either you can press Command+Option+T or CapsLock+T (if you have CapsLock enabled as a VoiceOver key) and it will tell you the color of the text, the line number, and the indentation level including the number of leading spaces and tabs, and to make sure everything is properly indented for the sighted, you can select all the text in a source file by pressing Command+A after making sure that it compiles without syntax errors followed by pressing Control+I to re-indent everything.", "I'm 20/800 and a programmer and you'd be suprprised how fast I work (faster than a median sighted dev). I use Linux and I've bound a fourth mouse button to read any selected text. I have no central vision but I can detect blocks of text on a web page and know the layout of most commonly visited website well. I just draw a quick selection around the target text and hit my mouse button. If this sounds interesting I could set up a github repo with info on this, I use a short script in bash to read text out loud using Espeak (I like it) and bind the key using xbindkeys. For 20/100 you probably won't need NVDA and something more targeted at low vision / VI probably makes more sense, though NVDA is really useful to know.", "I'm in a bit of a weird place. Because I started with Cinnamon when I learned Linux, and haven't bothered to ever create a new install, and customized everything a bunch and don't want to update, I can't use Orca on Linux. My understanding is that Orca is adequate-ish but a big step down from, say, NVDA. The way I use the computer is very hybrid, I use my remaining low vision to parse interfaces and read all text with my improvised screen reader. I also use Emacs a lot for various tasks, not Emscspeak (though I do use that on Windows) but a vanilla version with some customizations. But it works well, and sounds like my vision is a lot worse than yours, so maybe you'd also find it useful. I do know a number of totally blind individuals who use Linux with espeakup only on the terminal, so it's doable but pretty limiting."], "2020-11-24": ["I've added about $15k of NVDA between $510-520. I'm guessing it takes off next week.", "Not only reduce their margin, but make their entire foundry business a huge liability. How Intel is going to continue to get any advantage by being both foundry &amp; architect is the #1 question mark going forward for their long term value (surprisingly not mentioned in this review). The only other company in the world to pull it off is Samsung and they are far more vertically integrated. Everyone else has gone fabless, and that inefficiency is ultimately what's causing Intel is lose market share to AMD and NVDA. Until that is addressed, Intel is a strong \"no\" for me until at least 2022 or whenever their 7nm prospects become more clear."], "2020-11-25": ["**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**NVDA**|**$600**|**BUY CALL**|**2021-01-15**|**$8.65**|**$518.31**|**8164**|**762**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckhx3ldq1jo5q0716y7c25oph) | [Track Record](https://www.pickmojo.com/user/GlobalRevolution/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "First it's PLTR you fucking retard and second you just need a portfolio with 100% PTLR and 100% NVDA and you can retire on Mars", "What I should do: Look into triple nets in TX or FL. Maybe accrete cash for an eventual Stripe IPO\n\nWhat I probably will do: Size up $U, $NFLX, $NVDA\n\nWhat I want to do but probably won't do: Tesla roadster or a new 992 GT3 (RS when it comes out).\n\n&amp;#x200B;\n\nOr idk. cocaine/hookers is always good.", "Agree, NVDA was good earlier this year, it’s matured. Pass", "NVDA has a different fiscal year", "Position Stats: NVDA 600C 01-15-2021\nRecent best performance: 861.42%\nAll time performance: 16.47%\n[Price history chart](https://tendiechart.com/pricehistory.cfm?symbol=NVDA&amp;date=1610668800&amp;s=600&amp;t=C)", "I sold MSFT, which has been almost stagnant for months, to buy PLTR at $17. MSFT is a great company but valuations are changing based more on sentiment than fundamentals right now. Just felt like a waste of money to sit in MSFT which was up 2% overall for me when there are better opportunities in smaller cap stocks with more room to run. \n\nIn addition to MSFT, I also sold NVDA, and ended up starting large positions in PLTR, CHWY, CRSR and NKE. Feels like there are a lot of good options for growth right now.", "Followed you on some NVDA and SHOP shares and up $200 on my small account. Thank you. You da man", "&gt; MSFT NVDA and CRM\n\nOMG this has to be why the bubble stocks that are way overvalued and normal investors are avoiding, have been going up in the past couple of days. People are taking their profits on other successful trades (like EV stocks) and plowing them back into the same old bubble stocks. \n\nThat is so sad and you are delusional.\n\nIndex investors have found one way to get around the fools who have inflated a handful of stocks and keep putting money into them: they're investing in equal-weighting index funds. Those are outperforming the index funds weighted by market cap. This is allowing people to specifically avoid getting dragged down by inflated bubble stocks like AAPL, MSFT &amp; NVDA. \n\nIt's really sad that you're taking money from stocks that are moving and putting them into bubble stocks that are deflating. Talk about taking money from that which is working and injecting it into yesterday's successes that have hit their limit. Well, when you're done throwing your money away on these crazy-overvalued stocks that were good investments months ago, at least the investors who are really interested in these new growth areas will be the ones left in them. \n\nI think the same thing probably happened [back in the early 2000's when people liked to take the money they were making in tech stocks like Cisco, Intel and Oracle and plowing them into \"real\" stocks Columbia Energy Group and LG&amp;E](https://money.cnn.com/2000/02/28/markets/markets_newyork/), LOL.", "I haven’t been buying index funds myself. I’ve been stock-picking individual stocks. I thought it’s been obvious since Sept 1 that the tech bubble stocks have topped out and have been underperforming indexes and dragging down any ETFs that they’re part of. So I’ve been stock-picking individual stocks\n\nI dod see a front page article on Barrons today equal weighted index funds so I’ll quote from that. It mentions one\n\nhttps://www.barrons.com/articles/equal-weighted-indexes-are-winningand-thats-a-good-sign-for-stocks-51606303801\n\n&gt; Since Sept. 2, the NYSE FANG+ Index—home to FAANG stocks Facebook (ticker: FB), Amazon.com (AMZN), Apple (AAPL), Netflix (NFLX), and Google parent Alphabet (GOOGL), plus other big tech names like Nvidia (NVDA)—is down around 2%, while the **S&amp;P 500 Vanguard Value exchange-traded fund (VOOV)** is up 7%.\n\n&gt; The S&amp;P 500 Equal Weight Index—in which all constituent stocks have the same weight—is up a touch below 10% since Sept. 2, which indicates that many stocks are participating in the rally. **Big tech has dragged the standard market-cap weighted index to a much lower gain.**", "https://www.barrons.com/articles/equal-weighted-indexes-are-winningand-thats-a-good-sign-for-stocks-51606303801\n\n&gt; Since Sept. 2, the NYSE FANG+ Index—home to FAANG stocks Facebook (ticker: FB), Amazon.com (AMZN), Apple (AAPL), Netflix (NFLX), and Google parent Alphabet (GOOGL), plus other big tech names like Nvidia (NVDA)—is down around 2%, while the S&amp;P 500 Vanguard Value exchange-traded fund (VOOV) is up 7%... Big tech has dragged the standard market-cap weighted index to a much lower gain.\n\nI guess I’m the one who gets to inform you that tech/coronavirus bubble stocks have been underperforming the rest of the market since Sept 1. \n\nUntil about 2 days ago, then TSLA &amp; the same old bubble stocks started doing better suddenly for no rational reason. I was wondering about what kind of morons were buying those over-inflated meme stocks. I thought there was some pension fund or call-buying whale behind the buying.\n\nCome to find out some idiots are intentionally selling off the new crop of new-tech growth stocks to pump into those old bubble stocks that are have been falling behind the rest of the market, when they could be making 3 times as much by putting their money into any other random, non-bubble stock.\n\nThe only explanation for how some people can have no idea what’s going on in the stock market outside of their few stocks is because they never look at what stocks other than the ones they know are doing. If you bothered to compare the tech bubble stocks’ performance to other stocks’ performance at the time, you’s see that [days like this](https://imgur.com/dUiC3fE) where the bubble stocks have been dragging while other stocks were lit up, have way outnumbered days where bubble stocks have done as well as other stocks.\n\nHoly cow. I wonder how many people have been throwing their money  at this bubble, thinking that they’re still winners. Selling iff their EV stocks to buy more MSFT, LOL"], "2020-11-27": ["List of shitron fails:\n\nNVDA: Now one of the biggest tech names and the future of AI\n\nEvergrande: Now the biggest real estate developer in all of fucking China\n\nTSLA: Now one of the biggest EV producers and the world leader in autonomous driving \n\nSHOP: Now one of the biggest names in Online E-commerce\n\nNIO: Now the leader in EV and autonomous driving in China and biggest competitor of TSLA\n\nNFLX: Imagine shorting the flix....\n\nBLNK: total meme stock, but it Shot up 10% today. I'm sure Shitron is fuming lol\n\n&amp;#x200B;\n\nTLDR: Andrew Left is a gay bear loser who is wrong 9/10 times.", "What a nub. Andrew, you should spend more time on WSB. This thing, like NVDA, has way too much momentum to stop via a single firm's short.", "Haha he was right for 3 weeks. $NVDA 530 now. So hold PLTR for 3 years to make 5x, got it.", "I don't know how far dated they are, but if you are just asking me which one is more likely to stay OTM for your short puts, clearly the TSLA 12/18 350 put is more likely to be OTM by then.  However, the NVDA 450s probably are worth a little bit more in value.  Again, I just assumed 12/18 expiration.  On expectation (this is important, since this is different than probability of being OTM), the TSLA 12/18 350s are slightly better imo.", "NVDA 450 100%. Tesla going to the 🌙🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀 and will never drop below 550. Better luck with NVDA 💯", "I would actually sell some higher strikes for a bit more premium.  For example, if I were doing TSLA, I would sell the 420 strike (that's a not a joke) for 12/18 and collect a bit more premium.  I think you are getting about 100 dollars for the 350 strike, but you'll get about 240 dollars or so for the 420 strike.  For NVDA, you'll get around 140 or so for the 450 strike.  But the TSLA 12/18 420 put seems like a good one to sell to collect about 240.  These numbers I'm just estimating based on EOD close numbers, but could be slightly different Monday.\n\nThe thing is for me, that is little, but it seems like you don't want to choose one that close to ATM (since both of yours are are so far OTM), so I think 420 is pretty reasonable.  It's far enough OTM you don't have to worry too much and it's a bit more premium than the 350 strike.  Tesla can drop quite fast, but I doubt it goes below 420 by 12/18, especially with the S&amp;P inclusion.  I'm long shares/net options on both btw, but if you just want some theta strategy, I think that's fine.  You might even want to try something like sell the 420 strike on TSLA and buy 5 shares of NVDA or something.\n\nJust note by doing this, it ties up a ton of buying power, so understand there's some opportunity cost here too.", "Thanks for a great info. Much appreciate your insight. I was looking at 3 months chart and I feel like it’s gonna drop a bit but I am not sure if this will happen or not. I picked TSLA 350 cause accordingly to 3 months chart, the lowest was 330ish. Again, I am fine owning these stocks at that strike price but at the same time, I am fine walking away if not exercised. I feel like TSLA may drop significantly in the future due to their insane run. For Tesla, I am comfortable with 350 or at the most 400 but i would be somewhat hesitant anything above 400. For, NVDA this one is a tricky one. I suppose 400-450 is a fair value but not sure."], "2020-11-29": ["Keep the iPad. Get a device with a keyboard if you really want to use windows. I know Microsoft narrator has touch gestures, but I can’t imagine all that many people use them. I’m not sure about NVDA at all. Touchscreen laptops are a thing, so you can get something with the touchscreen is an additional input on top of the keyboard."], "2020-11-30": ["Basically I need NVDA to not go below 510 by expiration date for me to bank 9.6k from my 40k that I put into this trade.", "I personally use technical analysis to predict the movement of the stock. NVDA is right at a level of ascending support on the daily chart. NVDA bounced from it today, so hopefully it will hold for the next few weeks.", "Yes I have OrCam MyEye2 since June this year and EnvisionGlasses for around 3 weeks. Im veryvtech savvy had iphone for 5 years, have ipad air at home, wibdows laptop with NVDA before used Zoomtext,  have used numerous Android tablets and phones since version 4 my daily driver is now a mid range Nokia with full updates now Android 11 fully accessible. \nI used tons of accessibility apps with \"the same\" functionality often free. \n\nI requested demo at home first and basic functions demonstration was included. \nSo why I bought used Orcam? \n\n- Often my fav apps after few months/years just went gone/missing, weren't available to download both on IOS and Android. Or developer stopped fixing them, lost interest,  sold to someone,  deleted his accounts and his apps. On Android when I still had app instilled I could extract APK but after a while there were compatibility issues with new system versions after 4-5 major updates. Finding good replacement isn't easz. \n\n- my wrist and hand can rest. Im walking with cane daily for years and require movements strain muscules , add to this hours of typing on laptop (work and school) and smartphone use. Orcam can be used with voice commands or touch gestures,  holding heavy phone (&gt;150g in ine hand in awakard positions) phone vertically or hirizontaly atvtext our product level at shopping was tiresomeiften due to lack of optical image stabilisation images were too blurry and OCR wasn't able to read out text. OrCam or similar is under 100g you have free hands for touching or using cane less muscule strain. \n\n- works fully offline: auto language switch, face color money detection, product barcode recognition\n\n- useful intelligent cues:  text is upside down, light is to low - turns flashlight on if needed,  tells if any text is skipped if anything is cut off and from which side. How to move your head to correct it and its very accurate. \n\n- point to read and finger follow (kind of VoiceOver finger following) sometimes I want only little portion of text not what all cqmera seeing. I can scan with finger over the package or page and orcam will read out whats \n\n- for now PRO only [SmartReading](https://youtu.be/Ru1DN0NdfqY) voice navigation in scanned text \n\n- less privacy issues - in many places in europe using phone is forbidden you may be accused for taking photos and videos without written permission of others and be fined and police will be called. Happened to me sometimes people thought I was taking photos of them or their kids but I was using OCR app to read prices that were at distance,  explaining didn't helped police was called but none was punished. Just some overreactive persons saw that im using my phone at the store and \"possibly taking photos\" without permission multiple times. It's forbidden in stores and public places in Europe, recording soundvtoo\n\nBut yes battery is not superb its easy to charge with any powerbank trough as any smartphone. The other disadvantage is you can't export scanned text due to copyright reasons in eu so worldwide its banned :( (…  but EnvisionGlasses can export scanned text for now hope it stays so)  If you want to save a lot buy it from someone I paid this way 1/4th of original price for new device and contacted company they switched battery for new one because it was still under warranty so I got like a new fully working for much less.", "Nah stopped b/c I found premiums on NVDA to be better for some reason. Been eyeing TSLA too but damn if that shit aint volatile."], "2020-12-01": ["NVDA has no CPU Teams. in fact, only Intel, Amd, apple and Arm can design CPU properly now. Which one do you think they can afford to buy?\n\nSamsung and Qcom already left the custom CPU core business.", "lol....You are out of touch.  Other than Apple, NVDA, QCOM, Samsung all uses the latest ARM reference core design. they no longer afford to design their own cores like Apple. \n\nFor example, Denver 2 was using A57. Qcom snapdragon 888 is using Cortex X1.\n\nIt's like AMD today doesn't have a custom ARM core like Apple. Apple is the only one has a complete CPU design team like Intel/AMD."], "2020-12-04": ["Not NVDA!", "I’d think another 200% upside isn’t late to the party at all if AMD overtakes NVDA on GPUs.", "My bad, for some reason I thought NVDA was a little over $500B. It’s only $330B.", "I’m asking whether AMD will overtake NVDA as well tho", "AMD released GPUs on par with NVDA at almost the same time, instead of 5 months behind like with INTC.\n\nGap with NVDA appears even smaller than with INTC. AMD overtaking NVDA may come very much sooner than overtaking INTC.", "NVDA is tough to overtake. It won't happen anytime in the near future. AMD closed the price to performance gap on NVDA but at the end of the day NVDA cards are still just better. Not only that NVDA has government contracts in the defense industry and other avenues that AMD doesn't. NVDA is highly protected.", "AMD Radeon 6000 series is performing on par with NVDA, not just price/performance. 6800 XT is now ranked #4 on average user benchmarks for GPUs. The 6900 XT may take the #2 spot when it’s released. That’s a smaller gap than with INTC for CPU benchmarks.\n\nYou should look at the links I posted. I thought the same thing as you until I saw how tiny the gap is now, and that’s without driver optimization for AMD’s new cards. Digital Foundry did a really good job on performance comparisons between the 6800 XT and the RTX 3080.", "But again you need to realize that the amount of revenue these companies generate from GPUs is not their biggest source. You want to talk about AMD overtaking NVDA, it's not about just Radeon 6000 series and RTX 30 series. You have to consider government contracts, data centers, etc. AMD could surpass NVDA as far as PC GPU's and still not surpass them in market cap. That's why AMD overtook Intel not because of solely CPU performance but because big data center customers left Intel for AMD.", "Interesting thought. \n\nAlthough NVDA’s revenue is still mostly gaming GPUs. Their automotive segment seems pretty far behind TXNs.", "My take is AMD RDNA2 GPU has closed the gap with NVDA significantly, but still a tiny bit lagging behind. That being said, if you ask  most PC enthusiastic today, they will just pick whatever GPU available to them at MSRP. In short, AMD is taking GPU market from NVDA, but certainly not as quick as it did on CPU to Intel. ==&gt; investor will then follow.", "NVDA's largest revenue is graphics but that doesn't necessarily mean gaming GPUs. NVDA has government contracts developing graphics processors for military drones. Their graphics revenue stretches so far beyond just gaming.", "Agreed. Keeping cards in stock is definitely a huge factor in this. If AMD doesn’t get vendors enough inventory, they won’t even scratch NVDA’s lead.", "Intel and AMD both go up together. Look at their historical charts \n\nThe success of AMD in PC gaming doesnt negate Intel's success everywhere else:\n\n&gt; At Intel, our strategy is to deliver the world’s best semiconductors for an increasingly data-centric world. Over the last few years, we’ve initiated a transition from being a PC-centric company to a data-centric one and expanded our product offerings in order to seize new market opportunities. \n\nI'm long AMD, INTC, TSM, and NVDA.\n\nThey all will go up. This isn't one or the other.", "I mean AMD can overtake them I just don't think it will be any time soon. NVDA has twice the revenue and is 4x more profitable. As of right now. That can change. I got my stake in AMD and I like them as a company they just got a ways to go.", "You clearly haven't read anything\n\nIntel and AMD both go up together. Look at their historical charts \n\nThe success of AMD in PC gaming doesnt negate Intel's success everywhere else:\n\n&gt; At Intel, our strategy is to deliver the world’s best semiconductors for an increasingly data-centric world. Over the last few years, we’ve initiated a transition from being a PC-centric company to a data-centric one and expanded our product offerings in order to seize new market opportunities. \n\nI'm long AMD, INTC, TSM, and NVDA.\n\nThey all will go up. This isn't one or the other.", "NVDA will be the first semi company to break 1 trillion", "Personally, I’d disagree on NVDA not being complacent. I think they were complacent and acted like AMD wasn’t there, especially with the RTX 2000 series. NVDA got away with overpriced 2000 series GPUs because their lead was that huge, thus, that led to AMD filling the gap by the next (now current) generation. AMD was able to attract employees from both Intel and Nvidia with sexy comp, so that probably helped a lot.\n\nHonestly, I didn’t think the 6800XT would come close to touching the RTX 3080, but it does and sometimes performs even better. I was used to seeing AMD always being far behind in second place. In comparison to last gen, the Radeon VII was so far behind in performance.", "We’ll see December 8th when the 6900 XT rolls out. \n\nIf AMD 6900 XT numbers are accurate and it can trade blow for blow with the RTX 3090 for $500 less. I think that will be evidence of NVDA’s complacency, rather than a lack of competition.\n\nThe DLSS competitor will be out soon enough.\n\nHowever, DLSS and ray-tracing won’t really matter for mainstream. I have an RTX 2080 Ti OC with a closed loop and never use DLSS or raytracing. My 27” 4k @ 144hz monitor isn’t fully utilized when I have those settings turned on.", "Guess we’ll find out when the 6900 XT comes out next week. \n\nEven if they achieve all those things, card stock will be the biggest decider on whether AMD can chip away at NVDA’s lead.", "With enough money and poached NVDA employees, anything is possible", "NVDA engineers paid more than AMD \n\nBetter total compensation &amp; base. \n\nHow are we poaching again?", "so right now you hold shares in those 5 companies. you sell covered calls for premium. and you do cash secured puts (NVDA) to pay for your margin interest?", "&gt;so right now you hold shares in those 5 companies. you sell covered calls for premium. and you do cash secured puts (NVDA) to pay for your margin interest?\n\nsort of. I don't often sell covered calls because I have a tough time pricing them correctly. In fact I actually use them as a counterfactual. When the premium for the call seems too low to justify the sale/risk of disposal, I actually tend to buy them. I happen to have a large tranche of covered $TSLA calls ($182 9/21) because of some fuckery that occurred earlier in the plague - but rather than eat a big cash loss to keep my shares, I basically turned it into a rolling tax loss that allows me to kick the can down the road. \n\ncash secured puts are a relatively high risk/low reward trade. If you look at my sheet, 11K in a week sounds good, but consider that if it was purely cash secured, i'd be effectively risking a half million for that. \\*however\\* if you have a box short, you can turn it into a win/win. that trade only really unlocks after you have some capital appreciation though. Happy to elaborate further if this is something you're interested in.", "2010. I saved $800 after working at REI and a pizza joint and bought shares of $TSLA relatively immediately post IPO. After college, I was fortunate enough to join a relatively well-known tech firm quite early on that eventually IPO-d. My equity grant gave me a base upon which I could collateralize some leverage.\n\nI went deep into what I knew. I was working in tech so I bought tech stocks. I happened to be in the right place at the right time (even though at the time it seemed like I was late to the party) as the shift to growth was really gaining steam (2017). I got assfucked hard at the end of 2018 when the Fed started raising rates but learned some lessons from ineffectual panic sales/shorts and brushes with margin calls.\n\nBottom line. Buy with conviction and set price targets. Don't try to get too creative too quickly. If you buy 200 shares of $NVDA at $250 and now it sits at $500, maybe open a box short against 50% of your position to return your capital/lock in your gains. But because it's a box short, you may be able to defer your taxes. If the price subsequently drops, start shorting puts against the box to monetize. If it rises, close the box, take your dollars, and roll it into something else."], "2020-12-07": ["Thanks! I actually have a larger portion of my individual stock positions in my Roth IRA than in my other accounts, because I made the bet to  take on more risk (but more growth upside) in there. It ended up paying off - a number of my highest returning positions like NVDA and TWLO are in my Roth, and now those gains won't be taxed.\n\nNot really considering alternative investments right now, but always open to learning more and changing my mind later. I'm a crypto skeptic, and I like equity better than real estate for diversification  (and also feel more confident in my ability to pick stocks than properties.)\n\nHonestly, haven't thought too much about what my post-FIRE plan is. Right now, my focus is just on the FI part, and then I'll reevaluate my next steps based on where my life is at / what my priorities are (e.g. having kids might change my view on things). I think that I'd want to keep doing *something* productive with my time, whether that's my own entrepreneurial pursuit, or volunteering, or completely switching tracks and going to culinary school, or something. We'll see!", "Very nice work, I am also a second Gen American.\n\n$2.5 MM is a very good target.\n\nMine is higher, but it is more of a personal score I want to obtain.\n\n$1 MM would be great enough for me.\n\nAlso good stock picks, I am also in NVDA and SQ.\nQCOM is another big one.", "Bought MU, NVDA, INTC, AMD, TSM, QCOM, AMAT and SOXX in 2016 - 2017, but sold over 75% of my positions on the way up through out the past couple years including all of QCOM, INTC, and AMAT. Should've held on to all of them. That was when I started trading and was scared of losing money. I hold the rest long term now. \n\nI have some fractional shares of AVGO, LRCX, STM, NXPI, ADI, MRVL, AMAT, QCOM, and TER on my M1 Finance account to get some exposure to other semi stocks I like that I don't have or no longer have in my main portfolio.\n\n\nWhat I recommend are outside the four you have listed are\n\nEasy and mostly stable: SOXX and SMH because they are semiconductor etfs. These have stocks that I'm not bullish on or think that growth is not as strong as the rest of the field like TI and INTC which is why I made an M1 for my own \"semiconductor etf\" \n\nSemi equipment manufacturers: AMAT, LRCX, and ASML\n\nLong term growth: QCOM and AVGO\n\nCyclical: MU and EWY (South Korean etf for Samsung and SK Hynix)", "Congrats!! You’re doing incredibly well! (31F software dev here wishing she wishing she had that high a NW). I also find it annoying when so many people assume women aren’t great with money-certainly doesn’t help with gold diggers and shopaholics but that doesn’t reflect all women! Growing up my mom handled the finances since she’s better than money, and now, I’ve been helping my fiancé save because he didn’t grow up knowing much about saving.\n\nI relate with you in a couple of ways-I was fortunate enough that my parents paid for my college (in state public which made it possible for them) and my mom instilled in me that it’s much more important saving for yourself and never living above your means. I haven’t been as aggressive and wonder many a time if I should save more but I think I have a fairly happy balance even if it slows down my NW growth\n\nGood job holding long on your stocks-my biggest stock regret is selling way too early on NVDA (sold them at the low 100s and now they’re around 500!)"], "2020-12-08": ["You shoulda been here in 2017, it was NVDA city", "Love AMD but it won’t kill or impact NVDA.", "1- Everyone and their goddamn grandma knows all about NVDA and has for many years. We all milked that cow until powdered cream dribbled out the teets on our faces. \n\n2- \"long term\" in WSB is about 8 weeks. Perhaps you thought you were in /r/WarrenBuffetBets or something.  Nobody is going to be lining up to suck your little pecker for their 4% NVDA gains on Valentine's day. \n\n3- Why dont you STFU and read the room for a little bit before you kick in the doors shouting people down with your \"hot tips\".", "Well, one thing is you don’t want WSB to talk about your stock too much or it’ll go down. \n\nBut seriously, yeah I’m just starting to learn chart reading and I may be a smooth brain but it seems likely NVDA is getting ready to enter that next leg up to $570. I thought the GANs news would boost them today a little more, but alas it did not. It being stuck in that low-to-mid $500 range for a month now has killed a lot of attention on it. \n\nI think they’re - obviously - an outstanding company, but I’m a poor so I can’t afford too many shares. But currently I’m trying to time so options plays around them and ride their next big wave to $600 and beyond.", "The 6000 series from AMD is competing with the 3080 and the 6900XT will probably come in a bit below the 3090. Also the bulk of sales in GPUs are for mid tier cards, so.. I'm not saying AMD is about to take over NVDA, but it has potential to claw back some market share in the coming years for sure.", "Pretty big NVDA hype train this summer during tech run up too.", "Some good as DD , someone help me find the best calls for NVDA", "Ok I would say AMD is better as they are competing for the crown for cpu(which they’re winning and are much more affordable) and also gpu(which are a contender to NVDA)", "Yes not as advanced as NVDA but it’s getting there and seems to be but AMD is a contender so it’s undervalued for the position it’s at. But if you want to take the risk that’s on you and I would take the precaution such as researching their alternatives to the things that make NVDA appealing to you", "Apple is the most recognized brand in the world. Go with Apple. I do like NVDA and TSM too, but you can't differentiate in the semi space, brand-wise, as you can with Apple products.", "I had it at 46.77 then decided to quit and invest in somewhere else such as NVDA or AAPL", "I own both AMD and NVDA. Personally I am more bullish on NVDA because they seem to be beginning to diversify beyond chip building. I’m not trying to discount the lost profits that AMD could possibly take from the gpu segment but NFVDA has already expanded into data centers and seem to be on the forefront of the AI/ML generation. Plus they are still catching up to the autonomous driving generation. Combine that with the possible acquisition of Arm and you could have the next trillion dollar company. \n\nWhile I am super bullish for amd and dr Lisa su, I think nvda is more diversified for the future.", "With recent developments, I see Nvidia taking market share from AMD and Intel in the coming years. Apple's M1 demonstrated that ARM-based SoCs are the way of the future, and x86's days are numbered. Nvidia recently purchased Arm Limited, so are in a good position to make a profit once Apple again has meaningful competition in the low-power, high-performance portable space.\n\nAs far as NVDA vs AAPL, I'm (literally) going with AAPL, personally.", "I look at AAPL as stable and low risk with a decent return. On the meantime, NVDA as somewhat stable and somewhat high risk with a high return. The price fluctuation is greater for NVDA but it’s also giving a better return I think.", "Short term NVDA might edge on $ return to pocket. Long term, AAPL.\n\nApple Machine 1 aka 🍏M1 chip is only the beginning. As more Apple silicon come into play, it’ll dominant in more space. ML can already be done by other outfits not exclusive to Nvidia. \n\nGPU is also doable from other outfits including Apple. Matter of time in performance.\n\nThose ARMs are kicking butts. Apple produce more products and has a wider audience aka consumer = cash.\n\nRandom thoughts.", "Lol didn’t they announce a shortage for the next 3-4 months?\n\nEdit: people aren’t talking about NVDA cause WSB loves AMD and Su Bae! So do I! Marry me Lisa please!!", "NVDA has been destroying my Apple shares in return.  But have you ever thought of Taiwan semiconductor manufacturing?  They are my biggest position.  Decent p/e too.", "I like NVDA cause they are by far the best option in AI/ML out of AMD, INTC, and etc. we shall see how it turns out.", "I'm basically stranded by NVDA since September.\nThought I would be safe with such a good company with solid value and prospects but no, my strikes are too retarded and too near.\nBut yea in the loooooong run like 3 or 5 years it will go far up."], "2020-12-09": ["I think NVDA is a coiling up nicely!", "Your portfolio is essentially 70% these stocks: FB, AMZN, AAPL, NFLX, GOOGL, MSFT, TSLA, AMD, NVDA, TSM, ZM\n\nI would say that the easy criticism is that your portfolio displays high amounts of idiosyncratic risk. if something unpredictable happens that destabilizes one of these companies, your portfolio will be hit especially hard. Idiosyncratic risk is typically eliminated through diversification\n\nYour portfolio is exposed to high amounts of systemic sector risk. If the tech sector begins to see low future returns for some reason, your porfolio will be hit especially hard. This can be fixed by diversifying across all sectors. \n\nYour portfolio is exposed to high amounts of systemic asset class risk. If large cap growth stocks see low returns for an extended period of time, your portfolio will be hit especially hard. This can be fixed by diversifying across asset classes. \n\nYour portfolio is exposed to high amounts of systemic market risk. If the US market enters an extended recession like 1980s Japan did, your portfolio will be hit especially hard. This can be fixed by diversifying across foreign markets.", "FAANG, TSLA, AMD, NVDA\n\n\\- \"a bit conservative mate\"", "NVDA no question.", "NVDA.  Part of my portfolio.", "I own ADBE and believe its a better play over the long term as it has a wider moat than NVDA, which is in the cutthroat and capital intensive semiconductor industry. One misstep on NVDA's part and they will turn into the next Intel in the blink of an eye. Whereas ADBE has a wider moat between it and it's nearest competitor and now is a capital light SaaS play.", "NVDA", "Man I had like 3 paragraphs typed out and then my phone decided it was a good time to download an update for the Reddit app and I lost everything I wrote.\n\nAnyways buy NVDA.", "I agree but NVDA also is a player in the AI world. Not against your suggestion at all, just trying to decide. I can do fractional shares but prefer to own one or the other since my portfolio is already tech heavy", "Interesting perspective. With NVDA, they are expanding in the AI field so they are more than a semiconductor company which is why I bought a position with them back around August. Not against your point of view at all, just want to read different opinions since I am tech heavy", "Your profile says Software engineer so I’m gonna go ahead and point out bunch of things that are neither semi conductor or gaming related. \n\nNVDA has CUDA. Amazon EC servers all run on NVDA. Don’t think they coming down any sooner. \n\nGenetic Modelling / Sequencing, all the Moderna / CRSPR / biotech benefits from CUDA and NVDA. \n\nSo do engineers in general. Eg architect, building models, predictive analysis. \n\nNVDA CUDA has great integration w Tensor Flow, everyone and their mother have their rocks off for ML/AI. \n\nNVDA acquiring ARM this is huge for architecture and vertical int.", "Trust me when I say, the rest of the world and rest of the semi world is not twiddling their fingers and ignoring AI. There can even be non-semi industry competition, like when Apple cut out Intel and decided to make their own chips.\n\nThis is not to cast aspirations against NVDA, as I think he is absolutely brilliant....but is walking a tightrope. If I were to buy in the semi sector it would NVDA and Taiwan Semi (TSM). Probably TSM because of lower multiple and most are outsourcing to it.", "NVDA"], "2020-12-15": ["That’s kinda what I’ve been thinking for NVDA and possibly SQ but I feel AMD may have some room for growth", "I've been invested in SQ for years, but the current valuation worries me and I've been cutting back. I personally wouldn't buy right now and instead hold off for a better entry point.\n\nAMD and NVDA are decent I think. I prefer NVDA, but I suspect there will be more good news coming from AMD next year which could push the price higher.", "NVDA, TSM, AMD, LRCX", "QCOM TER TSM NVDA", "No because autonomous cars and related services are only launching and more will come to fruition over the next 24 months.\n\nRobo-taxis will come first, then delivery vehicles, and then personal cars. There are only handful of companies entering into this arena right now. But more will jump in as the safety concerns and technological viability concerns are addressed thru the first few companies entering into this arena. NVDA expects to generate $2 Billion in revenue by 2022 from their autonomous technology but expects that business to grow to $20 Billion by 2025 and $60 Billion by 2030.", "Hello don't see much info on AMD &amp; NVDA. I'm fairly new to stocks but I use there products daily anyways. This is info if it helps.\n\n\nAMD is becoming the computer processors that alot of PCs use. They don't have huge corporate deals that Intel has. BUT they are the processo for all new consoles for Sony and Xbox, that's a big deal. Also not to long Amazon just announced their cloud computing servers are using AMD processors. So within 2020 AMD got these big deals and competing with Intel.\n\n\nNow NVDA, basically the only GPUs on the market that everyone wants. Everyone uses them for scientific graphics, Bitcoin mining, gaming, and servers. AMD is too making GPUs but both companies are out of stock on products while they are in huge demand. Also NVDA bought ARM and apple prior to the purchase announced new computers are using ARM processors. Then NVDA bought ARM for 1.X billion. ARM makes processors but via a new tech that isn't main stream yet due to compatibility. So yaaa\n\n\nBoth companies released new product this year and made big improvements. Then somewhere in the mix they own mobile phone processors and there is a new processors that's out for the new phones.\n\n\nOn mobile at night sorry for typos and hope this helps someone. But yaa I'm like 6 months new to stocks and learning but I value these 2 companies a lot and see only growth with both of them. Oh and AMD bought ARM competitors.", "You don't see much info on AMD and NVDA? Try looking at their 5 year chart history, for starters", "Apple’s new chips are gonna be in direct competition with those from AMD &amp; NVDA. Apple’s chips, I heard, are far superior &amp; legit threat to the other 2 companies.", "SQ - stellar ecosystem between sellers and Cash App, and are now getting into banking. Look at the explosion in their Bitcoin revenues. Explains why they’ve ran up so much. Now they will benefit from the recovery as well because of small businesses getting customers back thanks to the vaccine (assuming it works).\n\nAMD - first and foremost just look at Lisa Su’s track record. Flawless execution everywhere she goes. Their chips are in Microsoft and Sony consoles as well as Amazon’s cloud servers. Xilinx acquisition brings them to the data center market which they definitely needed. And you also can’t forget that they likely have some ARM chips in development so that might be a nice surprise down the road. They need to break into the AI/ML space more and up their GPU game to really compete with NVDA. But it’s safe to say they are winning in the CPU market atm. They are also used in crypto mining.\n\nNVDA - where do I even start lol. Again, great leadership. NVDA is one of the most consistent stocks on the market. Best GPUs that are used in a multitude of areas, but where NVDA really shines is in AI and ML. They are literally the driving force behind every breakthrough in these fields. If you haven’t, watch the GTC conference and get your mind blown. And of course you have the ARM acquisition. They are the leader in data centers too. And you can’t forget about what they are doing in the autonomous driving space as well as gaming.\n\nAll 3 have more room to run if you ask me. I personally think NVDA is the top dog while SQ is a very close second (really they are interchangeable). AMD is 3rd for me but that does not mean they are far away either.", "The only reason I’m asking for future growth is because at this moment and probably for the next 3-5 years or so (barring I don’t have children) am looking for more growth. I’m young have a great job, wife’s in military so my rent, insurance etc is paid by the government, cars paid off, all that. So I am looking for a little riskier plays. Obviously if anyone had the answers we’d all be rich lol. But NVDA has always been the most interesting to me I just don’t know if I can justify the price point at this time especially because it’s been fairly stagnant lately. I know that’s probably an ignorant take on my part though. I’m still looking for an ARK like ETF that has NVDA &amp; AMD or just even NVDA", "SMH has both NVDA and AMD"], "2020-12-16": ["First, congrats on a very nice profit. \n\nSecond, I've also been questioning my NVDA holdings recently. Hell of a good company thats had a great run. However, the stock has gotten quite pricey. If this ARM acquisition doesn't go through i may sell what i have.", "I hold NVDA and have done for a little longer than OP.  I sold some earlier this year to rebalance the old portfolio because they did indeed have a hell of a run and things were looking lopsided.  But I'm still holding a number of shares because they are a great company and they are still going places. \n\nMy next adventure is NET which I think will have a similar trajectory.", "Also made $$$$ on NVDA, but now I fear they're a bit of a \"one trick pony\" being entirely dependent on GPUs.  Granted, that's one hellova stud pony, but when you have a product that dominates such a profitable market and you capture crazy high margins for years, there is every incentive for your customers to look for alternates and for competitors to invest in similar  offerings.  \n\nJensen knows he won't dominate GPUs forever as AI/ML workloads mature from high cost, high margin Proof of Concept phase to low cost &amp; lower margin mass production phase.  That's why he's spending 40 Billion on ARM in a bet to secure his future.  But I don't see China allowing Nvidia to buy ARM.", "\"Apple and Nvidia audience don't cross over.\"\n\nI'm a developer and work in TV and film post production. Our workflow is 90% dependent on Apple products.  In fact, I don't know a single developer who doesn't own a Macbook. And only one person who uses a PC to do VFX and post production. We all have been complaining about lack of Nvidia support for years. Most of us still have High Sierra machines sitting around with Nvidia eGPUs connected to them. \n\nDriving is a small part, but when Tesla takes your engineers it's a pretty big blow.\n\nAMD and AAPL are both good bets. I own them too. AMD will overtake NVDA next gen I think. NVDA is only ahead with RTX which is mostly software and not hardware based. AMD just overtook Intel in a big way and when they pair their CPU's with their GPU's they will be the unstoppable Apple alternative.", "This is true. RTX far outperforms anything on the market, but only a few games support it. But, it doesn't matter because you can't get a card to play on anyway.\n\nAI is everywhere and  IOT devices will soon *all* have neural silicone in them.\n\nAs an example where NVDA is losing ground, I use Octane which is a raytracing renderer for 3D scenes. It used to be 100% Nvidia. Like you couldn't even run it without an Nvidia card. Apple killed support for Nvidia, but 90% of 3D artist were using Apple machines. A lot of us bought PC's just to do our work. But now 3 years later Octane released a METAL version that runs on AMD. I don't have a PC or Nvidia anymore.\n\nAs a side note where Nvidia is still ahead, Octane for Nvidia CUDA has an AI denoiser that runs super fast. Octane for AMD METAL uses a CPU AI denoiser that is slower than the actual scene renderer. Though I'm sure next release they'll have a new METAL denoiser that will further render Nvidia pointless.\n\nSide side note about how small AI is. Even Photoshop now has a Neural engine.", "I'm afraid your assumption is wrong: It's not a zero sum game.\n\nThe following is purely for entertainment /polemic purposes:\n\n* 2015, Intel sells chips for $3,0 -  AMD for $1,0.\n\n* 2019, Intel sells chips for $1,5 - AMD for $1,2\n\n* 2021, Intel sells chips for $1,0; AMD for $1,1.\n\n* 2023, AMZN / BIDU / GOOG roll their own ARM chips for $0,5; but AI-and Bitcoin accelerators / ASICs might do the same work for $0,1. AMD might sell CPU's for 0,8 and Intel outright implodes.\n\nHow to profit?\n\n-Short INTC pre ER and cover 5 days later, it's going to implode no matter if AMD, NVIDIA or ARM or some dark horse (Nuvia, though I think they will fail) wins.\n\n-Buy CDNS, SNPS, ANSS: All those new chips have to be designed; no matter if those new chips are successful or not.\n\n-CPU's are usually only used &lt;10% of the time. In a sharing-economy like the cloud, only 10% of that TAM can do the same amount of calculations: TAM implosion. If this happens, or in case of serious margin compression, short _both_ AMD and INTC.\n\n-If the world moves post-CUDA (I believe it will!), either to AMD, Intels unified framework or ASICs, this is the \"once-in-a-lifetime INTC implosion event\" you should be waiting for! Short the hell out of NVDA; as for data centers NVIDIA doesn't have anything besides GPU's - and clients already want to leave the ARM-prison. NVDA is a way overvalued hype stock; it's not the question _if_ it implodes INTC-style, but when.", "I have reviewed these previously with the exception of Up Your A11y. \n\nOn Up Your A11y for \"Approach 1: Provide a clear list of errors when ’submit’ is clicked\" when I try there example with NVDA/Firefox the screen reader says \"Looks like there are some errors in your form\" but doesn't say \"Email should not be blank\". The description says that it should announce a list of errors. Do I have something set up wrong or is this the expected behavior and its just worded poorly?\n\nIn regards to the success message, it seems based on W3C's guidance that it should automatically announce that the message was sent, but it seems like a lot of sites, even those who claim to be accessible, don't do this."], "2020-12-17": ["Mark my words NVDA will be over 600 by end of Jan", "bruh you think I can afford NVDA leap(s) ???", "!remindme 2021/1/31\n\n&amp;#x200B;\n\n \"Mark my words NVDA will be over 600 by end of Jan\""], "2020-12-18": ["There is a very strong case for Amazons current valuation and it reaching $4000 in the next year or two. I don’t own any Amazon stock, but it has been on my watch list for a long time. I think it’s a stock you can’t go wrong with personally. They are continuing to grow their business and earnings.\n\nAs for it being 1/4 of your portfolio, it shouldn’t be a concern if you are confident in the business. Diversity is good, but it’s also a protection against ignorance. \n\nAlso, great stocks so far! NVDA and MSFT are two of my favorites.", "Sell a put credit spread. \n\nHere's one for $500 not $400:\nJan 29, 2021 500/495 put credit spread is 42 DTE, 30 delta. If NVDA closes above 500 on Jan 29th you keep the $159 credit, and you risk up to $500 (less credit) max loss if it closes below $495. In reality you should sell the spread when you either hit 70% profit or a couple weeks to expiry. This is a 30% max return on your risked capital.\n\nSell 1/29 500p to open, Buy 1/29 495p to open", "Thanks for the idea. juicy credit if that could actually be established, such a wide bid-ask though...  \n\n\nAlso see here is my reservation about a credit put spread in this case..... My IBKR shows NVDA has a IV percentile of 12%.. does that not bother you since option sellers should be ideally selling options when IV percentile is over 50%?    \n\n\nOr did you purely construct this idea based hypothetically on my view that there would be a bullish move to the upside?   \n\n\nNew at this, I'm just trying to juxtapose my own views on the underlying's movement (which may be incorrect) and sustaining long term statistical edge of shorting options (sell with IV%tile &gt;50). If I have the respect the statistical edge in this case, I shouldn't be putting on a put credit spread? If I do, I forego the statistical edge for my own view that the stock would go higher. Is this correct?", "You can get a Jan 530/535 Vertical Call Spread for about $2.30 - the Open Interest on this is over 7200 which makes this position easy to enter and easy to exit - NVDA will open Monday in $531 range - if it consolidates as you have surmised, you sit tight - if it breaks out to the upside, exit position, take profit, and move to the Jan 535/540 Vertical which also has a relatively high Open Interest making for easy entry/exit - the caveat to this play is NVDA tends  to be volatile - a quick glance at even a 5 day chart shows us a $524 - $538 spread - no matter, for your dollar amount, this play may work - Best of Luck -", "Agreed, but it can still increase in value even if it never hits 650 or even 600. Any decent spike up will trigger an increase in the value of the spread since NVDA has been consolidating for a bit now. You could then choose to sell the spread after that spike up or continue to hold it if you think it will further increase.", "Eh only thing you can do in that scenario is buy a deeper OTM call maybe for an EOM one and hope for a big move. NVDA options are pricey and that $400 spend would limit you to very few options haha"], "2020-12-20": ["Some of the big tech have fairly low IV right now. AAPL, AMZN, NVDA. Also, the banks might be decent play with recent news. We’ll have to see how they open on Monday though.", "Why would NVDA want GME?", "I thought the exact same thing. NVDA doesn't need a retail store let alone a physical copy reseller like GameStop. Silly dream.", "Why the fuck would NVDA want gamestop? don’t go full retard.", "New Year's Goal? That green line... $WIMI $NVDA"], "2020-12-21": ["Check out the jtg translate NVDA addon.", "NVDA 19.2 is more than a ear out of date at this point, so this was bound to happen at some point.\n\nI recommend grabbing the latest NVDA and using either JGT (which was expressly made for this purpose), instantTranslate or the NVDA Translate addon which last received changes in may of this year according to Github and may work better on the latest NVDA. THat addon claims to use Google Translate ...I have my doubts about that, but it is worth a try.", "We have not found any versions of NVDA translate that work with versions higher than 19.2.\n\nIn the case of JGT, it should only be used for Japanese. The developer said not to you use it for anything else, because he will pay extra.\n\nAs for Instant translate, I should copy every sentence in the game, put it in notepad, select it and then start translating, which is hell.", "Slow quarter. Graphics cards, Data centers, super powerful cards powering data centers, AI, Also still in talks to acquire ARM. \n\nAt least, that's what I'm thinking.  I've been sidelined on NVDA since their Sep peak."], "2020-12-23": ["Important to point out that the new generation of hardware from NVDA and AMD are huge upgrades compared to the last couple of gens. People on 5 year upgrade cycles for their PCs are frothing at the mouth for these new CPUs and GPUs.\n\nWhen people upgrade to these new platforms they'll need new compatible accessories. CRSR's ecosystem of peripherals is probably the best in the business so I can't see their next earnings being anything but spectacular."], "2020-12-26": ["Been trading Iron condors on NVDA for a while now... do we expect there will be a jump? Cus i dont want to get burned.", "NVDA and Amazon both have been flagging for a while. If we get a Santa rally next week we may end up going 🚀🚀🚀", "I agree on NVDA.... The NVDA pennant, with declining volume, is beautiful and clear.  Depending how you draw your pennant boundaries, it could see a breakout with any catalyst as early as early January,  or up to late February.   Both of those are before ER so maybe the catalyst will wait for ER?  If that's the case then calls should be no earlier than April or June to safely catch the breakout without a theta problem.", "They are going to blow out earnings. When your wife’s boyfriend “crushes the pussy” that implies  calls on his 🍆. You’re iron condor is going to be fucked to the upside. “NVDA price too low imo”"], "2020-12-27": ["I think there’s relatively low IV on NVDA at close, might place some calls at open 👀", "AMZN and NVDA have room to grow. I wouldnt hold on to FB for very long, seems like popular opinion is turning on them.", "NVDA is up over 100% this year and you guys still pushing for more ?! 🤣🤣", "NVDA a better buy than AMD?"], "2020-12-28": ["That’s not what I’m asking: I’m saying what data supports NVDA being in correction over the next year. Im not asking you to predict the future, I’m asking you to tell me a strong argument for why it would.", "I have a relatively large portion of my portfolio in NVDA and plan to hold. Good company still doing good things. Other industries aren't going to rely *less* on machine learning, etc going forward.", "I’m not asking you for future data either: I’m asking you what can we see right now that would give evidence for underperformance for NVDA. Where are they struggling? Where are the weak points for the company? Competition? Economics? That’s what I’m asking.", "My understanding is that NVDA has a big lead in powering cloud data centers, which obviously will just continue to expand for the foreseeable future. \n\nI originally bought this months ago and it peaked as high as $580. Its significantly down now and I am disappointed I didn't sell it then. Hindsight, etc. But yes, I am also going to hold on to it as a long play or wait for a significant gain and then sell."], "2020-12-29": ["Happy to say i owned TSLA, ETSY, and NVDA during this years run", "I’m still bullish on NVDA for autonomous driving and AI. It definitely is worth holding long enough for long term capital gains if you bought earlier this year.", "I have NVDA too. A hold for me and believe in its LT value.", "NVDA is a major player in AI. Just hold onto it.", "NVDA is a good long term play but it’s already shot up 100% this year so I think it’s just price correcting. It’s an interesting AI play but I think at its current price it’s due for a correction or a year of flat numbers.", "I don’t own NVDA anymore, rode it early from like $60. Just in case you’re not aware, it’s highly unlikely AMD will have a similar rise as NVDA. Gaming aside, they can be considered fundamentally different insofar as NVDA is (or was) a bet on deep learning - CUDA, the software layer that allows deep learning to utilize NVIDIA GPUs, doesn’t have a serious competitor. OpenCL (which Radeon’s experimental software solution is build on) is still very nascent and is years away from being adopted industrywide or anything close, let alone smaller-scale isolated research (there are signs in fact that it’s less and less likely to materialize as maybe some people wanting to be less locked into Nvidia’s ecosystem had hoped). NVDA didn’t moon because of bitcoin and PC gaming. I don’t follow AMD and they seem like they have a lot more going for them lately, so it’s probably not a bad stock to hang onto, but moreso a competitor of NVDA’s in PC gaming market share, less so in the stock market.", "So bullish on NVDA?", "$SHOP and $NVDA are keeps imo.", "My hesitation is that NVDA and ADBE dont really have much competition with my other holdings, so they may be better fits as missing pieces, as opposed to PYPL and SHOP.", "Would you mind sharing your rationale? Youve definitely been helpful.\n\nIm pretty much leaning towards NVDA and ADBE to be honest, since this will round out my “more defensive” long term growth portfolio, as opposed to my speculative one.", "Sorry, I meant that I am getting the sense that NVDA is overvalued.\n\nEditing now!", "With virtual reality and augmented reality growing faster than anyone could've imagined, there's a lot more potential for NVIDIA. These technological developments are going push towards a major increase in the demand for the company's products. Subsequently, its performance in the stock market is going to reflect that too. Track its performance here: [https://zyne.com/stock/NVDA](https://zyne.com/stock/NVDA).", "I'd get out of SHOP and NVDA. Not sure what your cost basis is with both, but I think both are extremely overvalued right now. I recently was in a similar situation (considering PYPL, ADBE, or SHOP) and decided on PYPL and ADBE. Both are great long term holds, have amazing products, they have had great runs, but aren't overvalued in my opinion. \n\nI'm expecting a pullback with SHOP in 2021 and will invest with them afterwards. It's had an amazing run in 2020 but it's growth is similar to TSLA at this point and fundamentally, it doesn't make sense right now. Someone on this thread suggested BABA; I recently sold my position in BABA due to all the drama with the Chinese government. Although buying the dip with them is interesting, the Chinese government is too much of a red flag for me right now.", "NVDA", "ADBE and NVDA are the only 2 where the valuation today could make sense in the next 3 years if you're evaluating the companies based on what a reasonable valuation in software and hardware would be- usually around a 20-30 multiple for hardware and slightly higher for software.   \n\n[https://www.macrotrends.net/stocks/charts/NVDA/nvidia/pe-ratio](https://www.macrotrends.net/stocks/charts/NVDA/nvidia/pe-ratio)\n\nI think 2021 will easily be Nvidia's best year.  I'm currently trying to buy one of the 30 series GPUs for a new PC and they're pretty much impossible to get at retail- the demand for both Nvidia GPU and AMD CPU is rabid at the moment.  The nvidia 30 and AMD 5000 series are commanding a 50% premium on secondary markets.  It's clear that both companies could raise prices and nobody would bat an eye- the product they make is the highest quality in the personal computing space.  I am long NVDA and AMD.  Both companies have great intellectual property and are set to outperform competition for the next few years given intel's production missteps.\n\nADBE is a best in class company and an all star from a financial perspective. They make a ton of money and have a very predictable business model.  \n\n[https://www.macrotrends.net/stocks/charts/ADBE/adobe/revenue](https://www.macrotrends.net/stocks/charts/ADBE/adobe/revenue)\n\n[https://www.macrotrends.net/stocks/charts/ADBE/adobe/pe-ratio](https://www.macrotrends.net/stocks/charts/ADBE/adobe/pe-ratio)\n\nJust look at that earnings per share and revenue growth- that is really beautiful stuff.  Also- you can see adobe is trading at around its historical p/e ratio at the moment- which leads me to believe it's a fair price right now.\n\nNo matter how you look at Shopify the current price makes no sense given the valuation.  Awesome company and product- I know a few small businesses that use their services and it's helped them do very well during the pandemic, but it's just way too expensive at the moment. \n\nPYPL is also too expensive given their earnings trajectory for my taste.  Additionally, the payments processing space is getting more and more crowded.  There is virtually no intellectual property preventing one company from squeezing another when it comes to a \"race to the bottom\" on fees.  Stripe's eventual IPO will pump the brakes on the rest of the fintech space as well- and I think we will likely see that event in the next year or two.", "NVDA supplies the self-driving car compute for every major player except Tesla.  That might be something like $3500 in hardware for every vehicle manufactured once autonomous vehicles become mainstream."], "2020-12-30": ["Yeah, but here's the current strat I'm using to reclaim it back, at this rate, expect by March to be close to green again.\n\n1. Dump at least like 40k into NVDA put credit spreads that  expire every 2 weeks. Decently OTM to get as close to the 10k credit  goal. Can be like even 8k the first few times. Each spread should give  like $100 credit at least\n2. Let these puppies expire worthless (or exit when close to being worthless).\n3. Repeat the above with your new increased capital after. Aim for  the same credit goal, but now that you have more capital, so you can  make your spreads slightly further OTM.\n\nEvery single time, you'll have more capital and can move further OTM.  Sure at some point there wont be enough volume but then you just do  spreads in multiple of the tickers at once.  YOLO'ing into spreads each  time.\n\nYeah you can get that one inevitable crash that can wipe you out, but  if it's not the first 4-5 times, you can sell for a loss  and still be  like net positive  (depends on your initial capital  of course).  \n\n\n  \nThe current position in the screenshot should net me 15k by end of next week if NVDA stays above 510", "I need to show you something. PM me your discord.\n\nI also sell put credit spreads, but on amazon, TQQQ, and a few others.\n\nLets chat. \n\n- and the reason is I've been thinking about getting into NVDA to now sell puts on.. so..", "always watch TQQQ for bigger drops, SPXL if it drops big too..\n\nWatch Tesla on any drops as you know premium is good there, watch amazon as you already do..\n\n\nWatch Vix to buy puts or sell calls when it spikes up..\n\nWatch SPX for reasons it is European options and can't even be assigned early!\n\nalso PYPL sometimes has ok premium if you sell at times of high volatility.. \n\nI'm currently selling puts on PLTR because even if it drops I know its just sniping/fake out/scares to get kids to lose money gambling on it .. etc..\n\n\nin the future i'm looking at:\n\nNVDA\n\nWMT \n\nFB\n\nDIS", "So I am still trying to get the hang of theta strategy but I have been having a hard time understanding the put-credit spread and it's benefits. But NVDA seems like it would have been the perfect candidate the past month or so. Barely fucking moved...\n\nSo with the put-credit spread you are limiting the capital required and limiting potential downside if the stock does drop in price, and thus able to open more put credit spreads?\n\nSo if NVDA is at $530 when you open the spread and $530 when the spread expires (just for example), and you buy the 500p 1/15 and sell the 510p, you will collect \\~$250 per spread. If it goes down, but stays above $510 you will collect more because the short leg (500p) may be able to be closed in profit, and hold the $510p towards expiry or to where theta has eaten away at the value of the put and you have reduced the loss from writing the 510p. Is that correct or am I just extremely retarded?\n\nWould higher risk/reward be just selling cash secured puts without spreading?\n\nHow many of these are you opening at a time?\n\nI have about 250K of capital (up from about 120K in April when I started trading again) and it's invested in stupid shit right now that is at ATH and feels maxed out. TSLA, NVDA, FB, ADBE, Currently holding 40x NVDA which is not making me any money.\n\nI have been theta-ganging TSLA by selling naked puts when it goes down (I have cash to cover), and writing covered calls when it goes up or during consolidation and it has been fairly profitable. I usually only do one or the other, and only 1x call so I am fairly well covered but luckily it has not  gone tit's up on me yet. But that doesn't really seem like the right way to do things unless you do want to hold shares of the company longer term....", "so with my current spread (510/505 puts expiring next week), my max loss would be:\n\n130 contracts x 500 (width of the strikes) = $65,000 if NVDA tanks to below 505 on expiration date since if someone has a 505 put and NVDA dropped to like 495 on expiration, it makes sense to exercise those puts. \n\nIf it lands in between, that's when I start to lose money, but my loss is capped at that 65k which only happens if it ends up below 505.", "Yup, all in on every spread till I make up all my losses. \nI do have some cash sitting on the side, but most of my buying power ($17k in the screenshot) is from credit received from the spread I entered. \n\nI can just double down and keep putting the earned credit into more spreads at the same strike, but I think the smart thing to do is wait for a drop to enter even lower OTM spreads.\n\nActually I had a 515/510p spread expiring this week that was ITM during the week and teetering close to that strike most of this week, but I knew it'd recover so I held. Bricks were shat a few, but I'm glad I held. I closed out that spread with like 90% profit today when NVDA kept on running upwards. If I held till tomorrow, I could've gotten an extra $2k more or so, but I'd rather enter a spread the following week at that point to avoid pin risk.", "With put credit spreads, I am defining my max loss and capping my max profit at the same time.   \n\n\nUsing your example:  \n510/500p 1/15 spread nets $250 (510p is $988, 500p is 738 for example, so 988-738=250 credit)  As soon as I enter this spread, $250 credit is added to my buying power, which I can use to buy stonk, deposit for lunch or just let it sit in the acct and do nothing.    \n\n\nIf NVDA drops from 530 to 520 early on after entering the position, the value of the spread goes up, say, to $400. We were credited $250, but if we wanted to exit this spread now, we'd be doing so at a loss of $150 per spread.  Since there is time for it to stay above 510,  we can hold on and hope theta decays at the price of the spread and hope that NVDA either moons or stays flat.  \n\n\nIf NVDA on expiration ends up below 500, the puts we sold will most likely be exercised, so max loss would be (510-500)\\*100\\*&lt;number of spreads&gt; which in our case is 1000.  Usual rule of thumb is to close spreads before expiration to avoid assignment after hours.   \n\n\nSummarizing very briefly here, but there are several scenarios to look out for with spreads, just outlined a few, but I honestly looked at youtube vids and browsed some threads on it on /r/thetagang, /r/options, and even older posts on /r/wsb from way back when it wasn't a cesspool of degeneracy.   \n\n\nI yolo my entire acct into it. So if I have $40k, and I'm doing a 510/500p 1/15 spread as my play, I'll do 40000/\\[(510-500)\\*100\\] = 40 spreads.", "No margin, its all my cash.\n\nIt was 40k last month but now that I'm up to 60k doing this strat, I'm all in on that 60k on spreads on NVDA (510/505p next week expiring).", "So this works well because NVDA is flat?"], "2021-01-01": ["NVDA is also over $500 a share and options costing $1,000-5,000+ for one contract. Foh, most of us work Wendy’s sir", "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**NVDA**|**$520**|**BUY CALL**|**2021-01-22**|**$18.85**|**$522.2**|**2411**|**169**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckjeoypbpgrkw0703sj1ijgly) | [Track Record](https://www.pickmojo.com/user/TheMouse1000C/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "*two days, not to days. \n\nIf you're not going to leave any interesting DD at least spell your shit right. \n\nShort NVDA", "Speaking of NVIDIA, have they fired their lunatic director of machine learning research after her Twitter shit hit the fan or that bitch is still working for the company. Because if it's the latter, I have a great feeling we'll see something like that happen in the future (or her shit venting would backhit them in some other way) and the market would sell instantly. Oh wait, she did delete her pathetic Twitter account but what's once been posted online stays out there forever (thank lord for that).\n\nEither way, $NVDA has a time bomb on their hands and I'm not touching their stuff until they come clean. Too much of a risk.\n\n[https://archive.fo/QT3X7](https://archive.fo/QT3X7)", "Probably, cuz I just sold the rest of my NVDA to load up more PLTR", "NVDA and AMD are extremely over stretched. \nIntc will be the real winner and comeback story of 2021. Screen shot this bitch.", "I understand. I think NVDA is great. But if you're going to post, back it up with research and data. No one will (or should) just trust your random opinion. And without useful information, it just comes across as a lame pump attempt.", "NVDA is also going to be partnering with multiple car companies including Mercedes to program AI into the cars for self driving and stuff. This could start as soon as 2022. Easily a 1000+ company", "IDK man, NVDA is milking the monopoly on GPGPU where they have massive margins.\n\nAMD is coming strong and Xilinx has given them more tec on die connectivity that is key for large scale stuff.\n\nNVDA is going to have competition in the datacenter, and Mamma Su has been sharpening the axe.\n\nGL", "Just about enough time before shareholders have had enough of having 0 gains so they all start selling off\n\nNVDA 400P 1/15", "Im praying to tendie god for NVDA to reach 530 next week or i’ll be eating out of trash cans", "Hey, hate to break it to you buddy, but NVDA more than doubled in 2020.", "Replace NVDA with KLA-Tencor / ASML / Applied Materials - these companies will exist and grow their market for decades to come. They have a huge moat around their semiconductor process technology.\n\n&amp;#x200B;\n\nNvidia could \"fall\" just like Intel did almost overnight - I'm sure Intel will be back in a few years though. TSMC could too, AMD has been there 3 or 4 times already and back.\n\n&amp;#x200B;\n\nBut honestly, like the other guys said. Get VTI and maybe SMH or SOXX. I'm of the mindset that if civilization itself keeps expanding, so will semiconductors. Nothing grounded in future tech involves a decoupling from semiconductors. VTI would give you exposure to the broad market and SOXX or SMH would give you a magnification of tech."], "2021-01-02": ["SQ, but I didn't have a lot of it. Next up would be NVDA", "Biggest winners: TSLA (720%), NVDA (117%), LMND (92%)\n\nBiggest loser: T (-10%)\n\nOverall portfolio return: 89%", "I owned Hansen Beverage before it became Monster. That company has been around since the 30s. I bought Hansen because I watched Red Bull go from cute girls driving around and giving it away to bars to being on a shelf in every convenience store and Hansen was public and doing the same thing. What you will miss in your analysis is ... the 100+ that failed. There were literally 100s of energy drink companies that popped up. The delist rates are ridiculous. There are literally 1000s of companies that have ceased to exist since I traded Hansen. What you are doing is going to be invalid because of survivorship bias. Garbage In/Garbage Out. Every company has positive analyst reports.\n\nI also owned ATVI, TTWO and NVDA in 2010. I know these markets very well. Pick something you know very well and then learn accounting and market segment analysit."], "2021-01-03": ["What's the point of this?\n\nI mean seriously, you have NET and OKTA and CRWD. That's three cybersecurity stocks which are in competition, two of them are in pretty direct competition. What is your plan here?\n\nGILD and RGEN? AMD and NVDA? \n\nIt seems like you're just trying to grab whole sectors, you don't really have any convictions about any of these companies, in which case, just buy an index fund or etf.", "Yea this is part of the motivation behind this post. Reason I didn't buy an ETF is I think the individual stocks will outperform the rest of the sector (growth of sector leaders &gt; growth of sector) plus no expense fees. Let me know if you think otherwise though I could be wrong.\n\nThat being said I'll probably get rid of GILD and RGEN don't know enough about biotech. AMD and NVDA I think can co-exist and grow. Same with NET and CRWD.", "I was looking at NVDA’s chart to day and would love to buy leaps but the stock ain’t cheap so the calls ain’t cheap either.  Maybe I’ll sell some puts instead.  IDK, I’ll figure something out"], "2021-04-22": ["Tipranks Earnings SmartScore has NVDA at a 10/10.  So that's nothing to sneeze at.  \n\nI can personally attest that it's basically impossible to pick up one of their cards... they sell as soon as they hit the market, and have been for months.  \n\nI can't imagine how they won't kill on their earnings call with good expectations on the next quarter as they attempt to meet demand.", "NVDA will probably grow and grow for the next 100 years so don’t be in too big of a hurry to buy. Also, there are many many great companies to buy. Don’t get too hung up on just one. I have about 175 companies on my watchlist right now that I believe are fundamentally strong and have a bright future. I just buy them when they get absurdly low. I freaking love NVDA but if I never own them for the rest of my life it’s not a big deal.", "Very true. Could NVDA be the next Tesla with x1000 P/E ratio? No one can say for sure. But in this market it’s ridiculous how the stock prices are moving.", "Currently I just hold 5 NVDA , I want to bring that number up to 20 by yoy. It’s going to be my forever stock along with AMD.", "I am more bullish on AMD than Nvidia. Their pe is lower. I haven't heard of government opposition to their xilinx aquisition. Their server products are good and could take market share from Intel\nBoth AMD and NVDA have the same supply shortage and that might be a big factor. Will get to know more next week after their earnings.\nIt hasn't gone up since it came down from 100. It seems to have support around 78/79\nUnless earnings disappoint, I would expect it to generally go higher.", "I feel like NVDA will go as far as Tesla goes. They’re kind of a hand in hand stock. When one is up the other is up, when one is down the other is down.", "Selling SQ and NVDA to buy COIN.\n\nI got out today of all ARK exposure and am repositioning.", "Peter Lynch's \"rule of thumb\" for high PEs is that if you expect the company to grow earnings at a greater percentage than the PE in the next 3-5 years, it might be a good idea.\n\nFor me the question is then, do we as investors think that NVDA's earnings will double in 3 years? if so, it is a FAIR price for the current valuation. If that growth is expected to continue, then yes, the price of the stock is worth it.\n\nNVDA has a lot of demand for their products, which is great. However, I think that with a resurgent AMD I dont think NVDA can double its earnings in 3 years, depite the hype and despite noting for sure that yes, NVDA is a great company making a great product.", "I can’t figure out how much their 97% market share in deep learning will translate to revenue. Does anyone have any idea?\n\nTheir chips are pretty much critical for all deep learning, and other up-and-coming tech such as AR/VR, gaming, etc. Not to forget their data centers, development of DPUs, and potential ARM deal. NVDA could be the ultimate pick&amp;shovel play of the next decade.\n\nIf the ARM deal goes through, I think NVDA is a $1T company easily. But for now I’m just on the sidelines because I can’t figure out an evaluation.", "Same , I hold all 3 , same amounts of NVDA and AMD. Admittedly, my AAPL holdings are significantly lesser.", "Silly question - P/E is around 75.  How do you \"quantify\" that to a percentage to then compare earnings growth to?  Aka, how did you know that NVDA earnings will have to double from the ratio 75", "NVDA has been one of my favorite stocks. I've always liked this stock. I'm convinced that they're able  to stay a few steps ahead of the competition, which has greatly increased. I haven't paid much attention to it's valuation, which eventually might cause me to lose money. I still like the stock, and don't expect to change my perception of Nvidia (at least not in the near future).", "Under.\n\nThey own AI/ML have a cash cow in crypto, and are about to barrel through server CPUs.\n\nIf ARM doesn't become a unit, NVDA has all that cash to develop INTC and AMD into the ground.\n\nIf ARM does join, its profits and growth accrue.", "AMD is out of ideas and doesn't have the talent to innovate out of it. Keller moved on years ago. They're buying freaking Xilinx, as if that will do them any good.\n\nNVDA owns AI/ML, and soon will be taking server customers away from AMD and Intel."]}