{"2021-01-01": ["Happy 2021 y’all! I’m looking to start a stock portfolio of 10 stocks for my two kids (10 and 7). I’m thinking VTI, ARKG, MCD, DIS, AAPL, MSFT, TGT, RBLX (when it is listed), V, and possibly NVDA. They will have input in this account so I’m picking stocks they would enjoy. What would be your list of 10?", "NVDA is also over $500 a share and options costing $1,000-5,000+ for one contract. Foh, most of us work Wendy’s sir", "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**NVDA**|**$520**|**BUY CALL**|**2021-01-22**|**$18.85**|**$522.2**|**2411**|**169**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckjeoypbpgrkw0703sj1ijgly) | [Track Record](https://www.pickmojo.com/user/TheMouse1000C/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "*two days, not to days. \n\nIf you're not going to leave any interesting DD at least spell your shit right. \n\nShort NVDA", "Speaking of NVIDIA, have they fired their lunatic director of machine learning research after her Twitter shit hit the fan or that bitch is still working for the company. Because if it's the latter, I have a great feeling we'll see something like that happen in the future (or her shit venting would backhit them in some other way) and the market would sell instantly. Oh wait, she did delete her pathetic Twitter account but what's once been posted online stays out there forever (thank lord for that).\n\nEither way, $NVDA has a time bomb on their hands and I'm not touching their stuff until they come clean. Too much of a risk.\n\n[https://archive.fo/QT3X7](https://archive.fo/QT3X7)", "Probably, cuz I just sold the rest of my NVDA to load up more PLTR", "NVDA and AMD are extremely over stretched. \nIntc will be the real winner and comeback story of 2021. Screen shot this bitch.", "I understand. I think NVDA is great. But if you're going to post, back it up with research and data. No one will (or should) just trust your random opinion. And without useful information, it just comes across as a lame pump attempt.", "NVDA is also going to be partnering with multiple car companies including Mercedes to program AI into the cars for self driving and stuff. This could start as soon as 2022. Easily a 1000+ company", "IDK man, NVDA is milking the monopoly on GPGPU where they have massive margins.\n\nAMD is coming strong and Xilinx has given them more tec on die connectivity that is key for large scale stuff.\n\nNVDA is going to have competition in the datacenter, and Mamma Su has been sharpening the axe.\n\nGL", "Just about enough time before shareholders have had enough of having 0 gains so they all start selling off\n\nNVDA 400P 1/15", "Im praying to tendie god for NVDA to reach 530 next week or i’ll be eating out of trash cans", "Hey, hate to break it to you buddy, but NVDA more than doubled in 2020.", "Replace NVDA with KLA-Tencor / ASML / Applied Materials - these companies will exist and grow their market for decades to come. They have a huge moat around their semiconductor process technology.\n\n&amp;#x200B;\n\nNvidia could \"fall\" just like Intel did almost overnight - I'm sure Intel will be back in a few years though. TSMC could too, AMD has been there 3 or 4 times already and back.\n\n&amp;#x200B;\n\nBut honestly, like the other guys said. Get VTI and maybe SMH or SOXX. I'm of the mindset that if civilization itself keeps expanding, so will semiconductors. Nothing grounded in future tech involves a decoupling from semiconductors. VTI would give you exposure to the broad market and SOXX or SMH would give you a magnification of tech."], "2021-01-02": ["I'll start. My biggest winners were AMZN +61% ,  TTWO +57% , AMD +56% , TSM +51% , and NVDA +43%.\n\nBiggest lovers were RKT -22% and BABA -13%. BABA hurt the worst. I had very high hopes for that stock. I played a few meme stocks towards the end of the year. Had mixed results. Otherwise all bluechips and etfs.\n\nOverall portfolios up 30% so I had a great year. My goal is to maintain a modest 12% growth next year. Anyone want to share their winners and lovers feel free", "SQ, but I didn't have a lot of it. Next up would be NVDA", "Biggest winners: TSLA (720%), NVDA (117%), LMND (92%)\n\nBiggest loser: T (-10%)\n\nOverall portfolio return: 89%", "I owned Hansen Beverage before it became Monster. That company has been around since the 30s. I bought Hansen because I watched Red Bull go from cute girls driving around and giving it away to bars to being on a shelf in every convenience store and Hansen was public and doing the same thing. What you will miss in your analysis is ... the 100+ that failed. There were literally 100s of energy drink companies that popped up. The delist rates are ridiculous. There are literally 1000s of companies that have ceased to exist since I traded Hansen. What you are doing is going to be invalid because of survivorship bias. Garbage In/Garbage Out. Every company has positive analyst reports.\n\nI also owned ATVI, TTWO and NVDA in 2010. I know these markets very well. Pick something you know very well and then learn accounting and market segment analysit."], "2021-01-03": ["Started investing recently and believe I may be over diversified. Bullish on these tickers but given the number of positions in the portfolio I only have a cursory understanding of those businesses so I'm trying to trim the number of stocks I own - going for quality over quantity. This portfolio beats the SP when I backtested my purchases using SP instead of these tickers but maybe I can do better if I get rid of the gain diluting stocks? Looking for suggestions on what should go and feel free to suggest other positions not on this list that may be better than some of the positions I already have for long term growth. Looking for more genomics exposure as well (maybe ARGK but not a fan of higher expense ratios). Thanks!\n\nPositions:\n\nFB\n\nAMZN\n\nSQ\n\nSE\n\nFVRR\n\nTSLA\n\nSBE\n\nAAPL\n\nSEDG\n\nNET\n\nCRWD\n\nZM\n\nNVDA\n\nU\n\nADSK\t\n\nLMND\n\nCRSP\n\nPINS\n\nNIO\n\nPLTR\n\nSHOP\t\n\nDOCU\t\n\nMSFT\t\n\nDIS\n\nLUV\n\nAMD\n\nBE\n\nCOUP\n\nBA\n\nNEE\n\nFUBO\n\nFSLY\n\nOKTA\n\nPLUG\n\nDDOG\n\nABNB\n\nCRNC\n\nOSS\n\nZBRA\n\nCHGG\n\nAAL\n\nRGEN\n\nGILD", "What's the point of this?\n\nI mean seriously, you have NET and OKTA and CRWD. That's three cybersecurity stocks which are in competition, two of them are in pretty direct competition. What is your plan here?\n\nGILD and RGEN? AMD and NVDA? \n\nIt seems like you're just trying to grab whole sectors, you don't really have any convictions about any of these companies, in which case, just buy an index fund or etf.", "Yea this is part of the motivation behind this post. Reason I didn't buy an ETF is I think the individual stocks will outperform the rest of the sector (growth of sector leaders &gt; growth of sector) plus no expense fees. Let me know if you think otherwise though I could be wrong.\n\nThat being said I'll probably get rid of GILD and RGEN don't know enough about biotech. AMD and NVDA I think can co-exist and grow. Same with NET and CRWD.", "I was looking at NVDA’s chart to day and would love to buy leaps but the stock ain’t cheap so the calls ain’t cheap either.  Maybe I’ll sell some puts instead.  IDK, I’ll figure something out"], "2021-01-04": ["Hallo,\n\nwegwerfaccount wegen Privatsphäre.\n\nIch bin mitte 20, wohne in Luxemburg, habe also den Vorteil zum steuerfreien Kapitalgewinn wenn ich länger als 6 Monate halte.\n\nIch habe durch Krypto an einen hohen Gewinn erzielt und möchte ein sicheres Standbein haben (also sicherer als Crypto) . Derzeit habe ich 80k in VWRL / IWDA, 20k in Aktien. (TSLA, AMD, NVDA, AMZN) und 50k Cash. \n\nAn Immobilien habe ich keine Interesse, da sehe ich zu viel Aufwand drin. Eventuell später mal eine Eigentumswohnung zum selbst bewohnen, derzeit miete ich. In Luxemburg sind die Immobilienpreise sowieso absurd. \n\n1) Sollte ich gleich 3 Mio auf einmal in ETFs stecken oder macht es mehr Sinn zu stückeln (zB 250k/Monat)? Dann würde allerdings ein großteil Cash einige Monate nur rumliegen. Ich habe das Gefühl dass wir gerade auf nem Peak sind nach der Corona Zeit als alles runter ging.\n\n2) Mein Vertrauen in Banken ist prinzipiell sehr klein. Was würde eigentlich mit meinen ganzen Investitionen und Aktien passieren sollte die Bank bzw Broker bankrott gehen/nicht mehr existieren? \n\nZiel ist es erstmal 3 Mio anzulegen und 200k Cash zu haben für ein schönes Auto, Reisen, usw. Das wird auch für 2-3 Jahre reichen ohne die ETFs anzufassen. Macht das Sinn?", "Besides AMZN and NVDA it looks like a lot of speculation plays. Most have already ran up a lot in 2020 and chances of that same performance happening this year is slim. If this is the entirety of your portfolio I'd recommend dedicating a decent portion of your portfolio to a broad index ETF. *If* a correction happens any time soon there's a good chance you'll be hit hard as speculative/growth stocks get hit harder than value. It all depends on your risk tolerance and stomach for volatility.", "NVDA"], "2021-01-05": ["\nRanked by portfolio composition:\n\n\nStocks:\n\n1. NIO - 11.06%\n\n2. ENPH - 9.48%\n\n3. PST H - 8.63%\n\n4. SQ - 7.98%\n\n5. NET - 7.74%\n\n6. NVDA - 6.64%\n\n7. AMZN - 6.52%\n\n8. GRWG - 6.32%\n\n9. TDOC - 5.02%\n\n10. CRSR - 5.01%\n\n11. SPCE - 4.42%\n\nThe last 14% of my portfolio cannot be discussed based on r/stockmarket rules otherwise my post will be removed.\n\n\nI have a capital of about 16000 right now and I am planning to add/dca in the future. I am rather young so I can tolerate risk and have plenty of time to hold.\n\n\nEdit: included average cost of equities", "Neither is NVDA"], "2021-01-06": ["", "How much Apple really use NVDA before though - don't rely more on AMD for their graphics cards?", "Yea I know but it’s a NVDA shit can jump 5% in one day", "NVDA made a fortune off of providing chips to companies that now manufacture their own. Why outsource when you’ve got the money to create in-house?", "Sorry but you don't seem to know what you're talking about. \n\nAMD and NVDA have been competitors for years. And [Nvidia is the one leading the charge in terms of Ray Tracing](https://www.tomshardware.com/features/amd-vs-nvidia-gpus) - which most will agree is the future. \n\nAlso, [for the past 15 years Apple has exclusively used Intel CPUs in their notebooks and desktops](https://www.cnbc.com/2020/11/10/why-apple-is-breaking-a-15-year-partnership-with-intel-on-its-macs-.html). Which is a relatively small blow to Intel's overall sales, but it impacts AMD even less. Now if Apple were to start making CPUs for retail consumers as a standalone product, then AMD might be in some trouble. But that seems extremely unlikely as one of the main reasons Apple wants to make their own SoCs is so that they can move away from x86 to ARM architecture. \n\nNvidia has said they plan to purchase Arm from Softbank for $40 billion. The beauty of this acquisition for Nvidia is that Arm licenses out their CPU architecture to companies like Apple, Qualcomm, and Samsung.\n\nTL DR; Nvidia will be here for a while.", "Sounds like someone's just mad they can't get their hands on a RTX 3070. \n\nAlso, AMD has had the exact same supply problems as Nvidia. Not sure why you'd be bullish on them, but not on NVDA.", "Yeah but that shouldn't impact Nvidia's graphics card sales - which makes up [the majority of their revenue](https://www.investopedia.com/how-nvidia-makes-money-4799532).\n\nI have heard read that Amazon is working on a processor for cloud computing or some AI shit - which could be a competitor to NVDA. Frankly I'm less familiar with that aspect of Nvidia's business.", "Sorry guys, NVDA has been trading side ways ever since I bought shares", "NVDA is at nice discount right now too", "There's more than enough demand in the future for many gpu manufacturers...  Nvidia still leads the AI ecosystem for developers with mature software and driver lines; AMD close behind.   My rough estimate is that Intel and Amazon and everyone else new will likely feed mostly their own demands,  which yeah aren't small...  But NVDA and AMD will still be selling out of their product nevertheless.", "I bought both my calls when NVDA was trading around 505. So if it opens at 515 or above I'll probably sell at least one of them. Mine have deltas of 0.45 meaning a 10 point rise in the stock will net me a $450 profit which is a good size chunk of money to me."], "2021-01-07": ["", "Last price target in NVDA reached", "Can't mention NVDA without AMD, it doesn't fulfil all the criteria but has 2,3,4 in spades which is kinda all that matters. Just do a google search of \"Su Bae\". \n\nDisclaimer I hold both.", "Ah! Thanks for this. Thought about AMD for a different bet. Going long on AMD now. \n\nMy view was AMD &gt; NVDA in terms of potential upside in 2021. Thoughts?", "Not looked too much into AMD and XLNX but some generic questions/sanity check/back of envelope calculations as food for thought:\n\n**Bottom-up:**\n\n1. What if the synergy of 300M does not realise? How does that impact the enterprise value?\n2. Are you using a discount rate for June 2023 valuation? i.e. Is this PV or FV?\n\n**Top-down:**\n\n1. Annualised growth of 23.96%. How does that compare to TAM? Looking at comps; are Intel/NVDA/etc projected to gain/lose this amount as well?\n\nYou're looking at a CAGR of 20%. Taking CAPM; beta at 2.28 (have not calculated, just took Yahoo Finance) and a risk-free at 1% (approx. 10-year) you should be looking at a market rate of return of approximately 8-9%.  \n\nDoes this make sense?\n\nLast century or so equity is 10% so makes sense but looking at a 2-3 year timeline there's an element of volatility (especially when u look at trailing 12-month returns and bull cycles) where if going for further analysis; can maybe look at a theoretical single stock portfolio and calculate Sharpe Ratio. \n\nE&amp;OE", " No problem, I wish there were more posts about valuation.\n\nBased on your numbers it does seem that even if the market is pricing in future growth rates, at current calculation/valuation it’s still relatively “cheap”... now the Devil’s advocate question is gonna be is a PE of 129 really considered “cheap”? If AMD is gonna be the golden goose, then is Intel the ugly duckling and currently at a depressed price?\n\nIf one trusts their valuation then this has a safety margin of 20%. Not bad. Maybe sell some puts in the 80’s range and see if the merger really pans out (thereby removing some risk) and then flip to long hold when there’s uptrend/mooning?\n\nOr be a degen and YOLO the AMD/NVDA spread 😂", "A follow-up to your Microsoft/Sony thought would be are manufacturers/assemblers going to move to an ARM architecture? If so and if the ARM acquisition goes through, then is the winner going to be NVDA?\n\nPersonal feeling is AMD/INTC are moving to a Big/Little core architecture to minimise the x86/ARM efficiency differential as shown by Apple's M1 to buy themselves some more time in RnD for an M1 equivalent (which in itself will be driven by MSFT's efforts in optimising Windows on ARM)."], "2021-01-08": [" **E-commerce**\n\n* [Amazon](https://www.cnbc.com/quotes/?symbol=AMZN)\n* [Shopify](https://www.cnbc.com/quotes/?symbol=SHOP-CA)\n* [Walmart](https://www.cnbc.com/quotes/?symbol=WMT)\n* [Costco](https://www.cnbc.com/quotes/?symbol=COST)\n* Freight-forwarding stocks\n\n**Travel and leisure**\n\n* [Boeing](https://www.cnbc.com/quotes/?symbol=BA)\n* [Uber](https://www.cnbc.com/quotes/?symbol=UBER)\n* [Airbnb](https://www.cnbc.com/quotes/?symbol=ABNB)\n\n**Digitization**\n\n* [Advanced Micro Devices](https://www.cnbc.com/quotes/?symbol=AMD)\n* [Nvidia](https://www.cnbc.com/quotes/?symbol=NVDA)\n\n**Cybersecurity**\n\n* [CrowdStrike](https://www.cnbc.com/quotes/?symbol=CRWD)\n* [Okta](https://www.cnbc.com/quotes/?symbol=OKTA)\n* [Zscaler](https://www.cnbc.com/quotes/?symbol=ZS)\n* [Palo Alto Networks](https://www.cnbc.com/quotes/?symbol=PANW)\n* [NortonLifeLock](https://www.cnbc.com/quotes/?symbol=NLOK)\n\n**5G**\n\n* [Marvell Technology](https://www.cnbc.com/quotes/?symbol=MRVL)\n* [Qualcomm](https://www.cnbc.com/quotes/?symbol=QCOM)\n* [Skyworks Solutions](https://www.cnbc.com/quotes/?symbol=SWKS)\n* [Texas Instruments](https://www.cnbc.com/quotes/?symbol=TXN)\n* [NXP Semiconductors](https://www.cnbc.com/quotes/?symbol=NXPI)\n\n**Stimulus**\n\n* [Walmart](https://www.cnbc.com/quotes/?symbol=WMT)\n* [Target](https://www.cnbc.com/quotes/?symbol=TGT)\n* [Home Depot](https://www.cnbc.com/quotes/?symbol=HD)\n* [Lowe’s](https://www.cnbc.com/quotes/?symbol=LOW)\n* [Dollar Tree](https://www.cnbc.com/quotes/?symbol=DLTR)\n* [Dollar General](https://www.cnbc.com/quotes/?symbol=DG)\n\n**China**\n\n* [Boeing](https://www.cnbc.com/quotes/?symbol=BA)\n* [Caterpillar](https://www.cnbc.com/quotes/?symbol=CAT)\n* [3M](https://www.cnbc.com/quotes/?symbol=MMM)\n* [Mastercard](https://www.cnbc.com/quotes/?symbol=MA)\n* [Visa](https://www.cnbc.com/quotes/?symbol=V)\n* [American Express](https://www.cnbc.com/quotes/?symbol=AXP)\n\n**Wealth management**\n\n* [Goldman Sachs](https://www.cnbc.com/quotes/?symbol=GS)\n* [Morgan Stanley](https://www.cnbc.com/quotes/?symbol=MS)\n* Robinhood\n\n**Remote work**\n\n* [Zoom](https://www.cnbc.com/quotes/?symbol=ZM)\n* [Salesforce.com](https://www.cnbc.com/quotes/?symbol=CRM) (acquiring [Slack](https://www.cnbc.com/quotes/?symbol=WORK))\n* [Microsoft](https://www.cnbc.com/quotes/?symbol=MSFT)\n* [Dell](https://www.cnbc.com/quotes/?symbol=DELL)\n* [HP](https://www.cnbc.com/quotes/?symbol=HPQ)\n* [Apple](https://www.cnbc.com/quotes/?symbol=AAPL)\n\n**Health care**\n\n* [CVS](https://www.cnbc.com/quotes/?symbol=CVS)\n* [Humana](https://www.cnbc.com/quotes/?symbol=HUM)\n* [UnitedHealth Group](https://www.cnbc.com/quotes/?symbol=UNH)\n* [Johnson &amp; Johnson](https://www.cnbc.com/quotes/?symbol=JNJ)", "AMD is the way. NVDA isn't even in the new consoles.", "Never said anything about it dropping. I think the only thing that's certain is that this product will be unobtainable for months after launch for most people. \n\nI guess we can look forward to more lectures from NVDA about supply chain management and how it's not their fault that their products have been unavailable for months lol", "Yep that’s the idea with splitting it up between a few securities. Maybe $20k and I’d be able to throw NVDA in there. But yes I agree with you diversification is good for selling premium. Was just wondering about what else I could mix in there.", "P/S multiples are roughly a function of growth and margins. Management has said that they expect to ship 1000s of chips at roughly $10k+ each in 2021 alone and that they will be significantly higher margin than their high performance memory business. \n\nWhat would you pay for the first mover and potential at scale leader in a large addressable and growing market that has a credible path to grow at high double digit / low triple digit CAGR for the next few years? (vs. NVDA which analysts forecast to grow at 20% yoy)\n\nSimply being able to deliver the chips to marquee large cap tech customers would yield a fundamental re rating of the company to reflect the market potential and de-risked ability to execute", "\\#NVDA IS IN PLAY\n\n&amp;#x200B;\n\nMultiplier (X) to 1.298322. from 1.291674.\n\n&amp;#x200B;\n\nBuy Stop Limit (BSL) to 531.68. from 538.30.\n\n&amp;#x200B;\n\nSell Stop Limit (SSL) to XIIMM. from XIIMM.\n\n&amp;#x200B;\n\nConverted Cash Reserve (CR) to Trade (T) at approximately 538.30. (Share: 1) bringing the Average Price Paid (APP) to about 538.30.\n\n&amp;#x200B;\n\nJust to reiterate, I placed the following order(s):\n\n\\+ Buy 1. Shares @ Limit Price: 531.68.\n\n&amp;#x200B;\n\nData:\n\n[http://xiimm.net/collective/2021/01/08/nvidia-usd-nvda-usd/](http://xiimm.net/collective/2021/01/08/nvidia-usd-nvda-usd/)\n\n&amp;#x200B;\n\nGraphics:\n\n[http://xiimm.net/collective/nvda/](http://xiimm.net/collective/nvda/)"], "2021-01-09": [""], "2021-01-10": ["#Trending Tickers\n\nTicker|Mentions|Bulls|Neutral|Bears|Price|Change|P/E\n:--|:--|:--|:--|:--|:--|:--|:--\nNIO|924|28.16%|65.45%|6.39%|$58.92|8.55%|-\nTSLA|894|29.65%|53.94%|16.40%|$880.02|7.84%|-\nICLN|143|36.03%|58.82%|5.15%|$33.16|-0.75%|-\nSPY|143|17.61%|70.42%|11.97%|$381.26|0.57%|-\nPLTR|125|30.89%|60.98%|8.13%|$25.20|0.8%|-\nGME|119|32.80%|55.20%|12.00%|$17.69|-2.16%|-\nNVDA|106|34.38%|63.54%|2.08%|$531.07|-0.5%|117.41\nPLUG|97|36.59%|57.32%|6.10%|$53.77|13.71%|-\nGOLD|97|22.22%|72.22%|5.56%|$23.97|-3.23%|-\nGM|85|4.69%|91.08%|4.23%|$43.06|-0.6%|9.23\nBA|83|0.70%|98.99%|0.31%|$209.90|-1.32%|-\nNET|73|4.78%|93.38%|1.84%|$79.15|0.16%|-\nARKG|72|35.82%|55.22%|8.96%|$105.86|2.4%|-\nPSTH|72|33.82%|60.29%|5.88%|$29.32|7.24%|-\nMAX|67|14.77%|78.41%|6.82%|$39.78|-1.49%|-\n\n\n#Trending Contracts\n\nTicker|Strike|Type|Date|Mentions\n:--|:--|:--|:--|:--\nTSLA|$850|PUT|3/19|3\nNIO|$65|CALL|1/15|2\nNIO|$80|CALL|1/29|2\nQQQJ|$35|CALL|2/19|2\nPSTH|$30|CALL|1/15|2\nX|$96|CALL|1/15|2\nX|$100|CALL|3/15|2\nMTLS|$55|CALL|5/21|1\nBB|$10|CALL|6/18|1\nSPY|$475|CALL|12/31/2021|1\nMARA|$40|CALL|2/19|1\nVALE|$21|CALL|2/19|1\nICLN|$35|CALL|2/19|1\nTSLA|$178|PUT|1/21/22|1\nNIO|$80|CALL|1/16/2022|1\nCRM|$230|CALL|6/19|1\nCRM|$300|CALL|1/21/2022|1\nNIO|$70|CALL|20/08|1\nNIO|$80|CALL|1/15|1\nAMZN|$4000|CALL|3/19|1\n\n\n#Other Information\n\nSubreddits Searched: wallstreetbets, investing, stocks, stockmarket, options, robinhood\n\nComments Searched: 20942\n\nUnique Tickers: 248\n\nTotal Tickers: 6530\n\nUnique Contracts: 67\n\nTotal Contracts: 75\n\nTime Period: 20h\n\nFinancial data provided by [Vhinny](https://www.vhinny.com/?utm_source=reddit&amp;utm_medium=referral&amp;utm_campaign=RedditTickers).\n\nView daily trending tickers on r/RedditTickers.", "NOPE. NVDA CALLS", "Im not, just giving my take on NIO day and think there is upside in NVDA (and maybe downside in QS)", "I be been a NVDA bagholder for a while now. Lots of people too scared to invest because the ARM deal is being looked at by regulators. Typical big tech BS. It's well past due for a takeoff.", "&gt;Everyone knows that NVDA and NIO are partnering to develop EVs, but I haven't seen near the hype about NVDA that I have with NIO. \n\nWhat?\n\nThey're gonna provide a few chips for some EV OS systems.\n\nProbably close to cost to get in the game.\n\nSimilar to AMD and the new consoles.", "A few thousand cars a year is not going to bump NVDA's revenue much. That's probably why.\n\nMay be good PR though, plus ARK had been buying NVDA lately", "The way the market's pricing in EVs, combined with NVDA's consolidation, the fundamentals of the whole thing don't matter imo", "I endorse the NVDA trade.This is investment advice.", "Hoping to salvage something out of my 1/15 600c and 100c for NVDA and AMD. Should have exited on Tuesday but well.", "I'm theta gangbanging NVDA right now and this is the confirmation bias I need 🫂", "I love me some NVDA (in my Roth and my fuck off account) but there's nothing about them smashing earnings that makes me think the stock will actually respond positively in the short term.", "NVDA is also the biggest beneficiary of the run in “internet gold” because all the miners use NVDA.\n\nAnd technical analysis wise it’s been consolidating for so long it’s either getting ready to pop or plummet, I’m predicting a pop so I have way too many LEAPS but I’m ready", "Lost a good amount of money on ITM calls over 1.5m period. Fuck NVDA, but I’m ready to get hurt again", "Ive been looking at NVDA since september and it has been consolidating while making higher lows consistently and it  finally seems to be gaining momentum ; it might test the previous high within this month", "I'm interested in NVDA at open and hoping its still under 550.  It's been consolidating so long... this could get it to break out finally", "I have NVDA shares", "Bought NVDA for 170, pulled out last week. It's not gonna go up. I know what you're thinking, and it makes sense, but the current tariffs are going to choke the heck out of it, aside from already scalping and production issues. Ada also isn't coming out till 2022. I'd say, give it time to deflate. Tech is already at a downturn as investors are going into cyclicals. While I won't try to predict when it'll turn around, if I had to guess, it'd be late spring/early summer when rumors of new tech start to buzz louder.", "You should have been a NVDA holder prior to seeing a hyped article... fool", "PajeetScammer seems to think I'm not a retard. I am.\n\nHorizontal spread is same strike, different expirations. In my case, 2/12 and 2/19 540C.\n\nA vertical spread is same expiration, different strike (i.e TSLA 2/5 800C/850C). \n\nMotivations are all the same, get lambo rich. If you think TSLA is going 800+ but not 850+ you can sell an 850C to lower your cost basis (I.E it's $5 for the 800C,$4 for the 850C, net result being you pay $5 for the call, sell the other for $4, pay $1 net.).\n\nAnything beyond \"Calls are up Puts are down\" is above the average user's pay grade, but there's lots of value in using complex options strategies.\n\nGoogle \"Bull Put Spreads\", you can sell weeklies on AMD/NVDA for 40% return. Won't get you to the moon in 1 go but it'd get you there eventually.", "I believe the concern is that NVDA is more likely to absorb it, move it or close up shop than SoftBank who is not a semiconductor company, they just wanted to flip it. At the moment UK is trying to kiss up to incoming US administration. It would take a scenario where they would be so extremely isolated (like Scotland and a re-unified Ireland leave and join EU or something...and US support is non-existent either by choice or massively pre-occupied with domestic issues).", "Yeah, ~$2.00 cost basis.\n\nAssuming the 2/12 expires worthless and 2/19 is just OTM, should net a decent return.\n\nRisks are if it shoots above $580 or below $500. Someone might exercise the short call if it’s deep ITM. If it’s below $500 both expire worthless. \n\nPeople are saying the stock is overdue for a move, today was good evidence to support that, but I don’t know if it’ll move much. MS, AMZN both were well due, and they both beat earnings, and they both tanked last earnings after staying level for months.\n\nI’d be curious to see what happens after AMD earnings. The stocks track each other near perfectly some days. I’d wager part of this current run is due to the fact AMD jumped (along with factors that caused both to jump). NVDA might dip after AMD has a blowout.", "I dont like to play earnings honestly, it's a crap shoot. I have noticed NVDA is almost a tech sector rotation. Some days when nasdaq is down 1%, nvda is up 4%. When nasdaq up, nvda down. I do think a put spread around 480 is a pretty safe play. Wish I would have wrote that last week when it was near 500.  I would expect it to dip again before earnings. \n\nAmd is setup for for a new ATH", "hopefully tomorrow starts the rally into earnings. idk like to exit my calls before earnings $NIO $WIMI $NVDA"], "2021-01-11": ["\n\nI wasn’t sure which flair to use. \n\nAs the title says I have a trading bot which I spent a long while developing. \n\nThere are two batches of codes which I run alongside each other. \n\nBatch 1 and Batch 2. \n\nBatch 1 uses some of the judgement of myself and calculations to gather stock. \n\nBatch 2 is just purely calculations which release values which say if it’s worth doing a call, or not worth doing a call. \n\nPast few days the top picks with NVDA, and a small cap  I can post this daily if you guys are interested. \n\nThis the data which I have acquired on Sunday (NY) 10th of January 2020. \n\nHere’s an update to my trading bot. QS looks tempting but I think I can hold off until a better company comes on sight. \n\n\n**Code Batch 1:**\n\n* Quantumscape Corp (QS) - Hype stock, Solid State Battery - High Risk\n\n* AYI Acuity Brands, Inc.\n\n* ADS Alliance Data Systems Corporation\n\n**Code Batch 2:**\n\nCall:\n\n* FedEx Corporation (FDX) - Has been dropping for a while.\n\n* Lockheed Martin Corporation LMT\n\n* FedEx Corporation FDX\n\n* Kimberly Clark Corp KMB\n\n* Campbell Soup Company CPB\n\n* Conagra Brands Inc CAG\n\n* General Mills, Inc. GIS\n\n* Braemar Shipping Services plc BMS\n\n* Beyond Meat Inc BYND\n\nPotentially a call:\n\n* United Parcel Service, Inc. UPS\n\n* Air Transport Services Group Inc. ATSG\n\n* Atlas Air Worldwide Holdings, Inc. AAWW\n\n* Facebook, Inc. Common Stock FB\n\n* Inovio Pharmaceuticals Inc INO\n\n* L3Harris Technologies Inc LHX\n\n* Northrop Grumman Corporation NOC\n\n* United Parcel Service, Inc. UPS\n\n* Alliant Energy Corporation LNT\n\n* American Electric Power Company Inc AEP\n\n* Consolidated Edison, Inc. ED\n\n* Dominion Energy Inc D\n\n* Entergy Corporation ETR\n\n* WEC Energy Group Inc WEC\n\n* Atmos Energy Corporation ATO\n\n* NVR, Inc. NVR\n\n* Church &amp;amp; Dwight Co., Inc. CHD\n\n* Ball Corporation BLL\n\n* CenterPoint Energy Inc CNP\n\n* CMS Energy Corporation CMS\n\n* DTE Energy Co DTE\n\n* NiSource Inc. NI\n\n* Sempra Energy SRE\n\n* Boston Properties, Inc. BXP\n\n* Hormel Foods Corp HRL\n\n* Kellogg Company K\n\n* Atmos Energy Corporation ATO\n\n* Church &amp;amp; Dwight Co., Inc. CHD\n\n* Hormel Foods Corp HRL", "It’s still in the process to bring tested. I’ll be happy with it after 400 successful trades. \n\nI’m not sure what you mean by “hold out set”. \n\nPreviously there was NVDA, and a WSB ticket which got ban by WSB both on very decent returns. You can check out my post history but FDX is still going downhill.", "NVDA finally went up? I can finally sell my single share at 14$ profit"], "2021-01-12": ["", "NVDA TO DA MOON!!!!", "NVDA 1/21/22 600c", "I think the partnership with NIO was a deal to ease China's mind about approval of the ARM acquisition. China has previously said they don't like how much power it would give NVDA and hinted they might vote against it.\n\nThe deal needs US, UK, and China approval. They have already pledged to build the world's biggest supercomputer in the UK... which would be job creation to ease the UKs minds.\n\nThe only question is timeframe. September announcement. Maybe March-early summer?", "CRSR is a better play than NVDA now", "I know that made the same assurances that softbank made when they first acquired ARM in terms of data security that helped with UK approval. \n\nI dont know the most about the regulatory approval since it involves 3 countries but i know NVDA plans to use an arm chip in its new Data Processing Unit (DPU) which is mainly intended for servers. \n\nHopefully the specific aim of the acquisition helps it hold ground.", "They make their own DRAM.. They do not compete with NVDA in the GPU space.", "When a ticker like $NVDA is considered “bubbleless” \n\nThese are wild times frens.", "Of course IV is low for these boomer companies (exceptions: ARKW, NVDA)", "I like NVDA, but did you just say a company that has risen 120% over the past year isn't overvalued?", "NVDA also has a deal with Li Auto. I'm in.\n\n[https://blogs.nvidia.com/blog/2020/09/22/li-auto-chinese-ev-nvidia-drive/](https://blogs.nvidia.com/blog/2020/09/22/li-auto-chinese-ev-nvidia-drive/)\n\nSame logic goes for INTC with Mobileye. They have a solid SD presence already and are coming up with new L4+ technology. \n\n[https://venturebeat.com/2021/01/11/mobileye-announces-autonomous-vehicle-pilot-programs-in-tokyo-shanghai-and-paris/](https://venturebeat.com/2021/01/11/mobileye-announces-autonomous-vehicle-pilot-programs-in-tokyo-shanghai-and-paris/)", "If you have a rhyme and reason behind each one, it’s not the worst thing in the world. But if they all can basically be put in a known ETF then may as well just buy the ETF\n\nI have about 20 diff stocks but they are very sector and high growth play specific. \n\nMJ - GTBIF, TCNNF, CRLBF, CURLF, PLNHF, CGC, ACRHF, APHA\n\nEV - TSLA, NIO\n\nSemiCo - AMD, NVDA \n\nRenewable energy - PBW\n\nGrowth - DIS \n\nShroomstocks - 3 of them\n\nAirline - DAL\n\n3 SPAC plays -  BFT, NPA, GHIV\n\nWith that said, 75% of my investments are in 5 tickers and 96% are in 11. After I’ve made profit I don’t like to sell all my investment. Usually leave $200-500 of shares to let it ride\n\nMy next add will probably be ROKU and FUBK @2% of my portfolio and will be selling off my spac plays to do so", "futures ripping, especially nasdaq futures. Looks like we’re gonna continue with this momentum upward.$GOOG $WIMI $NVDA"], "2021-01-13": ["[removed]", "I assume $537.9 is what you meant. I grabbed my truck keys to load up on NVDA at $437", "There isn't a requirement that screen readers announce content on mouse hover. I would ask for the rationale...usually this will be something in one of the [Understanding](https://www.w3.org/WAI/WCAG21/Understanding/) documents for a WCAG Success Criteria. If they reply with one, feel free to message me and I can review the claim for you.\n\nNot all screen readers have the same functionality, and generally you don't want to cater to functionality only used by one unless you have a very good reason to do so.\n\nI don't recall if that setting in NVDA is set by default; if it is then I turned it off because all of my mouse options are currently unchecked."], "2021-01-14": ["Over the last year and a half, I have acquired a *lot* of shares. So many that I generally forget what 70% of them are, why I bought them and my price target for them.\n\nI looked through them, did some research on each and have sold the ones that seem to have little potential. I am, however, still pretty new to investing and am still left with about 30.\n\nI was looking for advice on the best ones to sell of those ones remaining (see portfolio below)\n\n  \n\nSymbol / Shares / Value\n\nABBV 0.31 $34.92 \n\nATVI 0.23 $20.21 \n\nGOOGL 0.03 $57.22 \n\nPLAN 1.3 $92.82 \n\nMT 2.07 $49.96 \n\nTEAM 0.09 $20.39 \n\nEWA 4.8 $117.62 \n\nAX 1.43 $58.91 \n\nBEPC 0.74 $43.95 \n\nBEP 1.61 $76.19 \n\nCTRE 0.53 $12.15 \n\nCCIV 3.14 $52.55 \n\nCRWD 0.57 $130.19 \n\nCMI 0.18 $42.23 \n\nDOCU 0.34 $88.14 \n\nDKNG 1.33 $72.80 \n\nICLN 4.28 $139.40 \n\nIIPR 0.13 $25.07 \n\nQQQ 0.48 $152.19 \n\nNIO 2.26 $140.39 \n\nNVDA 0.06 $32.48 \n\nPYPL 0.09 $22.47 \n\nROKU 0.27 $109.38 \n\nWORK 0.4 $16.92 \n\nSFIX 1.21 $80.65 \n\nTSLA 0.25 $211.46 \n\nTTD 0.06 $49.05 \n\nTWLO 0.19 $70.99 \n\nMTN 0.25 $72.47 \n\nVTRS 0.05 $0.83 \n\nSPCE 2.82 $77.76 \n\nW 0.1 $30.91", "Hm, NVDA Option chain shows up fine for me (I don't own any NVDA shares). But I have the same problem with APDN: the option chain doesn't show up (I do own APDN shares). Can anyone confirm whether APDN option chain shows anything for them?", "Also why I'm waiting for a good buying opportunity with NVDA.", "I had 3,000 shares I bought at $6 and sold at $11 back in like 2016 and remember arguing with people on whether NVDA was over valued at $90", "I was holding NVDA from 2017 onwards. The sell off in late 2018 and early 2019 was extremely painful and mentally scaring/conditioning when it comes to my investing philosophy. Watching your shares tank 40% in value is an experience I honestly hope every investor goes through once and only one time. After you go through it you stop caring so much about the intraday swings. This new cohort of investors who have made their money in 2020 need to experience a bear market to teach them some lessons on investing.", "Bought 1500 shares of AMD at 8.50, 50 shares of NVDA at 50.00.. That investment paid for my first home and my wedding.", "I’ve bought roughly 25 individual stocks in the past 11 years. I’ve only sold a piece of two of those purchases and it was when both of them got so ridiculous in high returns that it was dumb not to. And one of them was to buy a car lol. Most of these stocks have been really positive, but one has completely ranked and it was one I found here on Reddit. \nInvest with money you can afford to lose and set it and forget like my good friend at Ronco. You’ll be fine (one of those buy and sells was NVDA...which I bought in 2009 and sold half the earnings in either 2017 or 2018. There was plenty of ups and downs in those years)", "Yeah I feel ya. I’ll hold this to expiry cause I made so much off GME I can afford a loser lol. But seriously AMD competes in both the processor and GPU markets, unlike their competitors NVDA and INTC. There’s just so much potential for the company IMO."], "2021-01-15": ["&amp;#x200B;\n\nAMBA - Ambarella\n\nBeen going balls deep studying this bad boy. They got their fame from making Gopro chips. Now they have Computer Vision Artificial Intelligence. It’s a program built-in to hardware that ANY camera manufacturer can use in their cameras to add intelligent vision and identification to their cameras.\n\nBuncha videos of their shit. See it progress from 2013…\n\n[https://www.ambarella.com/applications/automotive/](https://www.ambarella.com/applications/automotive/)\n\nThey make the hardware, (chips), that manufacturers put in their cameras to auto detect things. Cars, people, traffic signals, etc.\n\nThey just released a 5nm ARM chip that processes 8k.\n\n[https://3vpstm1hc6e52739x31131p2-wpengine.netdna-ssl.com/wp-content/uploads/Ambarella\\_CV5\\_Product\\_Brief\\_11JAN2021.pdf](https://3vpstm1hc6e52739x31131p2-wpengine.netdna-ssl.com/wp-content/uploads/Ambarella_CV5_Product_Brief_11JAN2021.pdf)\n\nWho cares, no one uses 8k. Well… 8k is (4) 4k video streams simultaneously. This means the cameras on a car, front, back, left, right, can all be processed at the same time, on one chip WITH AMBA’s CV flow AI technology.\n\nThey also can be used in security and industrial platforms for tracking and recognizing people and manufacturing processes. Every traffic camera, body camera, home security camera, will have a chip similar to AMBA’s.\n\nAmazon selected them along with NVDA to provide chips for 360\\* cameras.\n\nThe share price is $108. It was $94 couple weeks ago. Market cap is still around $4billion, and they are winning contracts for AMZN, with NVDA.\n\nAuto drive cars will have to use redundant safety platforms such as LIDAR, Computer vision cameras, radio imaging, infrared, etc.\n\nI used finviz for percentages and ycharts for shares outstanding cause it was higher.\n\nTotal Shares Outstanding - 35,170.000\n\nInstitutional Owned -  -27,045,730\n\nInsider Owned - -1,652,990\n\nShort Float -  -2,437,281\n\nEquals - 4,033,999 shares left on open market for us to rape\n\n$436 million buys up total open shares. ORRR you pull a Softbank and buy the fuck outta some March and May 160calls so long dong hard the market maker has to buy up those 4.033million shares. Hardly any options activity to hold price down. Fuckin’ real tired of being poor. Gopro hype took this to $130/share. This tech is bout to explode and this bitch gonna run to $240.\n\n[pimpin'](https://preview.redd.it/i8qvfkwkpfb61.png?width=1386&amp;format=png&amp;auto=webp&amp;s=7c379163c8fefa4e6e53fba9b2d4d34761b04271)\n\nI’m high as balls smokin’ Blue Skunk and Champagne kush… my math is questionable.", "Holding the following:\nAMD since $10 \nNVDA since $20\nTSLA since $283 (pre-split)\n\nDon't sell any until my retirement."], "2021-01-16": ["\\#Intro\n\nSo by now everyone and their dog has noticed that upgrading their hardware was pretty much impossible in the last quarter.\n\nWe saw news of supply issues with the new consoles.\n\nwe saw issues with the supply of Nvidias new GPU series.\n\nAnd now we also see that all car manufacturers are lowering their production guidance due to chip shortages.\n\nwhat is causing these issues u ask?\n\n\\##ABF substrate shortage.\n\n\"ABF, otherwise known as “Ajinomoto Build-up Film” is a resin substrate that acts as an insulator in all modern ICs.\"\n\n\"The AFB substrate consists of multiple layers of microcircuits, known as a “build-up substrate” which allows the formation of these miniature components as its surface is receptive to laser processing and direct copper plating. Most modern chipmakers use ABF to design the smaller components of their CPUs and GPUs.\"\n\n\" \\*\\*According to sources close to ABF, the supply of ABF substrates is expected to become one of the major factors behind CPU and GPU shortages in 2021\\*\\*. NVIDIA is expected to be one of the main companies affected by this issue. The RTX 30 series GPUs which are the latest gaming products from the Santa-Clara based chipmaker are already suffering from severe stock shortages due to limited 8nm yields, ABF substrate supply as well as a deficit of GDDR6X memory.\n\nHowever, \\*\\*NVIDIA isn’t the only company that relies on ABF substrate to manufacture its processors. Intel, AMD, and other Arm-based chipmakers also use it in their own microprocessors\\*\\*, and as supply dwindles, all these companies will have to contend for what limited shipments remain.\n\nWhoever pays the most will get access to the highest capacity of the substrate in 2021. \\*\\*The supply is expected to remain poor for almost the entire year as demand is constantly increasing but capacity remains largely the same\\*\\*.  \\[Link\\]([https://www.hardwaretimes.com/abf-substrate-shortages-may-limit-nvidia-rtx-30-series-supply-in-2021/#:\\~:text=According%20to%20sources%20close%20to,and%20GPU%20shortages%20in%202021.&amp;text=The%20supply%20is%20expected%20to,capacity%20remains%20largely%20the%20same](https://www.hardwaretimes.com/abf-substrate-shortages-may-limit-nvidia-rtx-30-series-supply-in-2021/#:~:text=According%20to%20sources%20close%20to,and%20GPU%20shortages%20in%202021.&amp;text=The%20supply%20is%20expected%20to,capacity%20remains%20largely%20the%20same))\n\nother links to similar sources \\[1\\]([https://web.archive.org/web/20201214111348/https://www.digitimes.com/news/a20201214PD202.html](https://web.archive.org/web/20201214111348/https://www.digitimes.com/news/a20201214PD202.html/)) \\[2\\]([https://industryeurope.com/sectors/transportation/semiconductor-shortage-causes-major-automakers-to-cut-production](https://industryeurope.com/sectors/transportation/semiconductor-shortage-causes-major-automakers-to-cut-production/)) \\[3\\]([https://www.digitimes.com/news/a20201228PD202.html](https://www.digitimes.com/news/a20201228PD202.html))\n\nI highlighted what i thought were the most important parts, sources cite that \\*\\*ABF production will only increase 10% in 2020 while demand grows much faster\\*\\*, this can only lead to worsening chip shortages in the near future.\n\n\\##What is the play?\n\n im not entirely sure who will be the true winners of this supply chain issue. Obviously the producers of ABF stand to win massively, and sellers of hardware like consoles/cars/everything else with semis, stand to lose.\n\nABF producers that are publicly traded, Unimicron, Nan Ya plastics,  Kinsus Interconnect Technology Corp. i have not looked into their revenue to check market share etc.\n\nim not yet sure how chippers like AMD and NVDA themselves will fare during this issue.\n\ni may be looking to short some car manufacturers, have yet to determine which\n\nTLDR: semiconductor production has hit a roof for now.", "Yeah definitely. Just don't know how to trade this other than shorting NVDA which seems scary 😬", "Companies that need lots of chips to sell their product, so for example maybe car makers, could lose some revenue of this. Maybe AMD and NVDA aswell but i wouldnt short those two. \n\nNot yet really sure how to take advantage of this yet. I think a part of our consumerism is based on the availability of chips so it could hurt that"], "2021-01-17": ["Starting with the ones that are well on their way there and I personally think will definitely make it:\n\n- FB\n- TSLA\n- TSM\n- V\n- DIS\n \nHonorable mentions: NFLX, MA\n\nThe following are a bit more speculative, but I think at least some of them can make it too:\n\n- NVDA \n- SHOP\n- CRM\n- SQ / PYPL\n- SE\n\nHonorable mentions: AMD, ABNB\n\nWhat are your thoughts?", "The list has mostly blue chip tech stocks, and medium to high growth stocks? Yes, some are more risky than others but that's also what investing is about. People said the same thing about NVDA at $100 and AMD at $5 that they were \"over-priced\" back then. Look at them now."], "2021-01-18": ["Alright so a few weeks ago I ran into an issue where my cpu usage was at max while streaming (causing my stream to look horrible). I usually stream smite and I have all my settings maxed out. Had it like this for a year without any issues. Now I have my settings down on medium and it runs smoothish. If I try to stream other games with more intense graphics, even with settings way down, the stream lags hard. My cpu is an i7-900 something. I know it shouldn't have a problem, and it didn't for over a year. Anyone have any clue how to fix this? \n\nThings I've tried:\n1. Update drivers\n2. Scan for viruses\n3. Change from software to nvda\n4. couple other setting changes\n5. Cpu temp is cool as a cucumber\n6. Cry\n7. Unplug it, blow in it, plug it back in"], "2021-01-19": ["Every thrilling tale has it -- a battle between good and evil. Here, there is no difference. Chip giants AMD ($AMD) and Intel ($INTC) have been such a thrilling tale, seemingly, since time began. In my first ever reddit post, I will share my chart analysis of AMD along with some background.\n\nAMD was one of the first stocks I ever purchased back when the share price was less than the trading commission I had to pay each way. A little later I build a gaming PC with the first generation Intel i7, but two AMD GPUs in CrossFire! Fast forward a bit and I still have that PC, but have an AMD Ryzen CPU and Nvidia GPU. Anyway, AMD is somewhat sentimental, I'm anecdotally familiar with the consumer product market, and has been a decent performer in the stock market.\n\nWith the start of earnings season ($INTC this week, $AMD next week along with other semiconductor companies, then $NVDA on 2/11) I thought I would take a look at the AMD chart and see what's up...\n\n[https://www.tradingview.com/x/L6IdchIk/](https://www.tradingview.com/x/L6IdchIk/)\n\nIt turns out that the chart doesn't give me a clear indication of what's happening. However, if a trend can be identified, there's a pretty clear oversold to overbought play that has worked this past few months. On recollection, AMD oscillated pretty regularly this way during the summer of 2020. Although, I can't remember the time period. Here I am using 1 hour.\n\nSo, what is going on with the dark side? New leadership caused a price jump for $INTC on Jan 13. The company had been in a uptrend prior to the news\n\n[https://www.tradingview.com/x/q85ZfgEE/](https://www.tradingview.com/x/q85ZfgEE/)\n\nBoth charts leave us in limbo for an immediate play. We are left to ponder some questions and prepare strategy for the next trend to form. The answers can be factors for or against a play on one of these companies.\n\n* What is the chip industry doing as a whole? Are they more or less together in trend?\n* Is enough money moving to the dark side ($INTC) to beat down AMD?\n* How much price action is rooted in news and hype versus fundamentals? How do other traders view this and drive price?\n* What action will come of catalysts?\n\nSources:\n\n* An aging memory of trades and research past\n* [https://newsroom.intel.com/news-releases/intel-appoints-tech-industry-leader-pat-gelsinger-as-new-ceo/#gs.r276jw](https://newsroom.intel.com/news-releases/intel-appoints-tech-industry-leader-pat-gelsinger-as-new-ceo/#gs.r276jw)\n* [https://finviz.com/screener.ashx?v=111&amp;f=earningsdate\\_thismonth,ind\\_semiconductors,sec\\_technology](https://finviz.com/screener.ashx?v=111&amp;f=earningsdate_thismonth,ind_semiconductors,sec_technology)"], "2021-01-20": ["Everyone knows post China hustle, Shitron has made notoriously bad calls on stocks like NVDA, SHOP, NIO, etc... And now GME.\n\nShitron's character must be called into question, and california courts fined him over $4.5 million for hiding assets.\n\nSource: http://www.courts.ca.gov/opinions/nonpub/B248856.PDF\n\nThere are countless posts proving Shitron makes erroneous calls on Twitter, but now we also have insight into the moral character of this man, per US courts.\n\nGME 🚀🚀🚀"], "2021-01-21": ["I believe we might have a sleeper here in NVIDIA. The stock has moved sideways for a while since the ARM acquisition is on standby pending antitrust reviews in several countries and the outlook is rather negative on the subject because of complications with ARM China. \n\nThis vaguely reminds me of Tesla initially being denied inclusion in the S&amp;P 500, the stock went flat and down for a few months and the market was \"surprised\" when S&amp;P eventually included them, which they could do at any time. \n\nAlso I think they are poised to capture a good chunk of self driving with a system similar to Tesla based on vision (no lidar) and machine learning, which doesn't seem priced in.\n\nSo yeah, this is just a hunch, not serious DD obviously but do you think NVDA is due for a good pop once the ARM buyout closes?", "The trading range has been frustrating after having such a strong performance most of the year. I'm more concerned with what might happen if/when the ARM transaction doesn't happen. Personally I think NVDA will do better with a final decision on ARM either way.", "With or without the ARM deal, I'm extremely bullish on NVDA either way. But I think the ARM deal is far from a done deal.", "I think NVDA would be trading higher right now had the ARM acquisition never been a thing. Market doesnt like uncertainty.", "My view is this was a dumb acquisition. Sorry for the ramblings below - it's still early and I need more coffee:\n\nI like both ARM and NVDA but the two of them being in one company hampers ARM's core strength: They're a design house, not an SOC vendor. There are a lot of ARM vendors out there precisely because of that - they don't have to approach ARM as a potential competitor that they need to do business with. They know their business interests are aligned.\n\nNVDA buying ARM changes this dynamic. Sure, the regulators will ask NVDA to put all kinds of firewalls around ARM not to affect other ARM vendors. But even that won't be enough IMO.\n\nMeanwhile, if NVDA wants to utilize ARM's personnel to design their own SOCs (say, like Apple), well, that works well if you're not planning to sell your chips (say, like Apple!) A marketable core needs to have the tradeoffs you need when you sell to multiple customers. So I don't see why NVDA would need direct access to ARM to design and sell a custom SOC or anything like that. Doesn't make much sense to me.\n\nMergers usually fail to realize the rosy projections. Especially in this industry...", "I think the UK will allow it if NVDA keeps the jobs or brings some more over.  The UK is posturing for a better deal.", "Man you really know how to get me fired up lol.  I will keep my reply brief. \n\n INTC pretty much ran the \"computing\"  show until the smartphone came out which they missed out on.  I was an INTC advocate for many years and the PC I built that I'm  using to type this msg is running an Intel processor. As an IT guy for the last 20yrs I have watched AMD be suppressed while INTC got to sit at the big boys table.\n\n I was able to visit NVDA and AMD out in Cali in the early 2000's and received a tour of their facilities  - I was young and investing/trading was the farthest thing from my mind. Looking back now (and the stock prices from then) I woulda, coulda, shoulda... anyway\n\nThis article hits the nail on the head - Intel has seen its day and is in survival mode.  They are the Ford and GM to Tesla - trying to play catchup. Just as they (Intel) took over Sun Micro business there is another company waiting to take them over -( just my opinion). \n\nIMHO (a bit off topic)  is these analysts that rate companies like INTC as a \"buy\" are the equivalent of fluffers - hell I could be an analyst and rate companies as a buy or sell - they are pretty much like your local weatherman.  I used to really take these analysts opinions seriously before investing in a company but as of late I dont even look at what the analysts are saying about a company because I'm doing my own \"homework\" \n\nTLDR - Puts on INTC - Calls on AMD, NVDA, TSMC"], "2021-01-22": ["**BTFD Ratings**\n\nWhat is the BTFD ratings? I took the most overbought and oversold ratings for my \"popular\" ticker list. This uses Swaggy's own rating to determine how oversold or overbought a particular ticker is trading at on this day. It uses standard deviations so the most important thing to know is that any value below or above -68 or +68, respectively, would be classified as an out-of-the-ordinary move for that stock. The closer the number is to -100/+100 the more out of the ordinary the move is considered and could potentially be a good candidate for buying the dip or selling a rip. These are very similar levels to what the SwaggyStocks' [BTFD Bot](https://swaggystocks.com/dashboard/stocklabs/trading-bot) uses.\n\nLow-end Tickers | Rating | High-end Tickers | Rating\n:--|:--:|:--|:--:\nF|81|F|81\nINTC|80|INTC|80\nTAN|77|TAN|77\nSPOT|77|SPOT|77\nICLN|76|ICLN|76\nHOME|75|HOME|75\nGSX|75|GSX|75\nAAPL|75|AAPL|75\nHD|74|HD|74\nFUBO|74|FUBO|74\nAMD|74|AMD|74\nSEDG|73|SEDG|73\nNVDA|73|NVDA|73\nENPH|73|ENPH|73\nLOGI|72|LOGI|72", "I think it’s because they have market dominance. \n\nRumors are saying NVDA might double in the next few months.\n\nThe shortage if semiconductors tells me the demand is high, and this might indicate a phenomenal earning call. \n\nThoughts? I might add here. \n\nCathy Wood’s ARK added 8K shares.", "Rumors are saying NVDA might double in the next few months.\n\nHuh? What do you mean, the share price?"], "2021-01-23": ["Yo \n\nIf you think BB moon’d after this week, you’re a rough brained retard. Our astronauts John Chen and Tom Eacobacci are literally in the break room; Chen’s unpacking some homemade Yangzouh Fried Rice from his wife, Tom is microwaving stale coffee and asking Chen if he’s going to change his name to Cha Ching after he becomes a Billionaire in 2023. Chen smirks as he cracks open his wheel of fortune cookie... the  point is, rocket is still fucking grounded. I repeat, the rocket is grounded. \n\nListen retards, did you miss AMD? Did you miss NVDA? Did you miss trash ass Cringecoin? Hell, did you even miss TSLA? Are you seething with FOMO up to your ears and out of your assholes watching these stocks mint fresh millennial millionaires while you twiddled your thumbs thinking “GeE WiZ tHeY haVe To CoMe DoWn EveNtuAlLYyyyYyyYy” \n\nPro tip: they never came down...\n\nThese rockets went to the fucking moon and left your ass behind on planet Earth, living a wage cuck life, while the retards that boarded these rockets are on the moon laying on beach chairs, sunglasses on, and rubbing sunscreen with SPF 9000 on their smooth brains because they got front row tickets to the sun... FRONT ROW TICKETS TO THE FUCKING, SUN... this is the present state of affairs. \n\nThere is, lucky you, however, another rocket with the inscription BBC fueling up and selling tickets to the moon AS WE SPEAK.\n\nCurrent position: missionary with 10,555 shares and reverse cowgirl with some calls. I’m holding unrealized profits of about $110k and realized profits of about $100k. \n\nHowever, if you ask me 10 years from now my biggest regret in life... I will tell you two things: 1, not getting my wife her bf earlier on, and 2, booking $100k profit too soon in BB. \n\nMay Lord Chen forgive my moment of weakness. Learn from me. Buy and walk away. Buy and hold. Do not be tempted to sell before the moon. To not sell when the rocket is still in the stratosphere. \n\nMoon is $50 IF THE STOCK JUST TRADES ON PAR WITH ITS FUCKING PEERS, MOON CAN EASILY BE $100+ IF YOU FACTOR IN VERTICALS, ECONOMIC MOAT, and a $450-750 billion Auto Data Market as stated in Mckinsey &amp; Company’s report on Monetizing Auto Data. Yes that’s not a mistake, the overall revenue pool from Global Auto Data monetization could be as high as $750 BILLION in 2023. This is the market BB has cornered and is about to squeeze by the balls. QNX was always the crown Jewel of all their verticals. This was always the master plan for the turnaround. We are on the fucking cusp of one of the greatest turnarounds in history. \n\nListen, I don’t think some of you rough brained retards realize what is happening: \n\nAsk yourselves: why is the EV sector so hot? Why is every large tech corporation trying to get a piece of this Auto pie? \n\nYou wanna know why? Because when the computer first came out it took the space of entire fucking floors in a building to do simple calculations... when the cell phone first came out, you needed a fucking brief case just to carry it and looked like an absolute tool making a phone call, stopping everything you’re doing, laying down your suitcase, opening it, taking out the brick, extending a massive antenna, LMFAO, what fucking tools boomers were... anyways, now look at the modern laptop and smartphone. Look at the revolutions these products went through to become cemented into our lives. Look at the markets these products opened up for us. \n\nNow, what current item is undergoing this type of revolution? You guessed it, you smooth brained criminal you, the Automobile. What was once dinosaur machinery unironically running on dead dinosaurs, is now making the revolution on the scale that computers and phones went through to become what they are today. \n\nAnd guess who created a business moat anticipating this move 10 years in advance? Guess who cemented their ISO SAFETY CERTIFIED AUTO OS into 175 million automobiles as of today, hint hint: it’s the same company that’s so criminally undervalued and just took on AWS as their partner to scale up their business for next phase of the turnaround: Revenue Growth. \n\nBlackberry. It’s Blackberry. Babe berry. Member berry. The blacker the berry... the sweeter the juice boys. \n\n“whAt aBoUT GoOgLe aNd APpLe or TSLA TaKiNg OvEr the Auto OS mArKet” \n\nListen retards, BlackBerry’s MOAT is bullet proof. You know why?\n\nBecause what’s the one thing Google, Apple, and TSLA have in common? They’re actually in the fucking auto business. \n\nYou think Mercedes or Toyota wants to cede even more profit in the auto business to competitors by adopting their OS and giving them a boost? Do you know how cutthroat and ruthless the corporate world is? \n\nLet me demonstrate with the ol’ lemonade stand analogy. Let’s say you setup a lemonade stand outside your house and all the kids are going nuts for your lemonade. Next thing you know, Jimmy from next door opens a lemonade stand, and throws in a Jolly Rancher inside each lemonade he makes. You’re fucked. Jimmy just took your business, your friends, and your girl and her bf. \n\nYou need to level the playing field by adding Jolly Ranchers to your lemonade... so how will you do this? Are you gonna go up to Jimmy’s stand and straight up buy Jolly Ranchers from your mortal enemy? Is that what a smooth brained person would do? \n\nNO, you would walk your ass down the street to a neutral third party convenient store, buy fucking Jolly Ranchers from them, and while you’re at it, buy some cough syrup and add that as well to your fucking lemonade. Because fuck Jimmy, that’s why. \n\nSpeaking of lemonade... \n\n“wHat iF ShiTrOn TaKeS a ShIT oN BB?”\n\nAndrew Left although the gayest bear of them all, actually saw BB potential years ago calling it the next NVDA. He was early on that call, but he was right. \n\nBack to the lemonade moat: \n\nListen retards, Blackberry is not a competitor to any auto maker the same way Apple, Google, and TSLA are. You think auto makers are going to use their competitors OS? Or you think these non techy auto dinosaurs like Mercedes and Toyota are gonna reinvent the wheel and create their own OS. Fuck no. Don’t be so rough brained and fall for that gay bear “DD” \n\nBlackBerry is a third party corporation that all auto makers can form an auto cartel around with Papa Chen as the cartel lord. A couple automakers MIGHT create their own OS because they’re a fucking tech company to begin with, and they have the scale and reach to do so, but don’t think for A FUCKING SECOND their competitors are gonna just line up to use it and cede more their profits to them. These other Auto OS (if made) will be specific and unique to that companies own car. Think. Use that smooth brain. \n\nBlackberry has effectively become the gate keeper of the Auto Data Market. \n\nAlso this is a tough fucking market. Cars are on of the most data rich endpoints in the world that need securing. This isn’t like a laptop, you click the wrong link, and next thing you know you have a million Hentai pop ups. The car is more serious. You click the wrong link; and you’re dead. \n\nAre you getting the picture now? Do you see why Cylance was bought? Do you see why BlackBerry’s moat is so secure? \n\nNot only does QNX act as the gatekeeper of all auto data, it fucking protects the super sensitive endpoints using AI driven cyber protection that gets better and better the more the data grows, which it will, exponentially. \n\nAutomakers are lined up like school boys on Easter Sunday ready for deliverance from Papa Chen as he blesses them with QNX.\n\nRemember when Chen said: “when better days come, we’ll be ready to execute”\n\nBetter days are here. This is what he was talking about. They’ve positioned and prepared themselves for 10 years to become the Auto Data Gatekeeper once the technology was ready. The foresight on Papa Chen... Absolute Genius.  \n\n[The Ultimate DD by Mckinsey &amp; Company — Read This and Get your Pee Pee Hard knowing BB will effectively be the gatekeeper of this New Market](https://www.mckinsey.com/~/media/mckinsey/industries/automotive%20and%20assembly/our%20insights/monetizing%20car%20data/monetizing-car-data.ashx)"], "2021-01-24": [], "2021-01-25": ["After my sudden retirement left a void in the WSB community, and I have been pleased to see fresh blood fill my shoes and continue on my legacy of helping others make it.  Watching DFV has put a smile on my face as he has reminded me of our good ol' days creating a new world of unlimited memes and money.  \n\nI am announcing that I will come out of retirement for r/wallstreetbets when someone worthy rises to challenge my immortalized legacy of NVDA, AMD, TSLA, The Big Short, BTC, and ETH.  \n\nLet's hope for more success from DFV, if he keeps it up I would love to 1v1 him in a trading faceoff for charity."], "2021-01-26": [], "2021-01-27": [], "2021-01-28": [], "2021-01-29": [], "2021-01-30": ["[removed]"], "2021-01-31": [], "2021-02-01": [], "2021-02-02": [], "2021-02-03": [], "2021-02-04": [], "2021-02-05": [], "2021-02-06": [], "2021-02-07": [], "2021-02-08": [], "2021-02-09": [], "2021-02-10": [], "2021-02-11": [], "2021-02-12": [], "2021-02-13": ["Any thoughts on these?  I see T mentioned a lot here, but with Covid hitting, I would’ve expected a lot more growth in price from ATT than I’ve seen.  \n\nJBSS Seems like a huge fit with the vegan movement, keto, and other health moments.\n\nThey pay a lot of special dividends.  \n\nLove NVDA and AMD but they are so high in price right now, and not clear on capacity.    Hoping AMD moves towards dividends I’m not sure NVDA is not a better sell vs hold as the dividend is so low and price so high.  Also leary when Cramer says buy.  ;-)\n\nThanks in advance."], "2021-02-14": [], "2021-02-15": [], "2021-02-16": [], "2021-02-17": [], "2021-02-18": [""], "2021-02-19": [], "2021-02-20": [], "2021-02-21": [], "2021-02-22": [], "2021-02-23": ["So I am currently holding ARKG and I am looking to swap over to ARKK as I am already invested into TSM, NVDA, APPL and quite a few others that ARKG is already holding.   \n\n\nSo I decided I wanted to swap to ARKK but just before purchasing I realized OGIG's holdings are quite similar to ARKK (I have OGIG as well).   \n\n\nWhat are everyone's thoughts on this?"], "2021-02-24": [], "2021-02-25": [], "2021-02-26": [], "2021-02-27": [], "2021-02-28": [], "2021-03-01": [], "2021-03-02": [], "2021-03-03": [], "2021-03-04": [], "2021-03-05": [], "2021-03-06": [], "2021-03-07": [], "2021-03-08": [], "2021-03-09": ["In the past 6 hours on r/WallStreetBets...\n\n 1. GME has been mentioned 807 times.\n\n 2. TSLA has been mentioned 166 times.\n\n 3. PLTR has been mentioned 163 times.\n\n 4. AMC has been mentioned 150 times.\n\n 5. AAPL has been mentioned 84 times.\n\n 6. SPY has been mentioned 68 times.\n\n 7. RKT has been mentioned 50 times.\n\n 8. AMD has been mentioned 48 times.\n\n 9. QQQ has been mentioned 48 times.\n\n 10. DASH has been mentioned 45 times.\n\n 11. BB has been mentioned 42 times.\n\n 12. NIO has been mentioned 41 times.\n\n 13. DKNG has been mentioned 24 times.\n\n 14. NOK has been mentioned 23 times.\n\n 15. TD has been mentioned 22 times.\n\n 16. NVDA has been mentioned 21 times.\n\n 17. RIOT has been mentioned 20 times.\n\n 18. SQ has been mentioned 19 times.\n\n 19. GE has been mentioned 18 times.\n\n 20. ASO has been mentioned 17 times.\n\n 21. SQQQ has been mentioned 16 times.\n\n 22. XOM has been mentioned 16 times.\n\n 23. TQQQ has been mentioned 13 times.\n\n 24. MARA has been mentioned 12 times.\n\n 25. DIS has been mentioned 12 times.\n\n 26. TSM has been mentioned 11 times.\n\n 27. DOW has been mentioned 11 times.\n\n 28. AI has been mentioned 10 times.\n\n 29. EYES has been mentioned 10 times.\n\n 30. PE has been mentioned 10 times.\n\n&amp;#x200B;\n\nThis hourly update has been bought to you by MemeStock.com."], "2021-03-10": [], "2021-03-11": [], "2021-03-12": [], "2021-03-13": [], "2021-03-14": ["\"In our Mid-Cycle Correction note (link here), we argued that semis were due for a mid-cycle correction, and that the last four mid-cycle corrections lasted on average 9 weeks and accounted for 1,100 bps of underperformance. We think that the relative underperformance of semis during this Mid-Cycle Correction has largely played out and that it is a good time to add selected semi names, as we have shown post previous Mid-Cycle Corrections, semis typically outperforming by 25% over 26 weeks...MCHP, ADI, NVDA, and MRVL are our top picks at this part of the Cycle.\"\n\n[https://street-guru.com/opinion/nvda\\_mchp\\_nvda-jefferies-says-the-mid-cycle-correction-has-largely-played-out-and-its-time-to-add-semis-again\\_20210314\\_982/](https://street-guru.com/opinion/nvda_mchp_nvda-jefferies-says-the-mid-cycle-correction-has-largely-played-out-and-its-time-to-add-semis-again_20210314_982/)\n\nhttps://preview.redd.it/0zd1oqi6mxm61.png?width=3400&amp;format=png&amp;auto=webp&amp;s=e95a7c4b8a2e8548c1725d5305d32c02390680e3"], "2021-03-15": [], "2021-03-16": [], "2021-03-17": [], "2021-03-18": [], "2021-03-19": [], "2021-03-20": [], "2021-03-21": [], "2021-03-22": [], "2021-03-23": [], "2021-03-24": [], "2021-03-25": [], "2021-03-26": [], "2021-03-27": [], "2021-03-28": [], "2021-03-29": [], "2021-03-30": [], "2021-03-31": [], "2021-04-01": [], "2021-04-02": ["I'm curious, what programs do you guys use on your computer for all the basic and work stuff?\n\nFor me is:\n\n* NVDA and Windows Narator  as my screen readers\n* Google Chrome and Brave as internet browsers\n* Windows Defender and Malware Bites for security\n* Reaper and audacity for audio/video manipulation\n* Spotify as my music streaming service\n* PotPlayer as my main media player because it can read subtitles using screen reader or built in windows TTS engine\n* Geek Uninstaller for removing junk from my PC\n* 7Zip for archives and stuff like this\n* Google Docs for document editing\n* Google Drive Backup and Sync to get my work documents anywere and to sync them\n* Signal, Discord and Whatsapp web for comunications\n\nSo what is your list and what you like about this programs?"], "2021-04-03": [], "2021-04-04": [], "2021-04-05": [], "2021-04-06": [], "2021-04-07": [""], "2021-04-08": [], "2021-04-09": [], "2021-04-10": [], "2021-04-11": [], "2021-04-12": [], "2021-04-13": [], "2021-04-14": [], "2021-04-15": [], "2021-04-16": [], "2021-04-17": ["For those of you who aren't in the know, Discord is a messaging/social platform that was created primarily as a way for parties in videogames to communicate but has grown quite big and it's now a very popular place to send messages in text form and participate in voice chat alike, with streaming and camera functionality. There are different communities (called servers) that one can join through an invitation and participate in. \n\nIts accessibility has improved a lot in the past six months, at least as I experience it as someone with remaining sight that uses NVDA part-time (that is, can't speak for totally blind users and I'd love to know how you feel it is now.)\n\nI there used to be a server called VIP lounge, it was a really welcoming place, but all invites and the site seem to have disappeared and I'm assuming it shut down due to inactivity.\n\nI would love to build a Discord server in that spirit, a generalistic conversation server that will help us build a closer community. There's already a specific VI gaming server and another one with an emphasis on the blind experience, but I feel a lack of spaces where I can talk to other blind and visually impaired people about different topics, casually, regardless of whether our sight or lack of it is relevant, and without emphasizing one topic over another, although it would be lovely to provide different channels (or chatrooms within the server, for you old school folks!) for different hobbies.\n\nWould any of you be interested? If so, please comment or PM me, I don't want to build it on my own and I would be extremely grateful to have other people to provide feedback and help me out in moderating and administering it. \n\nThanks for reading, have a lovely day!"], "2021-04-18": [], "2021-04-19": [], "2021-04-20": [], "2021-04-21": [], "2021-04-22": [], "2021-04-23": [""], "2021-04-24": [], "2021-04-25": [], "2021-04-26": [], "2021-04-27": [], "2021-04-28": [], "2021-04-29": ["Hi everyone,\n\nI'm back in the Jaws ecosystem since I learned that my beloved Text Expander app doesn't work as well with NVDA. I've gotten really used to the way NVDA voices certain things though, so I'd like to ask the community if I can do some of the following.\n\n* When I jump from tab to tab in Chrome by pressing ctrl-numbers1-9, Jaws announces \"CTRL + number.\"  Is there a way to turn this off so there is no announcement?\n* I find that while I'm, for instance, thinking of what to write, Jaws will often start reading things in the system tray, on the task bar, etc. without my pressing anything.  I have turned off mouse and screen echo but it still happens.  Any ideas on how to fix this?\n* In Google Sheets, is there any way to get Jaws not to read the column and row headers each time I move to a new column or row.  Ideally, I'd like it to say the contents of the cell before it reads the header.  This is very nit-picky so I understand if there's no solution.\n\nThanks all!"], "2021-04-30": []}