{"2020-10-01": ["Am I the only one whose game keeps crashing since the new update?\n\nPs, in case you are wondering i have a 2070super gpu and amd ryzen 7 3700x cpu \n\nThank you."], "2020-10-02": ["Looking to get rehome some hardware I cleaned out of the attic and am no longer using! Best guesses on pricing, feel free to comment if something's off base or make an offer, will cut a deal if you want multiple items. Local zip 08857. Thanks!\n\n&amp;#x200B;\n\n|Corsair Vengeance 16GB (2x8GB) DDR4-3200 \\[CMK16GX4M2Z3200C16\\]|Used. Advertised as the AMD Ryzen version. Last I checked Thaiphoon says it's Samsung B-die but I don't have a screenshot. XMP worked fine and that's all I cared about.|$50 shipped|[https://photos.google.com/photo/AF1QipPYmcXQiWB0hv\\_Uz-gYcooN4Ta6h\\_Wz8fzFWI4t](https://photos.google.com/photo/AF1QipPYmcXQiWB0hv_Uz-gYcooN4Ta6h_Wz8fzFWI4t)|\n|:-|:-|:-|:-|\n|Noctua NH-L9x65 SE AM4 Low Profile Cooler|Used. Original box and all accessories included except thermal paste.|$30 shipped|[https://imgur.com/a/OSfUvV4](https://imgur.com/a/OSfUvV4)|\n|Corsair SP120 Static Pressure White LED Fans \\[CO-9050030-WW\\]|Used, 2 available|$20 shipped for pair|[https://imgur.com/a/bunqLFQ](https://imgur.com/a/bunqLFQ)|\n|Corsair ML120 Black/Gray \\[CO-9050039-WW\\]|Used, 4 available|$20 shipped for 2, $35 shipped for 4|[https://imgur.com/a/653ACrY](https://imgur.com/a/653ACrY)|\n|Corsair SP140 Static Pressure White LED Fans \\[CO-9050035-WW\\]|Used, 2 available|$20 shipped for pair|[https://imgur.com/a/r1KzA79](https://imgur.com/a/r1KzA79)|\n|HWLabs Black Ice Nemesis 240GTX Radiator|Used. Comes with set of screws for 25mm fans on one side. \\~2.5 years old.|$30 shipped|[https://imgur.com/a/hFwP568](https://imgur.com/a/hFwP568)|\n|Alphacool 360mm Radiator|Used. Don't have the screws, but if I remember they were smaller M3 or something. Full copper, the plugs have lost some color. Don't remember how old this is.|$30 shipped|[https://imgur.com/a/hFwP568](https://imgur.com/a/hFwP568)|\n|Netgear GS108Ev2 8-port Gigabit Switch|Used, no power adapter.|$5 + shipping|[https://imgur.com/a/iSKPAjx](https://imgur.com/a/iSKPAjx)|\n|Netgear GS108Tv2 8-port Gigabit Smart Switch|Used, no power adapter.|$5 + shipping|[https://imgur.com/a/5zPTNXr](https://imgur.com/a/5zPTNXr)|\n|Netgear GS116v2 16-port Gigabit Switch|Used, no power adapter.|$10 + shipping|[https://imgur.com/a/5zPTNXr](https://imgur.com/a/5zPTNXr)|\n|MSI SLI Bridge|Used. Is this still relevant?! Looks cool though.|$5 + shipping|[https://imgur.com/a/TZVeULz](https://imgur.com/a/TZVeULz)|"], "2020-10-03": [" I'm halfway through the book and Joe is much more disgusting than I wanted to imagine. So much so I stopped imagining Penn as Joe and started imagining men who fit the bill better. I still think of him as Dan from Gossip Girl. \nJoe seems unapproachable but he's not viewed creepy looking (or at least from his perspective), looks a bit scary but not threatening, and i'd assume he's unconventionally attractive because girls seem to generally like him, but his attitude amd behaviors make him ugly. I think about Christian Camargo (he played Brian Moser on Dexter), Adam Brody, or Cillian Murphy. What do you guys think?  I'm curious to see who you picture our favorite bibliophile."], "2020-10-04": ["I've wanted to stop drinking for about 4 years but have made zero effort to do so. Lately I've been thinking about it more and more which (I think) is kind of a bigger step towards my (possible) future sobriety. With thinking about it more and more I've been trying to think why I always want to drink. I think tonight I've realized that it's to dull my feelings. I know you're probably thinking \"well ya, no shit.\" But honestly I never realized this. I thought it was just about having a good time. But the more I think about it the more I think I'm starting to see my true intentions. I grew up in a very hostile household. My parents were always drunk, high, tweaked, etc. In the beginning it was just my dad so my mom would vent to me. I can't tell you how many days/nights I spent trying to calm down my mom. Mind you I was around 10 at the time. The whole time I'm trying to calm her down, I myself am also dealing with an alcoholic/high father and trying not to break down and cry with her. It went on for years until moved out at 18. This kind of taught me to never show my emotions and it desensitized me. I never truly let anyone know how I'm REALLY feeling and I just deal with my demons myself and it's fucking killing me.\nOutside of a funeral, the only time I can cry is if I get completely shitfaced. Then everything just pours out at once and I totally fuck up the night. It's a lose lose for everyone. I so desperately wish that I could go out with my friends and have a few beers and enjoy the night but there's always a tipping point amd then I'm just a mess.\n\nI'm saying all of this to just say this: I think I need therapy. I think I have a deeper problem and I'm just medicating with drinking. To be clear, I'm well aware that that's not healthy. But if I were to be totally sober I would be in the same boat I'm in now. Not expressing my feelings and dealing with all of my pent up anger/depression/anxiety by myself until I finally snap. I just found out I have a lump in my testicle and I'll have to have it removed. This scares the living shit out of me and the only people that know are my mom, my fiance, and her mother. I haven't said anything to anyone else because it's not a conversation I want to have. Just an example of me running from my problems instead of facing them.\n\nI love this little community so damn much. I don't feel so alone anymore and it helps me a lot. Thank you.\n\nNot sure why I posted this but it does feel good to let it out. Maybe someone can see it and realize that they have a problem deeper than drugs/alcohol. \n\nStay strong everyone."], "2020-10-05": ["Hey! I’m building a new computer which will include the Fractal Design Define 7 for the case, RTX 3080 and an i9-10900K. I’m wondering if there are any easy to install coolers for the CPU as this is my first build. I’m looking at one in particular that I like but I’m not sure if it will sufficiently cool the CPU as I’ve heard that it becomes very hot. Here it is and thanks in advance:\nThermaltake UX200 5V Motherboard ARGB Sync 16.8 Million Colors 15 Addressable LED Intel/AMD Universal Socket Hydraulic Bearing 130W CPU Cooler CL-P064-AL12SW-A https://www.amazon.ca/dp/B07WTXSVGR/ref=cm_sw_r_cp_api_fab_vSPEFbJ3DEY0C"], "2020-10-06": ["hey, everyone, I am looking to get a pc around Christmas and was wondering if this list is good, I know a bit about computers but I like to get others opinions to make sure that everything will work. Thanks have a great day. my budget for the setup is around 2100 cad. If anyone would like to recommend a part that will work better feel free. (i want to stick with amd tho)\n\n\\[PCPartPicker Part List\\]([https://pcpartpicker.com/list/KRgBDc](https://pcpartpicker.com/list/KRgBDc))\n\n&amp;#x200B;\n\nType|Item|Price\n\n:----|:----|:----\n\n\\*\\*CPU\\*\\* | \\[AMD Ryzen 5 3600 3.6 GHz 6-Core Processor\\]([https://pcpartpicker.com/product/9nm323/amd-ryzen-5-3600-36-thz-6-core-processor-100-100000031box](https://pcpartpicker.com/product/9nm323/amd-ryzen-5-3600-36-thz-6-core-processor-100-100000031box)) | $199.99 @ Best Buy\n\n\\*\\*CPU Cooler\\*\\* | \\[NZXT Kraken M22 Liquid CPU Cooler\\]([https://pcpartpicker.com/product/fmx2FT/nzxt-kraken-m22-liquid-cpu-cooler-rl-krm22-01](https://pcpartpicker.com/product/fmx2FT/nzxt-kraken-m22-liquid-cpu-cooler-rl-krm22-01)) | $79.98 @ Amazon\n\n\\*\\*Motherboard\\*\\* | \\[Asus ROG STRIX B550-F GAMING (WI-FI) ATX AM4 Motherboard\\]([https://pcpartpicker.com/product/vFhmP6/asus-rog-strix-b550-f-gaming-wi-fi-atx-am4-motherboard-rog-strix-b550-f-gaming-wi-fi](https://pcpartpicker.com/product/vFhmP6/asus-rog-strix-b550-f-gaming-wi-fi-atx-am4-motherboard-rog-strix-b550-f-gaming-wi-fi)) | $204.99 @ Newegg\n\n\\*\\*Memory\\*\\* | \\[Corsair Vengeance LPX 16 GB (2 x 8 GB) DDR4-3200 CL16 Memory\\]([https://pcpartpicker.com/product/p6RFf7/corsair-memory-cmk16gx4m2b3200c16](https://pcpartpicker.com/product/p6RFf7/corsair-memory-cmk16gx4m2b3200c16)) | $62.99 @ Amazon\n\n\\*\\*Storage\\*\\* | \\[Western Digital Blue 500 GB M.2-2280 Solid State Drive\\]([https://pcpartpicker.com/product/6j448d/western-digital-blue-500gb-m2-2280-solid-state-drive-wds500g2b0b](https://pcpartpicker.com/product/6j448d/western-digital-blue-500gb-m2-2280-solid-state-drive-wds500g2b0b)) | $59.99 @ Amazon\n\n\\*\\*Video Card\\*\\* | \\[Zotac GeForce GTX 1660 SUPER 6 GB Twin Fan Video Card\\]([https://pcpartpicker.com/product/y2xbt6/zotac-geforce-gtx-1660-super-6-gb-twin-fan-video-card-zt-t16620f-10l](https://pcpartpicker.com/product/y2xbt6/zotac-geforce-gtx-1660-super-6-gb-twin-fan-video-card-zt-t16620f-10l)) | $249.99 @ B&amp;H\n\n\\*\\*Case\\*\\* | \\[NZXT H510 ATX Mid Tower Case\\]([https://pcpartpicker.com/product/6Cyqqs/nzxt-h510-atx-mid-tower-case-ca-h510b-w1](https://pcpartpicker.com/product/6Cyqqs/nzxt-h510-atx-mid-tower-case-ca-h510b-w1)) | $69.98 @ Amazon\n\n\\*\\*Power Supply\\*\\* | \\[EVGA BR 500 W 80+ Bronze Certified ATX Power Supply\\]([https://pcpartpicker.com/product/kCtQzy/evga-br-500w-80-bronze-certified-atx-power-supply-100-br-0500-k1](https://pcpartpicker.com/product/kCtQzy/evga-br-500w-80-bronze-certified-atx-power-supply-100-br-0500-k1)) | $49.99 @ Walmart\n\n\\*\\*Operating System\\*\\* | \\[Microsoft Windows 10 Home OEM 64-bit\\]([https://pcpartpicker.com/product/wtgPxr/microsoft-os-kw900140](https://pcpartpicker.com/product/wtgPxr/microsoft-os-kw900140)) | $108.78 @ Other World Computing\n\n\\*\\*Monitor\\*\\* | \\[Acer XV240Y Pbmiiprx 23.8\" 1920x1080 144 Hz Monitor\\]([https://pcpartpicker.com/product/wThmP6/acer-xv240y-pbmiiprx-238-1920x1080-144-hz-monitor-umqx0aap01](https://pcpartpicker.com/product/wThmP6/acer-xv240y-pbmiiprx-238-1920x1080-144-hz-monitor-umqx0aap01)) | $214.98 @ Newegg"], "2020-10-07": ["I'm not a mod, but I hope one can pin this. It seems to be an issue this sub is getting flooded with, including one I'm experiencing myself, so I wanted to make a groupthink post on how to fix it, including any solutions we have to date. As such, they are...  \n\n**Description of issue: After launching (from launcher or the direct .exe) the game immediately becomes unresponsive.**\n\n**Things we know don't work, so don't suggest them-**\n- Re-installing\n- Running as admin\n- Turning off firewall\n- Verifying game files\n\n\n\n# Possible Solutions \n\n\nu/xkorzen\n\n&gt; Change to DirectX - cog wheel next to play button.\n\n\n(For some this seems to fix it. For many this fixes A LOT of issues- similar to problems with RDR2, the Vulkan API version seems to be causing a lot of issues. However, may be unrelated to this specific issue.)\n\n\nu/ecish\n&gt; I commented before but I just found a fix for me that someone posted on steam. Download visual studio redistros x64 and x86 from Microsoft then restart your system. I don’t know much about it but I was getting desperate so I tried and it worked.\n\n[Latest link to this](https://support.microsoft.com/en-us/help/2977003/the-latest-supported-visual-c-downloads) Didn't work for me, but it might work for others as it did u/ecish\n\n\nu/gunnerrat\n\n&gt; What I found is you have to have at least driver version 440 for Nvidia. Anything before that won't work. Attempting to update previously got me an 'update failed' error. I tried it again, this time without GeForce experience and I at least got the driver to update.\n&gt; You can launch dx 11 exe directly: \\steamapps\\common\\Baldurs Gate 3\\bin\\bg3_dx11.exe. I can't get anything else to work for me. This combination works for me. I'm surprised Larian failed to mention needing version 440 or higher.\n\n(Others have claimed driver updates help, but others say it did not change the end result. If the launcher itself is crashing, I can certainly see using the exact bg3_dx11.exe working)\n\nu/Fausterion18\n\n&gt; Guys I just figured out the fix to the launch crash for windows 7. Here's what you need to do.\n&gt; Go to your install folder for the game (mine is I:\\Program Files (x86)\\Steam\\steamapps\\common\\Baldurs Gate 3). DELETE THE LAUNCHER FOLDER. Now find bg3.exe in the bin folder. Right click and run the game as administrator, ignore the error steam gives you, the game will now run without the launcher.\n&gt; I also installed the latest microsoft C++ updates but I'm not sure if that had any effect. If the above doesn't work try installing these updates:\n&gt; https://support.microsoft.com/en-us/help/2977003/the-latest-supported-visual-c-downloads\n\n(I'm yet to try this myself, as if the fix is incorrect it'll prompt a re-install, which I don't really want to do at the moment.)\n\n\n# My own anecdote\n\nThe game itself launches every few dozen or so times I attempt it, but all other times it simply becomes unresponsive. Computer specs for those effected seem completely unrelated, from NVIDA cards to AMD. High end to low. Personally, I am running on Win7 so I figured that was related, but most issues are also coming from Win10.  \n\n\nWhile there are many posed solutions, for others, such as myself, these solutions are inadequate. Larian hasn't responded to any tweets on the issue. Naturally, the game just got released.\n\n\nAnyone with any suggestions, please comment below :) I will include it in my post (assuming anyone can say it helped them)."], "2020-10-08": ["###Troubleshooting Help:\n\n**What is your parts list? [Consider formatting your parts list.](http://www.reddit.com/r/buildapc/wiki/pcpp)**\n[PCPartPicker Part List](https://pcpartpicker.com/list/qQynTJ)\n\nType|Item|Price\n:----|:----|:----\n**CPU** | [AMD Ryzen 5 2600 3.4 GHz 6-Core Processor](https://pcpartpicker.com/product/jLF48d/amd-ryzen-5-2600-34ghz-6-core-processor-yd2600bbafbox) | $149.99 @ Amazon \n**Motherboard** | [MSI B450M BAZOOKA Micro ATX AM4 Motherboard](https://pcpartpicker.com/product/pcF48d/msi-b450m-bazooka-micro-atx-am4-motherboard-b450m-bazooka) |-\n**Memory** | [Crucial Ballistix Sport LT 16 GB (2 x 8 GB) DDR4-2400 CL16 Memory](https://pcpartpicker.com/product/WpH48d/crucial-memory-bls2k8g4d240fse) |-\n**Storage** | [Samsung 850 EVO-Series 250 GB 2.5\" Solid State Drive](https://pcpartpicker.com/product/3kL7YJ/samsung-internal-hard-drive-mz75e250bam) | $107.99 @ Adorama \n**Video Card** | [MSI GeForce GTX 1660 6 GB VENTUS XS OC Video Card](https://pcpartpicker.com/product/MYMwrH/msi-geforce-gtx-1660-6-gb-ventus-xs-oc-video-card-gtx-1660-ventus-xs-6g-oc) | $209.95 @ B&amp;H \n**Case** | [Thermaltake Core V21 MicroATX Mini Tower Case](https://pcpartpicker.com/product/QMp323/thermaltake-case-ca1d500s1wn00) | $69.98 @ Amazon \n**Power Supply** | [Cooler Master Silent Pro M2 620 W 80+ Bronze Certified Semi-modular ATX Power Supply](https://pcpartpicker.com/product/t7V48d/cooler-master-power-supply-rs620spm2e3us) |-\n**Operating System** | [Microsoft Windows 10 Home OEM 64-bit](https://pcpartpicker.com/product/wtgPxr/microsoft-os-kw900140) | $108.78 @ Other World Computing \n | *Prices include shipping, taxes, rebates, and discounts* |\n | Total (before mail-in rebates) | $656.69\n | Mail-in rebates | -$10.00\n | **Total** | **$646.69**\n | Generated by [PCPartPicker](https://pcpartpicker.com) 2020-10-07 23:51 EDT-0400 |\n\n**Describe your problem. List any error messages and symptoms. Be descriptive.**\n\nShe was using her computer like normal when it completely froze. We did a hard reboot. It got past the initial splash screen then as soon as it reached the spinner before loading windows it froze again (and would continue doing so each time). I can get into BIOS just not past that.\n\n**List anything you've done in attempt to diagnose or fix the problem.**\n\nTried booting from a Windows 10 USB drive -- resulted in the system still freezing, again just when the OS/setup would start to load.\nTried removing each ram stick -- same result (also tried running memtest86 for a couple hours and it passed).\nTried swapping out the GPU -- same result.\nTried testing the PSU using a tester -- passed.\nUpdated the BIOS to the latest version (was able to do that by loading it onto a USB drive and flashing from the BIOS) -- now it instead of freezing it just reboots.\n\n**Provide any additional details you wish below.**\n\nRight now I'm thinking the CPU is bad but thought I would post before trying to RMA it."], "2020-10-09": ["Title \n\nI use Windows 10 vm's just for things that can't run on Linux. I passthrough an RX580 through a VM and it used to work, res was 1920x1080 and I could play my Genshin Impact and all that. But for this time around, I launched a VM this time and: \n\nThe resolution is crap, like really bad resoluton, I'm talking about like 640x480. The VM boots fine and boots fast just like I would launch a VM normally but the resolution is crap. I try installing RX580 drivers but it only gives me the AMD bug report tool. Weird. \n\nI go to graphics settings in the search and try to set a game to a certain performance via GPU but it doesn't mention my card anywhere, it says \"Microsoft blender graphics\" or something like that. \n\nIs this the infamous reset bug with AMD cards that people have been talking about? My GPU model is an XFX RX580 GTS XXX edition for anyone wondering."], "2020-10-10": ["[First built this PC](https://pcpartpicker.com/list/PBMnQD) in college, mostly original except for the GPU and Noctua fans \n\nNow, I am out of school, have a real boy job and some extra $$$ in the bank and I am looking to upgrade. Looking to spend right around ~$1000\n\nMy primary use cases are gaming (love me some RPG's and Total War (and LoL too...)) , lite Photoshop as well as non professional 3D modeling. I like to have the games in 2k and next year plan on getting an ultrawide. I want this bad lad to be silent. \n\n\n\nI want to keep on the upgrade CPU every 5-6 years cycle so I am [proposing this here build](https://pcpartpicker.com/list/Fx48dD) and had a few questions and was looking for some suggestions. \n\n\n\nI live 5 minutes away from a Microcenter (yay!), so I would like to take advantage of their CPU / MoBo combo deals. [Link here for 3700x](https://www.microcenter.com/product/608318/amd-ryzen-7-3700x-matisse-36ghz-8-core-am4-boxed-processor-with-wraith-prism-cooler)/ wtf am I looking at here, motherboards are always lost on me. Do I shell out extra $ for a 550, or go for the cheapest 450 option? \n\nAm I over / under spending on CPU?\n\nI am planning on selling my older parts (sans fans and storage) and use that cash to buy a new GPU, suggestions? \n\nThanks in advanced for your help, I am hanging out and can answer questions to clarify"], "2020-10-11": [""], "2020-10-12": ["Here are some images. Not sure what to do. [https://imgur.com/a/fZl92v1](https://imgur.com/a/fZl92v1)"], "2020-10-13": ["Hello. I was looking for some advice on what to upgrade my computer. This is my current set up right now : Cpu: amd 8 core cpu\nGpu: evga gtx 970\nRam: corsair vengeance 16gb \n120gb ssd \n1tb 7200rpm hard drive.\nWindows 10 pro 64bit.\n\nI was Trying to figure out What is the best route to go."], "2020-10-14": ["Hello!\n\nI've been doing some homework and the two big parts that I'd like to have are a Ryzen 3600 CPU and a AMD Rx 5700 GPU.  Otherwise the rest I'm flexible.   I'd like some advice if I'm getting the best bang for my buck with the following build.  Any advice is welcome!\n\nI've haven't had much luck looking through Slickdeals (might've just missed them).  I used PC Parts picker with the above mentioned items and it ends up coming out closer to 1200$ (after tax) (I chose the other items that had at least a 4+ star rating on their respective websites) whereas a similar CyperpowerPC build I could purchase for \\~1050 with a 5% coupon.\n\nI also have historically bought from CyberpowerPC with no issues but the recent posts warning to not buy from them has me concerned.\n\nI'd like to use this computer to play the new expansion with WoW at 1440p@60fps at least on max settings.  From my understanding it's a CPU intensive game but the Ryzen 3600 should be up to the task (at least from Battle for azeroth standards)\n\nThank you everyone in advance and apologies in advance if I broke any of the rules!"], "2020-10-15": ["Hi guys, I have F1 2018, but I'm playing on an old machine running windows 8.1 64 bits, and AMD just ended support for drivers for 8.1 and I'm stuck on old drivers. F1 2018 has that pixeled black square skybox glitch and the car's texture are all white washed as well, so it a no no for me sadly.\n\nWhich old F1 game should I buy then?\n\nF1 2012, F1 2014 or F1 2016?"], "2020-10-16": ["Does Lenovo have better deals during Black Friday on their website?"], "2020-10-17": ["This is not a thread asking for help. I'm not looking for tech support. I'm curious if AMD has talked about the Radeon Software.\n\nI uninstalled it and left the drivers for my 5700xt intact. All the little quirks, random crashes. Everything wrong. Gone. Poof. Gone just like that.\n\nAre they fixing it? Scrapping it and starting over? The GPU is performing better without it installed. How the hell are they allowing this? I am very much considering a nVidia GPU next time. I've always gone with and recommended them for someone on a budget or who doesn't want the best of the best. Not sure I can do that anymore."], "2020-10-18": ["[removed]"], "2020-10-19": ["I’m looking to replace the charger for my laptop. Wheres the best and cheapest I could get it ? Or a multi charger that would work on my laptop?\n\nLenovo - IdeaPad 1 14\" Laptop - AMD A6-Series - 4GB Memory - AMD Radeon R4 - 64GB eMMC Flash Memory - Platinum Gray"], "2020-10-20": ["Good day to you all.\n\nI bought a prebuilt pc some years ago, and it have served me well, but it has started lagging like crazy sometimes and even going full chop chop for like 2 whole seconds, where the whole pc goes down to 2 fps, but the thing is that it's not just the fps, it's the whole pc, sound and everything.  \nThat said, I need an upgrade. My budget isn't large right now, but anything goes as I'm saving.   \nI just wanna be able to play for example Apex without it running at 45fps.   \nMy specs are:  \nGPU: NVIDIA GeForce GTX 1060-3GB   \nCPU: AMD Ryzen 5 1400 quad-core  \nRAM: 8GB Crucial Technology DDR4 @ 2 128 MHz - x2  \n\n\nI'm not sure what needs to be upgraded but it seems that the processor is at fault. I have previously thought that the graphics card was to be upgraded first, but have later found out that it might be somewhat alright.(?)  \nI heard that the AMD Ryzen 5 3600 is supposed to be good but would like some more info about it.\n\n  \n3D-Mark Time Spy statistics and specs if I missed something.   \n[https://www.3dmark.com/spy/14665706](https://www.3dmark.com/spy/14665706)  \nIf it's not in here I'll do my best to provide the info.  \nThank you."], "2020-10-21": [""], "2020-10-22": ["I currently run an AMD Ryzen 5 2600X Six-Core Processor, 16GB RAM, 650W PSU, and an NVIDIA GeForce RTX 2060. If I wanted to replace my 2060 with a 3070 would I need to upgrade any of my other pc parts?"], "2020-10-23": ["&amp;#x200B;\n\nhttps://preview.redd.it/vt88r0fbnru51.jpg?width=2304&amp;format=pjpg&amp;auto=webp&amp;s=a12763596dacd19358ddf25ef1aa7079a8091587"], "2020-10-24": ["So ive been best friends with this girl since 2nd grade, back then we liked each other but being in grade 2 it didnt go anywhere. We stayed close and talked to each other a lot, at the end of grade 2 she moved to a different school and kinda fell out of contact for the year, during grade 4 she came back and sadly it was really akward and with all her friends swarming her and mine swarming me we i was to scared to talk with her. After grade 4 she moved again and same story we still talked but not as much as in grade 2. I met a boy named tony and we instantly hit it off, and turns out he was close friends with her (he is now my best friend) this more than rekindled me amd her friendship, we talked but we still didnt get to see each other. Now um in my first year of highschool (grade 8) and me and my bsf and her talk together a lot, so me amd her start talking and texting a lot and slowly i started calling her \"luv\" as a joke (😂 i at the time was fanboying captin price) and after a while she started too, i had a hunch that she liked me but didnt want to ruin our friendship, when i told my best friend about this he asked \"well do you like her back?\" And at that moment i realised that i did, later that day she confessed and i also did. She goes to a different school than me still, and today our district had a pro d day (basically students get the day off, while the teachers have meetings and stuff) and we dicided to meet w the bsf and her, we had a great time just hanging out. When she had to leave for class (she does gymnastics) (i do jiu jitsu and volleyball) we were walking to the exit of the mall and i nudged her hand with mine and we started holding hands, my bsf being then type he is led the rest of the group away, letting us just be alone for a bit, then after we were at the exit i hugged her goodbye. Even this small day at the mall has made my entire week, really happy that my life is turning out this way atm.\n\nSorry for the poor formatting, as this was done on my phone\n\nThank you readers for reading my small rant"], "2020-10-25": [""], "2020-10-26": ["I separated from my wife 2yrs ago and share 50/50 custody of my kids. I worked from home for 16 years and in January got a job to get out of the house, see people face to face and have stability in a real job, 10/10 life is great. \n\nTwo months in Covid hit and I was forced to work from home but I was at least thankful I had a job. Mentally I was drained from being inside for so many years but what's another year or two? That is until I lost my job two weeks ago because of  cutbacks. \n\nKids went back to school in september and since have been home with cold symptoms for what seems like every week. Hell my youngest had diarrhea all this weekend, I spent mine washing sheets and cooking. I feel trapped in my home, jobless, single dad and feeling about as low as I've been. Someone always has it worse, I know that but life just feels so hard right now and I never tell anyone that. I am not mad, not angry, just feel like I'm suddenly failing amd when it rains it pours."], "2020-10-27": [""], "2020-10-28": ["[AMD's Where Gaming Begins: Ep 2 event](https://www.amd.com/en/events/gaming-2020) starts in exactly 12 hours!\n\n# [Watch the Youtube Premiere here](https://www.youtube.com/watch?v=oHpgu-cTjyM).\n\n**All standalone posts about the new 6000 series GPUs will be removed. Information will be compiled in a pinned comment below.**\n\n# [Discuss on our Discord server](https://discord.gg/sffpc)."], "2020-10-29": ["stuck between which one to get. I do a lot of video editing on sony vegas and adobe premier, along with light to medium gaming on 1080 144hz. GPU is an rx580. I did have a 3700x that I used for a week but there was still lag/choppiness while editing, so that’s why i’m asking about a 5900x vs 5800x, since the 5800x has the same cores/threads. \n\nthanks"], "2020-10-30": ["So essentially I am looking at 3 things to potentially purchase\n\n1: I currently have a [Ryzen 5](https://www.newegg.com/amd-ryzen-5-3600/p/N82E16819113569?Description=ryzen%205&amp;cm_re=ryzen_5-_-19-113-569-_-Product&amp;quicklink=true) CPU in the build but since I stream, I've noticed some issues with CPU usage when live. Should I make the full jump to the [Ryzen 9](https://www.newegg.com/amd-ryzen-9-3900x/p/N82E16819113103)?\n\n2: I have a [GeForce RTX 2060 Super](https://www.bestbuy.com/site/nvidia-geforce-rtx-2060-super-8gb-gddr6-pci-express-graphics-card-black-silver/6361329.p?skuId=6361329), should I make the jump up to the [3070](https://www.microcenter.com/product/630702/zotac-geforce-rtx-3070-twin-edge-overclocked-dual-fan-8gb-gddr6-pcie-40-graphics-card)? (This purchase would happen once available)\n\nand\n\n3: I have 32 GB of [G.Skill Aegis](https://www.newegg.com/g-skill-16gb-288-pin-ddr4-sdram/p/N82E16820232884?Item=N82E16820232884) (4x8) DDR4 RAM but am getting tempted by my cooling system to add RGB there. I'm looking at the [Corsair Vengence RGB Pro](https://www.amazon.com/CORSAIR-Vengeance-3200MHz-Desktop-Memory/dp/B07D1XCKWW/ref=sr_1_5?_encoding=UTF8&amp;c=ts&amp;dchild=1&amp;keywords=Computer+Memory&amp;qid=1604029327&amp;refinements=p_89%3ACorsair&amp;rnid=2528832011&amp;s=pc&amp;sr=1-5&amp;ts_id=172500) to replace these sticks (even swap 4x8 for 4x8). This is more frivolous and for aesthetic and otherwise not needed unless the performance would greatly improve. \n\n&amp;#x200B;\n\nComplete Build [here](https://pcpartpicker.com/user/thebrotherbear/saved/) in case you want to give any other suggestions. I built this in January and like how it runs, but it was my first build and anticipate some changes to be made before it'll be a long haul PC."], "2020-10-31": [""], "2020-11-01": ["lot of trash talk about Red Vs Green... lets admit it. blue is just sitting in the corner over there eating glue... but yea. no 1 brand is definitively better than the other RN. NVidia can't supply and AMD hasn't released yet. if the number for AMD are true than great! NVidia got some competition. its been a while since AMD put anything out that surpassed the 1080ti. 4 1/2 year old card at this point. competition is nice! it pushes the other side to innovate and push limits.  if the benchmarks do turn out to be true and a $1000 card beats a $1200 card that's a close match. lets just hope if there is a price drop shortly that i can get the difference on my already purchased 2080. glad to see an AMAZING Gaming performance around the board kind of year! even if the launches are a little rough. hopefully things will smooth out for 2021!"], "2020-11-02": ["Hopefully upgrading to a new AMD card this month just wondering on a price check for this :("], "2020-11-03": [""], "2020-11-04": ["    Hey Choombas\n\nDuring Night City Wire Episode 3, CD Projekt Red announced the minimum and recommended specifications to run Cyberpunk 2077 on your PC. They are as follows:\n\n[SOURCE - C:\\\\cp77\\\\hardware\\_requirements.info](https://www.cyberpunk.net/en/news/36194/c-cp77-hardware-requirements-info)\n\n[IMAGE LINK](https://i.imgur.com/A7TGGzV.png)\n\n|PC COMPONENT|MINIMUM (1080p Low)|RECOMMENDED (1080p High)|\n|:-|:-|:-|\n|OS|64-bit Windows 7 or 64-bit Windows 10|64-bit Windows 10|\n|DIRECTX VERSION|DirectX 12|DirectX 12|\n|PROCESSOR|Intel Core i5-3570k or AMD FX-8310|Intel Core i7-4790 or AMD Ryzen 3 3200G|\n|MEMORY|8 GB|12 GB|\n|GRAPHICS CARD|NVIDIA GeForce GTX 780 3GB or AMD Radeon RX 470|NVIDIA GeForce GTX 1060 6GB or AMD Radeon R9 Fury|\n|STORAGE|HDD (70 GB), SSD recommended|SSD (70 GB)|\n\n*PC audio solution containing Dolby Atmos required for a Dolby Atmos experience*\n\nPlease use this thread to ask any questions regarding building or upgrading your PC to run Cyberpunk 2077. It will be reposted on a weekly basis and all threads regarding building a PC will be removed and redirected here."], "2020-11-05": [], "2020-11-06": ["So here is my situation.\n\nMy CPU is a goner. It’s an old 2012 AMD CPU and it just passed away a few days ago. Fortunately it died at an opportune time, as the new AMD CPUs were just about to come out. So yesterday morning I ordered the new Ryzen 5 5600X CPU.\n\nMy motherboard is also old and thus not compatible, so I will be buying a new one. I plan on buying [this](https://www.amazon.com/ASUS-i7-9750H-GeForce-Backlit-Keyboard/dp/B081PZTZ4B) motherboard to go along with my CPU.\n\nWhat I’ve heard is that some motherboards may require BIOS updates to work with the new AMD CPUs. But I don’t have a functioning CPU, so I can’t use my PC without the new CPU, which may not work with the motherboard.\n\nSo, can anyone tell me if I will need to update the motherboard or if it’ll come ready for use with the 5600X? Because I’ll be in a pretty tricky situation if it needs an update."], "2020-11-07": ["I just finished putting together my new custom pc, it turns on it goes into bios and it says everything is working fine. i marked down everything i could find that was working, the following\n\nCpu\n\nFans\n\nGPU\n\nSSD\n\nRAM (in the correct places)\n\nPower supple\n\nthe only thing i didnt see was harddrive, im new to this but i followed a linus pov step by step and i made sure i did everything right. but after like a minute of usage in bios or just anywhere it just shuts restarts. my mouse, my keyboard everything goes dark, i tried to see what the problem was everywhere, i really need help right now with this, i spent so much money trying to piece this together it took me like 6 paychecks. but here is my list\n\nMSI b550 motherboard bazooka\n\namd ryzen 5 3600 3.6 hz\n\n2060 msi gpu xs\n\nG skill ripjaw 2x8 ram\n\n550 watt psu\n\n&amp;#x200B;\n\nI really need help with this. also since i was writing this i've noticed that it is able to stay on for a long period of time while trying to download windows, but as soon as  i go to decide where to download windows on it just shuts off"], "2020-11-08": ["hey guys, i dont know much about the different types of air cooling systems available but im looking if anyone that can recommend a good air cooler for overclocking with somewhat decent ram clearance. noise is not a concern since i already have two 3000 RPM  fans that run at 43 dB each."], "2020-11-09": ["First pc build. I just assembled everything, but am still missing the cpu and gpu (waiting for the new amd drops). \n\nCould I still turn it on and see if everything works, lights up, and is wired correctly? Would this do any damage?"], "2020-11-10": ["CPU - AMD Ryzen 9 5900X (12Core/24 Threads/3.7ghz-4.8ghz/AM4)\n\nCOOLER- CORSAIR Hydro H100i RGB PRO XT (240L)\n\nMOBO - GIGABYTE Z490 AORUS Elite AC(ATX/VRM 12+0/4xDDR4 5000/CF/6X Sata/2xM.2/WIFI6+BT5.1/ARGB+RGB)\n\nRAM - GSKILL TridentZ ROYAL Silver RGB 2x8GB DDR4 3600mhz(F4-3600C18D-16GTRS)\n\nGPU - GIGABYTE Geforce RTX3080 Gaming OC 10GB DDR6X (1800/19000)\n\nPSU - CORSAIR RM850X-850 Watt 80 PLUS Gold Certified Fully Modular PSU(10 Years Warranty)\t\n\nCASE - COOLERMASTER MasterBox TD500 Mesh With ARGB Black\n\nSSD - XPG SX8200 PRO M.2 PCIE GEN3x4 512GB SSD(3500/3000)\n\nHDD - WD 1TB Caviar Blue 7200RPM/64MB\n\n&amp;#x200B;\n\nThis is my very first build and I'm hoping that I can at least maintain a good fps on 2K 144hz monitor on most of the games while streaming.\n\nI have not decide on the monitors yet, but most probably a 2K monitor with 144 Hz, does anyone have a good monitor recommendation for this build?\n\nOr if anyone have anything to say to this build for my needs?"], "2020-11-11": ["    Hey Choombas\n\nDuring Night City Wire Episode 3, CD Projekt Red announced the minimum and recommended specifications to run Cyberpunk 2077 on your PC. They are as follows:\n\n[SOURCE - C:\\\\cp77\\\\hardware\\_requirements.info](https://www.cyberpunk.net/en/news/36194/c-cp77-hardware-requirements-info)\n\n[IMAGE LINK](https://i.imgur.com/A7TGGzV.png)\n\n|PC COMPONENT|MINIMUM (1080p Low)|RECOMMENDED (1080p High)|\n|:-|:-|:-|\n|OS|64-bit Windows 7 or 64-bit Windows 10|64-bit Windows 10|\n|DIRECTX VERSION|DirectX 12|DirectX 12|\n|PROCESSOR|Intel Core i5-3570k or AMD FX-8310|Intel Core i7-4790 or AMD Ryzen 3 3200G|\n|MEMORY|8 GB|12 GB|\n|GRAPHICS CARD|NVIDIA GeForce GTX 780 3GB or AMD Radeon RX 470|NVIDIA GeForce GTX 1060 6GB or AMD Radeon R9 Fury|\n|STORAGE|HDD (70 GB), SSD recommended|SSD (70 GB)|\n\n*PC audio solution containing Dolby Atmos required for a Dolby Atmos experience*\n\nPlease use this thread to ask any questions regarding building or upgrading your PC to run Cyberpunk 2077. It will be reposted on a weekly basis and all threads regarding building a PC will be removed and redirected here."], "2020-11-12": ["So I am planning to water cool for my new system and I pretty much know what to do for the build but I am still unsure what fittings and tubes I should use for the build. I will be doing hard tubing, I know that it is not recommended for new beginners but I won't be doing any bends but instead using 90 degrees fittings \n\n\\-Li Lian 011 dynamic 011 XL\n\n\\-Optimus Foundation CPU block (AMD)\n\n\\-Optimus Absolute GPU block (Expensive I know but I fell in love when gamer nexus showed it) \n\n\\- EK-Quantum Reflection PC-O11D XL\n\n\\- EK-CoolStream PE 360\n\n\\- EK-CoolStream XE 360\n\nso this build is pretty unnecessary but I fell in with the Li Lian 011 and the reservoir for it, I thought it was dope. \n\nI know that tube size doesn't matter much but I have heard that is it recommended to get the fittings and tubes from the same brand\n\nI live in the US\n\nNotes:\n\n\\*I know that Bitspower is the best one but it is quite expensive\n\n\\*Barrow is the cheaper Bitspower\n\n\\*EKWB fittings are alright but in the past fittings were pretty bad and tainted their name for it."], "2020-11-13": ["After a recent update, the login screen stopped showing up after boot. systemctl status sddm gave the following output:\n\n    ● sddm.service - Simple Desktop Display Manager\n         Loaded: loaded (/usr/lib/systemd/system/sddm.service; enabled; vendor preset: disabled)\n         Active: active (running) since Fri 2020-11-13 09:54:46 IST; 1min 10s ago\n           Docs: man:sddm(1)\n                 man:sddm.conf(5)\n       Main PID: 519 (sddm)\n          Tasks: 2 (limit: 19072)\n         Memory: 22.4M\n         CGroup: /system.slice/sddm.service\n                 └─519 /usr/bin/sddm\n    \n    Nov 13 09:54:46 arch sddm[519]: Initializing...\n    Nov 13 09:54:46 arch sddm[519]: Starting...\n    Nov 13 09:54:46 arch sddm[519]: Logind interface found\n    Nov 13 09:54:46 arch sddm[519]: Adding new display on vt 1 ...\n    Nov 13 09:54:46 arch sddm[519]: Loading theme configuration from \"\"\n    Nov 13 09:54:46 arch sddm[519]: Display server starting...\n    Nov 13 09:54:46 arch sddm[519]: Adding cookie to \"/var/run/sddm/{7fb93d4a-04d3-41ac-add7-a31803d28ffd}\"\n    Nov 13 09:54:46 arch sddm[519]: Running: /usr/bin/X -nolisten tcp -auth /var/run/sddm/{7fb93d4a-04d3-41ac-add7-a31803d28ffd} -background none -noreset -displayfd 17 -seat seat0 vt1\n    Nov 13 09:54:46 arch sddm[519]: Failed to read display number from pipe\n    Nov 13 09:54:46 arch sddm[519]: Could not start Display server on vt 1\n\nWhen I do systemctl restart sddm, it starts fine, but now kde doesn't detect audio devices automatically, not sure if it is related to this.\n\nI have a hybrid intel and amd radeon 530 graphics and I am using the default opensource drivers.\n\nPlease let me know how to fix, thanks."], "2020-11-14": [" Almost 70% of my relationships has been one form or another of gut wrenching abuse. And it explains the lengths i had to go with NO help and being sucked dry. When i acknowledged the mindfuck in the relationships and control issues ive been through, i look back and say holy shit i could write it out and get it off my chest...Because now i see that i have a history or pattern for falling for abusers. Or i somehow have a target on my back. I feel indebted to having reddit for being able to speak the truth in black and white, albeit years later. This happened between a span of 2 years in 2014-2016. In every situation i was in I felt excruciatingly hopeful and helpless, like if you were drowning and was hoping someone would reach in from above and pull you to the surface for air. Every step i take to heal is painfully slow and fast at the same time. He was a mistake but a good story. It all sounds exaggerated however its not flared with exaggerations. If anything, I am only summarizing so the emotional turmoil and events that lead up before and the following lash outs aren't fully described. Only the hard events remain in the memory bank. I'm so emotionally wrecked that i haven't been able to to eat properly for days except for small light snacks periodically to satisfy the slight hunger due to currently being in an abusive situation and working on getting out appropriately. So without further adieu, heres my story. \n\nI met him through a friends get together and we instantly hit it off. I was seeing someone at the time but i felt that he was 'the one'. It was magical when we sat outside leaving the stifling atmosphere and drunkenly talked for hours until the sun rose. That's how i met him. Then the talk came around him living by himself and that he was embarrassed with his place because it was baaad and admitted that he needed help.\nIt was disgusting! He really needed my help! He was charming and witty and i fell for him so i ended up breaking up with the other guy i was with.\nI cleaned the place when we first dated. He said he needed help and i said i was gonna help so i did. I was eating takeout at his place one time before the clean and one roach crawled into the food when it was placed on the floor, still in the bag.\n\n I pulled out approximately 48 pizza boxes hidden in the closet alone, some with slices still intact and petrified, always covered in a swarm of roaches. It may have been more as there were stacks under the futon and in various other places.\n\nI cleaned and killed like the dickens, traps everywhere filling up before you could blink twice. He was and probably is still living with a massive amount of cockroaches in the apartment, if he ever moved out. He was living with a broken sink for 4 years before i showed up. He was afraid to tell the landlord. I coaxed him into telling the landlord and got it fixed immediately. He periodically used the bathtub to wash his hands, if he ever bothered. He almost never used toilet paper, just a watering can. \n\n He had wine bottles and booze cans and liquor bottles hidden everywhere. I think it came out to approximately 120$ or more of empties. I wanted to return them myself because i needed money. I was planning on carrying approximately 10$ a day on my back and buggy and bring them to the beer store 6 blocks away. They ended up being taken from me behind my back from his mother, given to a lady in a different unit because she had a car, saying \"shes less fortunate, she needed it more. His mother comes into the story later on. I was almost flat broke at the time, struggling to find a job. \n \nHe barely showered and i did too at one point later in the relationship to just chameleon or understand his situation. We cared for each other at the time and he gave me a key to his place. \n\nThis guy drank a lot. He would work from home and sling back a 1.5L wine during work. It was a cup at first and escalated the longer i lived in his place.\nHis attitude changed over time. He became a bully, possessive, aggressive, and i always felt that he distanced himself constantly in his computer gaming. I couldn't join because he only had one pc so i had to cook or continue cleaning or take care of the puppy i brought into the place, which was before we started dating. I picked, paid, and covered 100% of her vet bills beside walking her constantly. I took her everywhere, even to the dteak house he brought me to, hidden in a bag. We were smokers and i felt like i had fallen into a spiral of chain smoking, always having to have a smoke between my fingers to distract myself.\n\nHe would force me awake in the middle of the night to cook for him, especially on days i had to work and only had less then 5 hours to myself when i walked through the door till i had to leave. He kept me confined in the bedroom while he worked. Verbally attacked me for being in the space topless. I had to \"warn\" him if i stepped out of the room. \n\n I made beautiful artwork and i hung it as a mosaic of various photographs and drawings and paintings on the wall. He trashed my artwork on new years after an argument. It was over a McDonald's order, when he grabbed the wrong one when drunk. After the trashing he then forced me to sleep in the same bed beside him that night i was breaking and terrified. I gave him chances and almost broke up, his sweet words of promise the next day kept me wary but still in the picture. \n\nThen his mom came to visit from dubai. Basically he wanted me in the place for my expedited services to clean the nesting pigeons off his balcony, roaches, garbage debris, etc. For the weeks i cleaned, she showed up and scoffed at the clean up i did which compared to her cushy dubai apartment, was not enough. She hired another person in the apartment to clean, which they didnt really do much except wash the curtains and random sweeping after i swept. She paid them to sit in the laundromat. She thanked this random woman amd gave her approx 1,000$. To me, a random scarf she got at the gift shop at the airport. \nThen the pork incident happened. \nWhile she was over we went out for breakfast and i brought mine back. It had bacon but i ate it all and couldnt finish it. She had a weird habit of trying to dispose of the metal cutlery. I politely asked her not to after i finished my meals. My half eaten breakfast was in the fridge with no bacon in sight. When i had my back turned, she threw out the food and bowl whole but left the cutlery in the sink. I fished it out of the garbage and asked why. She said it had pork so she tossed it but kept the fork like if it was the unwritten rule of a passive aggressive statement. She stuttered something about religion and i laughed and said her son eats pork all the time. How dare she feels entitled to throw out other peoples belongings without consent. She tried to give an excuse and i laughed. She humphed and declared i could not live there with her. Her son conceded and basically kicked me out to keep the peace since i could stay at my parents place. I found out he shit talked about me to his parents. Let his mom verbally abuse me. After she left, i was with my parents on a short trip. He cheated on me. I found the condom in the bed behind the pillow, which i confronted him with it. He said his friends stayed over and had hanky panky. I was close to my breaking point. He got me knocked up at some point so i got an abortion. He manipulated his words that i had to stay with him at a crucial point in time with my fathers illness. Belittled the time i had left with my dying father. My dad died soon after. Then blamed me for making those choices and that i made that decision and acted on it. I broke down. I broke up with him. \n\nHe threatened suicide so i let him hold onto the dog which he refused first, since he wouldnt kill himself if the dog had to be taken care of, right? Wrong. He registered her to the city of toronto behind my back and made sure to do stupid vet visits to get paperwork. Then called the cops to try to get a restraining order. Of course he was denied but because he called first i had to take him to court to prove it. I had no money. He spent it behind my back. I lost my job from battling and recovering from a extreme case of chronic dermatitis which made me walk like an old person because when i took a step all my joints would rip and bleed and cause open sores. My skin would adhere to clothing or bedsheets, ripping my skin right off, infusing to the cloth when i woke up in the morning. I used all my sick days and i was late because walking to the subway to work took agonizing steps. They didnt like me using the medical bandages to wrap my skin when it was too painful to move. My skin looked like i came back from vacation, dark and peeling, so no one took me seriously. To this day the false claim i had was streppococcous bacterium on the skin. He just gave me some steroids to speed up the recovery process and ignored me after that. In the future i had to visit the hospital 3 more times to get treated for this.\n\n He stole my dog. Then, with my stuff still in the place, he got a new girlfriend to move in a week later. I had to get the cops to stand guard while he shuffled my stuff into the hallway. I could not go in to recover things afterwards, just tell them verbally through the hallway what was missing in my memory recollection. \nWhen i went i would never see the dog or hear her. He took her to his friends apartment if i was ever around, which i did not know the location to. \nPhysically sick, emotionally broken and abused, grieving, loss of my only pet, loss of my two years of life, dazed, etc. All of this was happening. My friends barely was around to help since he alienated them from me. I dont think there was help lines available to me at the time. I had no voice. Only my single mother and brother. I have no relatives. \n\nAbuse right? Good ol past."], "2020-11-15": ["[removed]"], "2020-11-16": ["I am only looking to upgrade one thing on my PC. I have the Ryzen 7 3700X and the RTX 2070. I exclusively play CPU-heavy games, such as R6: Siege, Escape From Tarkov, Squad, and other cpu-heavy titles. Which of the two would see a more suitable upgrade for the price point? All the games I play rely on single-core performance and do not fully utilize all the threads my cpu has to offer. That being said, I've read very good things about the ampere technology and am wondering if the improvement would be a bigger difference and justify more $ spent. I’m not reaching a gpu bottleneck as I typically turn settings down for maximum fps in games, I try to shoot for performance.\n\nAMD Ryzen 7 3700X → AMD Ryzen 5 5600X\n— $300 + price of new mobo\n\nRTX 2070 → RTX 3070\n— $500 + price of PSU  \n\nEveryone is going nuts over the 3070 and it feels like only enthusiasts are talking about the cpus. After playing the games I do, I feel as if single-core is important but benchmarks for 3070 look insane. What do you guys think?"], "2020-11-17": [""], "2020-11-18": ["    Hey Choombas\n\nDuring Night City Wire Episode 3, CD Projekt Red announced the minimum and recommended specifications to run Cyberpunk 2077 on your PC. They are as follows:\n\n[SOURCE - C:\\\\cp77\\\\hardware\\_requirements.info](https://www.cyberpunk.net/en/news/36194/c-cp77-hardware-requirements-info)\n\n[IMAGE LINK](https://i.imgur.com/A7TGGzV.png)\n\n|PC COMPONENT|MINIMUM (1080p Low)|RECOMMENDED (1080p High)|\n|:-|:-|:-|\n|OS|64-bit Windows 7 or 64-bit Windows 10|64-bit Windows 10|\n|DIRECTX VERSION|DirectX 12|DirectX 12|\n|PROCESSOR|Intel Core i5-3570k or AMD FX-8310|Intel Core i7-4790 or AMD Ryzen 3 3200G|\n|MEMORY|8 GB|12 GB|\n|GRAPHICS CARD|NVIDIA GeForce GTX 780 3GB or AMD Radeon RX 470|NVIDIA GeForce GTX 1060 6GB or AMD Radeon R9 Fury|\n|STORAGE|HDD (70 GB), SSD recommended|SSD (70 GB)|\n\n*PC audio solution containing Dolby Atmos required for a Dolby Atmos experience*\n\nPlease use this thread to ask any questions regarding building or upgrading your PC to run Cyberpunk 2077. It will be reposted on a weekly basis and all threads regarding building a PC will be removed and redirected here."], "2020-11-19": ["Hi, I have a code for Godfall [(epic store link)](https://www.epicgames.com/store/en-US/product/godfall/home) that I got through AMD rewards. You do not need a AMD GPU to download, I've already verified the GPU. The game is $60 on the Epic store, so I think $45 (+ Paypal fees) is a fair ask."], "2020-11-20": ["I tried to install Debian (with netinst iso), and everything seemed to work until I tried to boot into it. I'm trying to use Gnome, and it's installed on my nvme drive without LVM\n\nGrub worked, the loading \\[  OK  \\] screen worked fine. but then it went to a blank screen with a blinking text cursor. I couldn't type anything. I left it for about a half hour, and nothing happened.\n\nIt's my first time installing Debian. I only turned to it because I was sick of Arch breaking all the time.\n\nI've got an AMD CPU, and Nvidia GPU, and an MSI Motherboard if it helps."], "2020-11-21": ["So I've managed to get my greasy mitts on a 3080 and now need the rest of the bits to go around it. It's been about 8 years since I've built a rig and as such I'm real behind on current tech. I'm aiming for 1440p/144hz gaming, and think I've got a pretty decent list put together but I may be vastly overestimating my acumen. \n\nFor instance, I am pretty in the dark on the current Intel vs AMD CPU situation, and have only a cursory knowledge of NVME storage and how well having two of them on this motherboard will work. I'm not trying to get absolute bleeding edge at all cost performance, just a reasonably high end setup - preferably one that I don't have to use stockdrop discords and irresponsible use of F5 to procure the other components for. \n\nLemme know if this seems like a reasonable list, or if I'm really dropping the ball on any components. I'm guessing this is a pretty standard build, so I'm hoping I'm in the clear to pull the trigger on the rest of the parts in the next day or so.\n\n[PCPartPicker Part List](https://pcpartpicker.com/list/BY9zPV)\n\nType|Item|Price\n:----|:----|:----\n**CPU** | [Intel Core i7-10700K 3.8 GHz 8-Core Processor](https://pcpartpicker.com/product/yhxbt6/intel-core-i7-10700k-38-ghz-8-core-processor-bx8070110700k) | $369.99 @ Newegg \n**CPU Cooler** | [Noctua NH-D15 82.5 CFM CPU Cooler](https://pcpartpicker.com/product/4vzv6h/noctua-cpu-cooler-nhd15) | $89.95 @ Amazon \n**Motherboard** | [Asus ROG STRIX Z490-E GAMING ATX LGA1200 Motherboard](https://pcpartpicker.com/product/J9PgXL/asus-rog-strix-z490-e-gaming-atx-lga1200-motherboard-rog-strix-z490-e-gaming) | $285.39 @ Amazon \n**Memory** | [\\*Team T-FORCE VULCAN Z 32 GB (2 x 16 GB) DDR4-3200 CL16 Memory](https://pcpartpicker.com/product/TLvbt6/team-t-force-vulcan-z-32-gb-2-x-16-gb-ddr4-3200-memory-tlzgd432g3200hc16cdc01) | $94.99 @ Newegg \n**Storage** | [Crucial P1 1 TB M.2-2280 NVME Solid State Drive](https://pcpartpicker.com/product/pxKcCJ/crucial-p1-1tb-m2-2280-solid-state-drive-ct1000p1ssd8) | $93.99 @ Amazon \n**Storage** | [Crucial P1 1 TB M.2-2280 NVME Solid State Drive](https://pcpartpicker.com/product/pxKcCJ/crucial-p1-1tb-m2-2280-solid-state-drive-ct1000p1ssd8) | $93.99 @ Amazon \n**Video Card** | [EVGA GeForce RTX 3080 10 GB XC3 GAMING Video Card](https://pcpartpicker.com/product/VfbCmG/evga-geforce-rtx-3080-10-gb-xc3-gaming-video-card-10g-p5-3883-kr) |-\n**Case** | [Fractal Design Meshify C ATX Mid Tower Case](https://pcpartpicker.com/product/Y6Crxr/fractal-design-meshify-c-atx-mid-tower-case-fd-ca-mesh-c-bko-tg) | $95.99 @ B&amp;H \n**Power Supply** | [\\*EVGA 750 W 80+ Gold Certified Semi-modular ATX Power Supply](https://pcpartpicker.com/product/rt8H99/evga-power-supply-210gq0750) | $119.94 @ Office Depot \n**Monitor** | [LG 27GL850-B 27.0\" 2560x1440 144 Hz Monitor](https://pcpartpicker.com/product/6XPgXL/lg-27gl850-b-270-2560x1440-144-hz-monitor-27gl850-b) | $496.99 @ Amazon \n | *Prices include shipping, taxes, rebates, and discounts* |\n | **Total** | **$1741.22**\n | \\*Lowest price parts chosen from parametric criteria |\n | Generated by [PCPartPicker](https://pcpartpicker.com) 2020-11-20 23:40 EST-0500 |"], "2020-11-22": ["###Troubleshooting Help:\n\n**What is your parts list? [Consider formatting your parts list.](http://www.reddit.com/r/buildapc/wiki/pcpp)**\n\nCPU - AMD Ryzen 9 3900x\nCPU Cooler - Corsair H100i 240mm\nMotherboard - Asus Crosshair Hero VIII (WI-FI)\nMemory - Corsair Vengeance Pro 3200hz\nStorage - Samsung 970 evo m.2 1tb\nStorage - Samsung 860 evo sata 1tb\nVideo Card - Gigabyte 2070 Super White\nCase - Corsair 680x Crystal\nPower Supply - Corsair 850w White\n\n**Describe your problem. List any error messages and symptoms. Be descriptive.**\n\nRecently installed corsair premium pcie 3.0 x16 riser cable, noticed a fast orange blinking hd led on my motherboard. The blinking pattern was very fast and random with no consistent pattern. However the Q-Code was 40 which has me thinking the motherboard may just be seeing my riser cable as an anomaly.\n\n**List anything you've done in attempt to diagnose or fix the problem.**\n\nMade sure all hardware components were detected, all drivers up to date, latest bios update, all psu cables were connected properly.\n\n**Post relevant photos of build/parts here.**\n\nReplace this text with your answer.\n\n**Provide any additional details you wish below.**\n\nReplace this text with your answer."], "2020-11-23": ["Discuss today's $AMD news and stock expectations."], "2020-11-24": ["So yeah yeah indeed, huge woopi I'm home again quarentined and drinking and it's still 2020 and this year just won't end while half my closet is filled with components cos I'm a huge dumbass and couldn't read the room and decided to build a mew computer like everyone else like even liytle Timmy's doin cos Xbox aint enough and fuq it I like staring at 3k worth of cardboard like evwryone else and gimme that new tech just kidding make me wait for it and I'll mash f5 and I'll wait in lines taking shits in back alleys behind m center  in the cold and maybe they have three chips on launch while I'm 35 in line and I know I'm fuqed already but stand there breathin in covid with the rest of em amd now everything is bot this bot that scalp hairy bastards bullshit its all ober and done but I'll get my backorder in March maybe if this covid doesnt get me first.\n\nStay safe you all. Love you."], "2020-11-25": ["This is my first gaming pc here is my quote $3k. Need some opinions/advice.\n\nMotherboard: AMD X570 AM4 Gaming Motherboard\nCPU: AMD 4th Gen Ryzen 9 5900X 12 Cores/24 Threads Desktop Processor\nCPU COOLER: ID Cooling 240mm AIO RGB CPU Liquid Cooler\nGPU: Gigabyte RTX 3080 10GB Ampere 4K/8K Graphics Card\nPower Supply: 1000 Watts 80+ Gold Certified Power Supply\nRAM (Memory): G.Skill Trident Z 32GB (2x16) 3200MHz DDR4 Desktop Gaming Memory\nSSD: SP 1TB M.2 NVME PCI-Express Internal SSD\nHDD: Hitachi Enterprise 1TB 7200RPM Drive\nCase: Mustex Tempered Glass Full Tower Case\nFans: High performance low noise cooling case fans\n600 Mbps Dual Band Wireless\n\nOS: Windows 10 Pro licensed and activated.\nMicrosoft Office 2016 Professional licensed and activated."], "2020-11-26": ["I'm tryin to update the AMD driver, but every time I get an error, idk what to do, pls help"], "2020-11-27": ["This is my first built PC.\nI wonder if the list is ok or needs some improvements.\n\nPCPartPicker Part List: https://pcpartpicker.com/list/vdWYXb\n\nCPU: AMD Ryzen 9 5900X 3.7 GHz 12-Core Processor \nCPU Cooler: Noctua NH-C14S 82.52 CFM CPU Cooler  ($74.98 @ Amazon) \nMotherboard: Asus TUF GAMING X570-PLUS (WI-FI) ATX AM4 Motherboard  ($169.99 @ Newegg) \nMemory: G.Skill Ripjaws V 64 GB (2 x 32 GB) DDR4-3600 CL18 Memory  ($224.99 @ Newegg) \nStorage: Sabrent Rocket Q4 1 TB M.2-2280 NVME Solid State Drive  ($159.99 @ Amazon) \nVideo Card: ASRock Radeon RX 6800 16 GB Video Card \nCase: Fractal Design Meshify C ATX Mid Tower Case  ($77.98 @ Newegg) \nPower Supply: Corsair RMx (2018) 750 W 80+ Gold Certified Fully Modular ATX Power Supply  ($119.99 @ Newegg) \n\nI know I need to wait for the GPU and CPU.\nThanks"], "2020-11-28": ["I'm a university student (biochemistry) looking for a good laptop to last me, found two options but can't seem to figure out which is more worth while between the [HP Envy x360](https://www.bestbuy.ca/en-ca/product/hp-envy-x360-13-3-touchscreen-2-in-1-laptop-nightfall-black-amd-ryzen-5-4500u-256gb-ssd-8gb-ram-windows-10/14538550) or the [surface pro 7](https://www.bestbuy.ca/en-ca/product/microsoft-surface-pro-7-12-3-128gb-windows-10-tablet-with-10th-gen-intel-core-i5-8gb-ram-platinum/13893528)... will mostly be used for content consumption and note-taking for school, so battery life and weight is important."], "2020-11-29": ["Hey, I really need help!\nBought the 5600x and everything turns on but there is a red light on the motherboard (highlighting cpu) and there is no display on the monitor\n\nCPU : AMD Ryzen 5 5600X\nMobo: MSI X570 GAMING PLUS WIFI\nRAM : 2x8gb 3200Mhz CL16\ngpu: 750ti (trying to get the 6800x using my old 750ti to test if the rest of the parts are working)\n\nAt first I wasn't aware I was supposed to flash an updated bios so I just plugged everything in and then turned the pc on. Everything seemed to have power but nothing displayed on the monitor. Then someone told me I was suppose to update the bios on my motherboard so I followed the instructions on this video;https://www.youtube.com/watch?v=Nq2IxI_mRRs . After following these instructions I come to the same problem of nothing being displayed and I'm all out of ideas. Can I get any help/ideas with troubleshooting?"], "2020-11-30": ["Deciding to build a new 3080 PC after my previous 5 year build is starting to become a bit dated with a budget of $3000 AUD. \n\nI'm just curious as to what opinions you guys have of this build and what areas could be possibly improved or if there are any problems that would exist once this build is complete. \n\nThe PC would mainly be used for high end PC gaming but would still need to be fast for University work.\n\nI am quite inept at PC building and am really open to any criticism or mistakes i've made so far! \n\nHeres my list so far of the parts for this rig:\n\nCPU -\t AMD Ryzen 5600x \n\nGPU -\t Gigabyte Geforce RTX 3080 10GB Aorus Master\n\nRAM -\t OLOy WarHawk RGB 16gb 3600\n\nPSU -\t Gigabyte P GM 850W 80+ Gold\n\nMOBO -\t Gigabyte B550 Aorus Elite ATX Am4\n\nCASE -\t Antec P120 Crystal ATX\n\nAIO  -\t Enermax Liqfusion 360\n\nFANS -\t EzDiy-Fab Dual Ring RGB\n\nSTORAGE:  HDD - Seagate Barracude 4TB\n\nSSD  - Samsung 970 Evo 500GB\n\n&amp;#x200B;\n\nAlso how long hypothetically would this build last for? \n\nIm hoping to get the best bang for my buck with this budget hence having to get some off brand coolers / fans. I'm also crossing my fingers at this point that the chonky 3080 will even fit onto my MOBO!"], "2020-12-01": ["Hey everyone, just looking for peoples input of my first draft for my new build. Any input is appreciated. \n\n&amp;#x200B;\n\n\\[PCPartPicker Part List\\]([https://pcpartpicker.com/list/QJ8TPV](https://pcpartpicker.com/list/QJ8TPV))\n\n&amp;#x200B;\n\nType|Item|Price\n\n:----|:----|:----\n\n\\*\\*CPU\\*\\* | \\[AMD Ryzen 9 5900X 3.7 GHz 12-Core Processor\\]([https://pcpartpicker.com/product/KwLwrH/amd-ryzen-9-5900x-37-ghz-12-core-processor-100-100000061wof](https://pcpartpicker.com/product/KwLwrH/amd-ryzen-9-5900x-37-ghz-12-core-processor-100-100000061wof)) |-\n\n\\*\\*CPU Cooler\\*\\* | \\[Noctua NH-U9B SE2 37.86 CFM CPU Cooler\\]([https://pcpartpicker.com/product/Y4fp99/noctua-cpu-cooler-nhu9bse2](https://pcpartpicker.com/product/Y4fp99/noctua-cpu-cooler-nhu9bse2)) | $79.69 @ Amazon \n\n\\*\\*Motherboard\\*\\* | \\[Asus ROG STRIX B550-E GAMING ATX AM4 Motherboard\\]([https://pcpartpicker.com/product/PDyqqs/asus-rog-strix-b550-e-gaming-atx-am4-motherboard-rog-strix-b550-e-gaming](https://pcpartpicker.com/product/PDyqqs/asus-rog-strix-b550-e-gaming-atx-am4-motherboard-rog-strix-b550-e-gaming)) | $269.99 @ Amazon \n\n\\*\\*Memory\\*\\* | \\[Patriot Viper Steel 16 GB (2 x 8 GB) DDR4-4000 CL19 Memory\\]([https://pcpartpicker.com/product/YTKcCJ/patriot-viper-steel-16-gb-2-x-8-gb-ddr4-4000-cl19-memory-pvs416g400c9k](https://pcpartpicker.com/product/YTKcCJ/patriot-viper-steel-16-gb-2-x-8-gb-ddr4-4000-cl19-memory-pvs416g400c9k)) | $89.99 @ Newegg \n\n\\*\\*Storage\\*\\* | \\[Samsung 970 Evo Plus 1 TB M.2-2280 NVME Solid State Drive\\]([https://pcpartpicker.com/product/Zxw7YJ/samsung-970-evo-plus-1-tb-m2-2280-nvme-solid-state-drive-mz-v7s1t0bam](https://pcpartpicker.com/product/Zxw7YJ/samsung-970-evo-plus-1-tb-m2-2280-nvme-solid-state-drive-mz-v7s1t0bam)) | $149.99 @ Adorama \n\n\\*\\*Storage\\*\\* | \\[Seagate Barracuda Compute 2 TB 3.5\" 7200RPM Internal Hard Drive\\]([https://pcpartpicker.com/product/mwrYcf/seagate-barracuda-computer-2-tb-35-7200rpm-internal-hard-drive-st2000dm008](https://pcpartpicker.com/product/mwrYcf/seagate-barracuda-computer-2-tb-35-7200rpm-internal-hard-drive-st2000dm008)) | $54.48 @ Newegg \n\n\\*\\*Video Card\\*\\* | \\[MSI GeForce RTX 3080 10 GB GAMING X TRIO Video Card\\]([https://pcpartpicker.com/product/6tDkcf/msi-geforce-rtx-3080-10-gb-gaming-x-trio-video-card-rtx-3080-gaming-x-trio-10g](https://pcpartpicker.com/product/6tDkcf/msi-geforce-rtx-3080-10-gb-gaming-x-trio-video-card-rtx-3080-gaming-x-trio-10g)) | $809.94 @ Office Depot \n\n\\*\\*Case\\*\\* | \\[Fractal Design Meshify S2 ATX Mid Tower Case\\]([https://pcpartpicker.com/product/8tGxFT/fractal-design-meshify-s2-black-atx-mid-tower-case-fd-ca-mesh-s2-bko](https://pcpartpicker.com/product/8tGxFT/fractal-design-meshify-s2-black-atx-mid-tower-case-fd-ca-mesh-s2-bko)) | $147.99 @ B&amp;H \n\n\\*\\*Power Supply\\*\\* | \\[Corsair RM (2019) 850 W 80+ Gold Certified Fully Modular ATX Power Supply\\]([https://pcpartpicker.com/product/jtm323/corsair-rm-2019-850-w-80-gold-certified-fully-modular-atx-power-supply-cp-9020196-na](https://pcpartpicker.com/product/jtm323/corsair-rm-2019-850-w-80-gold-certified-fully-modular-atx-power-supply-cp-9020196-na)) | $134.99 @ Corsair \n\n | \\*Prices include shipping, taxes, rebates, and discounts\\* |\n\n | \\*\\*Total\\*\\* | \\*\\*$1737.06\\*\\*\n\n&amp;#x200B;\n\n\\*\\*\\*\\*\\*\\*Total with CPU $2,287.06\\*\\*\\*\\*\\*\\*\n\n | Generated by \\[PCPartPicker\\]([https://pcpartpicker.com](https://pcpartpicker.com)) 2020-12-01 00:00 EST-0500 |"], "2020-12-02": ["I would appreciate it if someone can help me decide which one of these pcs is better for their price and such, as i’m new to the pc world and I have no idea lol\n[PC1](https://www.gamestop.com/nav-pc-hardware-desktops/products/gamer-master-gma2600gs-with-amd-ryzen-5-1600-3.2ghz-gaming-desktop/10148058.html?condition=New)\n[PC2](https://www.gamestop.com/nav-pc-hardware-desktops/products/clx-set-tgmsetgxe9600bm-gaming-desktop/11096665.html?condition=New)\n[PC3](https://ironsidecomputers.com/shop/grunt/?wccp_component_selection%5B1497907884%5D=221804&amp;wccp_component_selection%5B1505733217%5D=221303&amp;wccp_component_selection%5B1497922574%5D=2101&amp;wccp_component_selection%5B1497924492%5D=1364&amp;wccp_component_selection%5B1497922575%5D=32709&amp;wccp_component_selection%5B1497922652%5D=1585&amp;wccp_component_selection%5B1497922685%5D=32726&amp;wccp_component_selection%5B1497922803%5D=4417&amp;wccp_component_selection%5B1497923274%5D=1472&amp;wccp_component_selection%5B1497923720%5D=1455&amp;wccp_component_selection%5B1497923814%5D=2488&amp;wccp_component_selection%5B1497923859%5D=1992&amp;wccp_component_selection%5B1502209711%5D=1854&amp;wccp_component_selection%5B1497924108%5D=17444&amp;wccp_component_selection%5B1497923932%5D=2506&amp;wccp_component_selection%5B1497924166%5D=2172&amp;wccp_component_selection%5B1527075224%5D=30353&amp;wccp_component_selection%5B1497924290%5D=2444&amp;wccp_component_selection%5B1497907955%5D=2153&amp;wccp_component_selection%5B1497924555%5D=2418&amp;wccp_component_selection%5B1497924493%5D=2105&amp;wccp_component_selection%5B1502219671%5D=2180&amp;wccp_component_selection%5B1497924621%5D=2423&amp;wccp_component_selection%5B1497924675%5D=2176&amp;wccp_component_selection%5B1497924791%5D=2171&amp;wccp_component_selection%5B1497925616%5D=2170&amp;wccp_component_selection%5B1497925685%5D=2168&amp;wccp_component_selection%5B1497925743%5D=2165&amp;wccp_component_selection%5B1497924251%5D=2169&amp;wccp_component_selection%5B1551192140%5D=46802&amp;wccp_component_selection%5B1497925823%5D=2166&amp;wccp_component_selection%5B1497925869%5D=2438&amp;wccp_component_selection%5B1523884686%5D=26865&amp;wccp_component_selection%5B1523884687%5D=26864&amp;wccp_component_selection%5B1497925909%5D=2163&amp;wccp_component_selection%5B1497926016%5D=2179&amp;wccp_component_selection%5B1497926088%5D=2167&amp;wccp_component_quantity%5B1497907884%5D=1&amp;wccp_component_quantity%5B1505733217%5D=1&amp;wccp_component_quantity%5B1497922574%5D=1&amp;wccp_component_quantity%5B1497924492%5D=1&amp;wccp_component_quantity%5B1497922575%5D=1&amp;wccp_component_quantity%5B1497922652%5D=1&amp;wccp_component_quantity%5B1497922685%5D=1&amp;wccp_component_quantity%5B1497922803%5D=1&amp;wccp_component_quantity%5B1497923274%5D=1&amp;wccp_component_quantity%5B1497923720%5D=1&amp;wccp_component_quantity%5B1497923814%5D=1&amp;wccp_component_quantity%5B1497923859%5D=1&amp;wccp_component_quantity%5B1502209711%5D=1&amp;wccp_component_quantity%5B1497924108%5D=1&amp;wccp_component_quantity%5B1497923932%5D=1&amp;wccp_component_quantity%5B1497924166%5D=1&amp;wccp_component_quantity%5B1527075224%5D=1&amp;wccp_component_quantity%5B1497924290%5D=1&amp;wccp_component_quantity%5B1497907955%5D=1&amp;wccp_component_quantity%5B1497924555%5D=1&amp;wccp_component_quantity%5B1497924493%5D=1&amp;wccp_component_quantity%5B1502219671%5D=1&amp;wccp_component_quantity%5B1497924621%5D=1&amp;wccp_component_quantity%5B1497924675%5D=1&amp;wccp_component_quantity%5B1497924791%5D=1&amp;wccp_component_quantity%5B1497925616%5D=1&amp;wccp_component_quantity%5B1497925685%5D=1&amp;wccp_component_quantity%5B1497925743%5D=1&amp;wccp_component_quantity%5B1497924251%5D=1&amp;wccp_component_quantity%5B1551192140%5D=1&amp;wccp_component_quantity%5B1497925823%5D=1&amp;wccp_component_quantity%5B1497925869%5D=1&amp;wccp_component_quantity%5B1523884686%5D=1&amp;wccp_component_quantity%5B1523884687%5D=1&amp;wccp_component_quantity%5B1497925909%5D=1&amp;wccp_component_quantity%5B1497926016%5D=1&amp;wccp_component_quantity%5B1497926088%5D=1&amp;v=47e5dceea252)"], "2020-12-03": ["Hi all, I’ve done a search for my question but wasn’t able to find a thread from someone with quite the same objectives. Basically I’d like to know the most powerful Nvidia GPU my Ryzen 5 3600 will support without bottlenecking (which I understand is a thing but otherwise know nothing about). \n\nMy target resolution is 1440p. I play mostly single-player games and don’t care much about frame rates above 60, although I would love my 60 to be solid and my settings to be as high as possible.\n\nFor the purpose of this exercise, assume cost and availability aren’t factors (they are in reality, but both mitigated by waiting, which I’m willing to do). Nvidia suggestions only please. Nothing against AMD, I’m just pretty invested into the green ecosystem already (I use GameStream on my Shield, etc.)\n\nThank you."], "2020-12-04": ["Hello there!\n\nI’m going to switch from an AMD GPU to an NVIDIA one. Do I have to uninstall the AMD drivers? How can I go about doing that? What else should I be concerned about?\n\nThank you for your time and your advice!"], "2020-12-05": ["So I am building my first build and I am going with a ryzen 5 3600, asus rog strix b450 f motherboard and a msi rx 5600xt gaming x am I have a few questions \n\n1. For the motherboard what driver do I need to install?\n I know I will need: \nLan \nAudio\nChipset\nDo I need the latest vga driver for my graphics card to work? \nI also need latest bios but the newest one out rn is a beta bios and on asus website it says “it’s highly recommended u not update to this bios if u are using an amd ryzen 3000 series 2000 series or 1000 series so do I just download the newest bios that is before that one? \nAlso what other drivers will I need for the motherboard \nIf any?"], "2020-12-06": ["###Troubleshooting Help:\n\n**What is your parts list? [Consider formatting your parts list.](http://www.reddit.com/r/buildapc/wiki/pcpp)**\n\n[PCPartPicker Part List](https://pcpartpicker.com/list/d4BK7X)\n\nType|Item|Price\n:----|:----|:----\n**CPU** | [AMD Ryzen 7 5800X 3.8 GHz 8-Core Processor](https://pcpartpicker.com/product/qtvqqs/amd-ryzen-7-5800x-38-ghz-8-core-processor-100-100000063wof) |-\n**CPU Cooler** | [Noctua NH-D15 CHROMAX.BLACK 82.52 CFM CPU Cooler](https://pcpartpicker.com/product/84MTwP/noctua-nh-d15-chromaxblack-8252-cfm-cpu-cooler-nh-d15-chromaxblack) | $271.24 @ Amazon \n**Motherboard** | [Gigabyte X570 AORUS MASTER ATX AM4 Motherboard](https://pcpartpicker.com/product/ZRBhP6/gigabyte-x570-aorus-master-atx-am4-motherboard-x570-aorus-master) | $359.99 @ Newegg \n**Memory** | [Corsair Vengeance RGB Pro 64 GB (4 x 16 GB) DDR4-3600 CL18 Memory](https://pcpartpicker.com/product/X7xbt6/corsair-vengeance-rgb-pro-64-gb-4-x-16-gb-ddr4-3600-cl18-memory-cmw64gx4m4d3600c18) | $344.00 @ Amazon \n**Storage** | [Corsair MP600 Force Series Gen4 1 TB M.2-2280 NVME Solid State Drive](https://pcpartpicker.com/product/gCJmP6/corsair-mp600-force-series-gen4-1-tb-m2-2280-solid-state-drive-cssd-f1000gbmp600) | $184.99 @ Amazon \n**Storage** | [ADATA XPG SX8200 Pro 2 TB M.2-2280 NVME Solid State Drive](https://pcpartpicker.com/product/kQZzK8/adata-xpg-sx8200-pro-2-tb-m2-2280-nvme-solid-state-drive-asx8200pnp-2tt-c) | $239.99 @ Amazon \n**Video Card** | [Asus GeForce RTX 3080 10 GB STRIX GAMING Video Card](https://pcpartpicker.com/product/cnRgXL/asus-geforce-rtx-3080-10-gb-strix-gaming-video-card-rog-strix-rtx3080-10g-gaming) |-\n**Case** | [NZXT H510 Elite ATX Mid Tower Case](https://pcpartpicker.com/product/kpx2FT/nzxt-h510-elite-atx-mid-tower-case-ca-h510e-w1) | $149.88 @ Amazon \n**Power Supply** | [SeaSonic PRIME Platinum 850 W 80+ Platinum Certified Fully Modular ATX Power Supply](https://pcpartpicker.com/product/vR648d/seasonic-prime-platinum-850w-80-platinum-certified-fully-modular-atx-power-supply-ssr-850pd) |-\n**Operating System** | [Microsoft Windows 10 Pro OEM 64-bit](https://pcpartpicker.com/product/MfH48d/microsoft-os-fqc08930) | $139.88 @ Other World Computing \n**Monitor** | [LG 27GN950-B 27.0\" 3840x2160 144 Hz Monitor](https://pcpartpicker.com/product/DPrYcf/lg-27gn950-b-270-3840x2160-144-hz-monitor-27gn950-b) | $809.94 @ Office Depot\n\n**Describe your problem. List any error messages and symptoms. Be descriptive.**\n\nThis is a new build so I definitely want to pinpoint the issue so I can return anything I may need. Starting today, my speakers have randomly stopped working completely twice and the only way to fix this is to turn the PSU off and back on. A restart does NOT appear to resolve the issue. The curious thing, is that when this is happening, the audio port on the front/top of the case seems to work just fine.\n\n**List anything you've done in attempt to diagnose or fix the problem.**\n\nRe-installed Realtek audio drivers, rolled back BIOS version to F30, updated x570 chipset drivers downloaded directly from AMD, and of course, restarted computer multiple times."], "2020-12-07": ["Power Supply stock at Micro Center is terrible so I need a little help picking a PSU that will arrive by Friday. Using LTT PSU Tier list to narrow the list but still want some input. No Asus, Seasonic, Antec for a possible 3080 issue. Budget of $150-$225. \n\n**be quiet! Straight Power 11 850 W Plat** - *$175*\n\n**EVGA G3 850w Gold** - *$185*\n\n**FSP Hydro G PRO 850W** - *$160*\n\n[PCPartPicker Part List](https://pcpartpicker.com/list/wNZRgt)\n\nType|Item|Price\n:----|:----|:----\n**CPU** | [AMD Ryzen 9 5900X 3.7 GHz 12-Core Processor](https://pcpartpicker.com/product/KwLwrH/amd-ryzen-9-5900x-37-ghz-12-core-processor-100-100000061wof) | $550.00 \n**CPU Cooler** | [Noctua NH-D15S chromax.black 82.51 CFM CPU Cooler](https://pcpartpicker.com/product/R6kgXL/noctua-nh-d15s-chromaxblack-8251-cfm-cpu-cooler-nh-d15s-chromaxblack) | $90.00 \n**Motherboard** | [MSI MAG X570 TOMAHAWK WIFI ATX AM4 Motherboard](https://pcpartpicker.com/product/WKdrxr/msi-mag-x570-tomahawk-wifi-atx-am4-motherboard-mag-x570-tomahawk-wifi) | $220.00 \n**Memory** | [G.Skill Trident Z Neo 16 GB (2 x 8 GB) DDR4-3600 CL16 Memory](https://pcpartpicker.com/product/JgLwrH/gskill-trident-z-neo-16-gb-2-x-8-gb-ddr4-3600-memory-f4-3600c16d-16gtznc) | $115.00 \n**Memory** | [G.Skill Trident Z Neo 16 GB (2 x 8 GB) DDR4-3600 CL16 Memory](https://pcpartpicker.com/product/JgLwrH/gskill-trident-z-neo-16-gb-2-x-8-gb-ddr4-3600-memory-f4-3600c16d-16gtznc) | $115.00 \n**Storage** | [Western Digital Black SN850 1 TB M.2-2280 NVME Solid State Drive](https://pcpartpicker.com/product/W69tt6/western-digital-black-sn850-1-tb-m2-2280-nvme-solid-state-drive-wds100t1x0e) | $230.00 \n**Storage** | [Intel 660p Series 1.02 TB M.2-2280 NVME Solid State Drive](https://pcpartpicker.com/product/9nhKHx/intel-660p-series-1tb-m2-2280-solid-state-drive-ssdpeknw010t8x1) | Purchased For $0.00 \n**Storage** | [Western Digital BLACK SERIES 2 TB 3.5\" 7200RPM Internal Hard Drive](https://pcpartpicker.com/product/XtjG3C/western-digital-internal-hard-drive-wd2003fzex) | Purchased For $0.00 \n**Video Card** | [Asus GeForce RTX 3080 10 GB TUF GAMING Video Card](https://pcpartpicker.com/product/DgMTwP/asus-geforce-rtx-3080-10-gb-tuf-gaming-video-card-tuf-rtx3080-10g-gaming) | Purchased For $750.00 \n**Case** | [Lian Li Lancool II Mesh ATX Mid Tower Case](https://pcpartpicker.com/product/ybH8TW/lian-li-lancool-ii-mesh-atx-mid-tower-case-lancool-ii-mesh-performance) | $95.00 \n | *Prices include shipping, taxes, rebates, and discounts* |\n | **Total** | **$2165.00**\n | Generated by [PCPartPicker](https://pcpartpicker.com) 2020-12-06 23:07 EST-0500 |"], "2020-12-08": ["\"You know uggh. Your lucky I was generous enough to even give you this deal nmnhhh. After all I knew your father well, knew I could trust him nnh. You on the other hand, all I know about you is how soft your tits are!\" King Argot's cruel statement made my pale porcelain face flush redder than it already was. Making the wet spots of spit and pre cum on it stand out even more. His mean joyous laughter momentarily covered up the wet slurping sounds that rung around his private study. Every time his fat cock head popped out between the valley of my breast, and entered my awaiting warm mouth. \n\nI had no idea what I was expecting when I came to his kingdom to sign a new treaty. But I had never imagined this. Kneeling in nothing but my green heels, white gloves and stockings, and my crown. Which King Argot was currently using as a handle to push my head into taking more of his smelly cock when ever the chance came up. I had no idea how long this had been going on, but by how soar my knees were it felt like I had been kneeling for hours. As he fucked my breast to his hearts content.\n\n\"Ahhh yet they feel divine enough to justify signing that new treaty. Of course with our new agreed upon requirements mnmhh yes. That it you little blue haired whore!\" He continued to talk. Each hateful word adding to my internal conflict. Making me feel a strange mix of shame and pleasure. That at the moment I just wanted to ignore. \"You know I even think that my mnhh generosity deserves a ugghh, thank you. So come on thank your King.\"\n\nAs he said that he pushed my head down onto his cock. Stuffing my mouth with his hefty tip, and resting his fat belly on my forehead. I wanted to refuse, to just get up and run out of the room. But I couldn't, I couldn't damn my kingdom to the constant attracts we would surely be under if we lost King Argot's support. So as I felt his lust filled gaze on the back of my head. I did the only thing I could and mumbled into his cock. \"Slurrp Thranksh ssshyou slurrrp mhyyy lhoord.\" (Thank you my lord) As I finish mumbling into his cock. I felt his cock give a few twitches before he let out a loud grunt. And my mouth filled with his cum. Caught by surprise and with a complete lack of experience, his flood of jizz leaked passed my lips. Coating my chin and breast in a waterfall of hot cum. \n\nI could barely hear him as he laugh and talked about how that would do till our next appointment. As all I could think about was how I hoped that this was the only humiliation I would have to endure as Queen of Neven. Yet as I looked back up at man who had just coated my body and feed me with his cum. I felt a ominous shiver un down my spine as he said. \n\n\"Ohh and congratulations on your coronation, Queen Alicia.\"\n\n///////////////////\n\nHello people of ddp. This rp will take place in a fantasy setting. Letting us use all of the staples amd themes that the genre has to offer. This story will focus around Alicia. Who after her fathers sudden death, had to be quickly coronated as the Kingdom of Neves new Queen. After the coronation she learned how badly the kingdom was doing. Im looking for a GM/DM that wants to help build a story with me. As we take Alicia from one depraved situation to another. And she goes from a caring Queen who just wanted the best for her people. Into a nymphomaniac wore of a Queen who turns the Kingdom of Neve into a cesspool of lust.\n\nKinks for this rp can be discussed, the only required kinks and hard limits for this rp are.\n\nKinks: Corruption, slutty clothing/outfit changes, misogyny/objectification, humiliation, cock worship, monster sex, large insertions, and beastiality.\n\nLimits: snuff, gore/mutilation, ageplay, violence(not including slapping or spanking), and bondage\n\nAnyone interested in this prompt can reach me through chat or DM."], "2020-12-09": ["Hello guys. I recently reinstalled my amd graphics drivers in my Lenovo laptop. I kind of cancelled it half way through cus it took a lot of time. My screen has been flickering ever since. And today the screen just flickers black and white when i turn the pc on. I cant see anythinh. Please help"], "2020-12-10": ["So I just went through a month+ process whereby at first my system was as follows (tl;dr at the bottom for those who don't want to read the story):\n\n8700k OC 4.9ghz\n\n32gb 3200mhz CL16 RAM\n\n2060 Super lightly OC'd (don't remember exactly how much)\n\nI would average around 90-120 fps in warzone (1080P LOW settings) and not really think much of it, seemed normal to me and was playable.\n\nThen I managed to score a 3090 and excitedly installed it only to realize that my FPS only kind of increased to around 130-140 average but on all highest settings (1080P still), with literally no change in FPS if I changed the settings to all lowest. This seemed odd to me as most streamers and other benchmarks I've seen with the 3090 are able to realize 200+ average FPS.\n\nI did almost everything I could think of or find on the internet. I formatted and did a fresh windows install, tried all the optimizations including power, adv. config, etc., with no dice, my FPS was stuck here.\n\nCreated a few reddit threads and most people pointed me to the fact that I was CPU-bound, which I accepted could have been true but didn't explain how benchmarkers on youtube were able to achieve 200+ fps with 8700k's and 3080's.\n\nOh and I might add that at 4k res (which relies much more heavily on GPU-performance), I was basically within 2-3% of benchmarks in warzone, so no problems there although I don't play on a 4k monitor.\n\nEarlier this week I was able to secure a 5800x and figured ok, now finally I will be able to achieve the mythical 200fps average.. only to once again fall short now in the 150-180fps range.\n\nBy matter of chance... my original plan was to give my GF the majority of my old PC while swapping the RAM since she already had 16gb and I figured my 32gb 3200mhz was more than good enough. However, her system was pretty old and still running on DDR3 so the RAM wasn't compatible, and  therefore I had to purchase new ram.\n\nConventional wisdom historically has always been that RAM speed isn't that impactful on performance, specifically game performance or FPS, but this is where I get to my \"ah ha\" realization.\n\nIt's been somewhat well established since Ryzen 3000 that Ryzen CPUs specifically are very sensitive to RAM speeds and you can achieve much greater discrepancy in performance based on different RAM (most of the popular youtubers have done vids on this). Furthermore, Gamersnexus recently posted a video about how not only is Ryzen sensitive to RAM speeds, but there is a significant performance uplift (or downtick, depending on where you're coming from) on the same exact RAM with 4 or 2 sticks.\n\nSo I then proceeded to purchase 64gb 3600mhz CL16 RAM (4x16gb) and boom.. my FPS instantly increased to 200-220fps average (hitting as high as 240-260fps in some map locations). I checked some of the benchmark rigs that I was looking at before and sure enough all of them were running on at least 3600mhz RAM.\n\nI then proceeded to do a number of underclocks (and attempted overclocks, to no avail) on my RAM with multiple iterations in controlled environments (same spot, same path, etc.) and came to the following results with my current system (5800x stock, 64gb RAM, 3090 FE slightly OC'd):\n\nThe FPS difference between 2133mhz RAM (no XMP), and 3600mhz RAM is a whopping  24% on average and 30% on max FPS at 1080P highest settings. The difference between 3200mhz and 3600mhz is 13%. Assuming you are not GPU bottlenecked, I can only assume the variance would be greater at lower settings. That is a HUGE discrepancy for just RAM, which most people ignore other than the size.\n\nI tested a few other games and generally it seems (and makes sense) that more CPU-intensive and bound games benefit tremendously from higher RAM speeds (CS:GO for example). Also mostly at 1080p, at higher resolutions the variance decreases and becomes less meaningful.\n\nWarzone out of any game I tested was the MOST sensitive to changes in RAM speeds.\n\nFinally I would point out that for AMD Ryzen processors, RAM speed actually is a deterrent past 4000mhz (you lose FPS) and you'd need a bit of a win on the silicon lottery side to even effectively make use of that much. Won't get into the tech here of why that is but you can do your own research. The sweet spot is 3600 --&gt; 3800mhz.\n\n&amp;#x200B;\n\nTL;DR:\n\nWarzone FPS is HIGHLY dependent on your RAM speed, which can generally be upgraded for less than a new CPU (which often requires a new MOBO) or a new GPU (which is impossible to find right now anyways).. RAM is abundant and relatively cheap right now!  I would recommend 3600mhz CL16 but at a minimum 3200mhz CL16."], "2020-12-11": ["Hello r/davinciresolve! Welcome to the fifth edition of the official FAQ/FAQ Friday trend! I'm doing these to help people with common questions, the \"dumb\" questions you're afraid to post (there are no dumb questions, trust me), and *slowly* get enough feedback/input to make a wiki!\n\nOf course, I can't (and shouldn't) be writing this alone, so please tear apart what I've written, ask any questions, offer your favorite resources/tips, and help make it a useful resource for everyone.\n\nPeripherals, control surfaces, and more can be covered in another post, but this one is broken\n\n# Stores and Other Resources\n\n* [Puget Systems has an excellent hardware guide and store](https://www.pugetsystems.com/recommended/Recommended-Systems-for-DaVinci-Resolve-187) for Linux/Windows systems\n* [Apple](https://www.apple.com/mac/) is, well, Apple\n   * Note that Big Sur may not have been tested with 16; please report bugs to Blackmagic Design on the official forum, downgrade to Catalina, or upgrade to the 17 beta.\n   * M1 Macs now have dongle support for Studio with 17.0 beta 4, but may not support eGPUs.\n* HP Workstations (if you've got the cash or are in a studio environment)\n   * [The Z8 is the current workhorse model](https://www8.hp.com/us/en/workstations/z8.html)\n   * [Z Mobile Laptops may also fit these needs](https://www8.hp.com/us/en/workstations-family-page/index.html?jumpid=in_r12139_us/en/psg/ws_overview/products/laptops)\n\n# Computer Hardware Suggestions (Unofficial)\n\n*Minimum system suggestions for all platforms:*\n\n* A recent operating system (yes, this includes other Linux distros)\n* 16 GB of system memory.\n* Discrete GPU with at least 2GB of VRAM \n   * Required for Linux, optional-ish for others but strongly recommended\n   * eGPUs are not yet supported on the recent M1 Macs, as far as I'm aware, but should be compatible with other Macs.\n* A recent CPU (Last year or two)\n* Studio GPU drivers (some people have reported issues with gaming drivers, iirc)\n* A three-button mouse^(1)\n\n# Computer Hardware Requirements (Official)\n\n*Minimum system requirements for all platforms:*\n\n* Blackmagic Design Desktop Video 10.4.1 or later\n* A three-button mouse^(1)\n\n*Minimum system requirements for macOS*\n\n* Mac 10.14.6 Mojave\n* 16 GB of system memory. 32 GB when using Fusion\n* Integrated GPU or discrete GPU with at least 2GB of VRAM.\n* GPU which supports Metal or OpenCL 1.2.\n\n*Minimum system requirements for Windows*\n\n* Windows 10 Update (17 requires the Creators Update)\n* 16 GB of system memory. 32 GB when using Fusion\n* Integrated GPU or discrete GPU with at least 2GB of VRAM\n* GPU which supports OpenCL 1.2 or CUDA 11\n* NVIDIA/AMD/Intel GPU Driver version – As required by your GPU\n* A minimum NVIDIA driver version of 451.82 is recommended.\n\n*Minimum system requirements for Linux*\n\n* CentOS 7.3\n* 32 GB of system memory\n* Discrete GPU with at least 2GB of VRAM\n* GPU which supports OpenCL 1.2 or CUDA 11\n* NVIDIA/AMD Driver version – As required by your GPU\n* A minimum NVIDIA driver version of 450.51.06 is recommended.\n\n^(1)A three-button mouse is not an official requirement. It's just *strongly* suggested.\n\n[**Previous FAQ Fridays:**](https://www.reddit.com/r/davinciresolve/search?q=flair_name%3A%22FAQ%20Friday%22&amp;restrict_sr=1)\n\n* [Getting Started](https://www.reddit.com/r/davinciresolve/comments/jkpv9m/official_faq_friday_introduction_thread_getting/)\n* [Updating and Upgrading Resolve](https://www.reddit.com/r/davinciresolve/comments/joyvc7/official_faq_friday_thread_updatingupgrading/)\n* [Delivery, Exports, and Rendering](https://www.reddit.com/r/davinciresolve/comments/jtb16w/official_faq_friday_thread_delivery_exports_and/)\n* [Resolve 17](https://www.reddit.com/r/davinciresolve/comments/jxiy2p/official_faq_friday_thread_resolve_17/)\n* [Free-For-All](https://www.reddit.com/r/davinciresolve/comments/k6utjp/belated_faq_friday_freeforall/)"], "2020-12-12": ["My original idea was to create a good build for $1000 or less, but I decided to get some better parts I would bump up the price a little. I wanted to be able to play the same games I would on my console, and also be able to run some programs for school etc.. \n\n&amp;#x200B;\n\nI spent a few hours customizing a build on Ibuypower and came up with this, let me know if there is anything I should change before purchasing. Thanks \n\n\\[PCPartPicker Part List\\]([https://pcpartpicker.com/list/vVkrYg](https://pcpartpicker.com/list/vVkrYg))\n\n&amp;#x200B;\n\nType|Item|Price\n\n:----|:----|:----\n\n\\*\\*CPU\\*\\* | \\[AMD Ryzen 5 2600X 3.6 GHz 6-Core Processor\\]([https://pcpartpicker.com/product/6mm323/amd-ryzen-5-2600x-36ghz-6-core-processor-yd260xbcafbox](https://pcpartpicker.com/product/6mm323/amd-ryzen-5-2600x-36ghz-6-core-processor-yd260xbcafbox)) | $202.67 @ Amazon \n\n\\*\\*Motherboard\\*\\* | \\[Gigabyte B450 AORUS PRO WIFI (rev. 1.0) ATX AM4 Motherboard\\]([https://pcpartpicker.com/product/43BTwP/gigabyte-b450-aorus-pro-wifi-rev-10-atx-am4-motherboard-b450-aorus-pro-wifi-rev-10](https://pcpartpicker.com/product/43BTwP/gigabyte-b450-aorus-pro-wifi-rev-10-atx-am4-motherboard-b450-aorus-pro-wifi-rev-10)) | $119.99 @ Newegg \n\n\\*\\*Memory\\*\\* | \\[G.Skill Ripjaws V Series 16 GB (2 x 8 GB) DDR4-3200 CL16 Memory\\]([https://pcpartpicker.com/product/Nqp323/gskill-memory-f43200c16d16gvrb](https://pcpartpicker.com/product/Nqp323/gskill-memory-f43200c16d16gvrb)) | $61.99 @ Newegg \n\n\\*\\*Storage\\*\\* | \\[Samsung 860 Evo 500 GB 2.5\" Solid State Drive\\]([https://pcpartpicker.com/product/6yKcCJ/samsung-860-evo-500gb-25-solid-state-drive-mz-76e500bam](https://pcpartpicker.com/product/6yKcCJ/samsung-860-evo-500gb-25-solid-state-drive-mz-76e500bam)) | $56.99 @ Adorama \n\n\\*\\*Storage\\*\\* | \\[Samsung 860 Evo 500 GB 2.5\" Solid State Drive\\]([https://pcpartpicker.com/product/6yKcCJ/samsung-860-evo-500gb-25-solid-state-drive-mz-76e500bam](https://pcpartpicker.com/product/6yKcCJ/samsung-860-evo-500gb-25-solid-state-drive-mz-76e500bam)) | $56.99 @ Adorama \n\n\\*\\*Video Card\\*\\* | \\[PowerColor Radeon RX 5600 XT 6 GB Red Devil Video Card\\]([https://pcpartpicker.com/product/JWJmP6/powercolor-radeon-rx-5600-xt-6-gb-red-devil-video-card-axrx-5600xt-6gbd6-3dheoc](https://pcpartpicker.com/product/JWJmP6/powercolor-radeon-rx-5600-xt-6-gb-red-devil-video-card-axrx-5600xt-6gbd6-3dheoc)) | $449.96 @ Amazon \n\n\\*\\*Case\\*\\* | \\[NZXT H510 ATX Mid Tower Case\\]([https://pcpartpicker.com/product/b7hmP6/nzxt-h510-atx-mid-tower-case-ca-h510b-b1](https://pcpartpicker.com/product/b7hmP6/nzxt-h510-atx-mid-tower-case-ca-h510b-b1)) | $69.98 @ Amazon \n\n\\*\\*Power Supply\\*\\* | \\[Corsair CXM 650 W 80+ Bronze Certified Semi-modular ATX Power Supply\\]([https://pcpartpicker.com/product/R2mxFT/corsair-power-supply-cp9020103na](https://pcpartpicker.com/product/R2mxFT/corsair-power-supply-cp9020103na)) | $69.99 @ Newegg \n\n | \\*Prices include shipping, taxes, rebates, and discounts\\* |\n\n | Total (before mail-in rebates) | $1108.56\n\n | Mail-in rebates | -$20.00\n\n | \\*\\*Total\\*\\* | \\*\\*$1088.56\\*\\*\n\n | Generated by \\[PCPartPicker\\]([https://pcpartpicker.com](https://pcpartpicker.com)) 2020-12-11 23:51 EST-0500 |"], "2020-12-13": ["Hey folks,\n\nI've been messing with Cyberpunk's settings for the past couple of days and I've settled on a combination that delivers great visuals (RT enabled) and 60-70 fps for most of the game depending on the environment, dropping to 50-55 fps in the most demanding city areas.  NVIDIA's default settings had me at 40 fps for most of the game, so this is a big improvement with no noticeable visual downgrade. I'm running an R5 3600, 3060 Ti, and 16 GB Ram.\n\nFirst: Apply the AMD processor fix described [here](https://www.reddit.com/r/nvidia/comments/kbtuec/possible_cyberpunk_2077_on_amd_cpus_performance/) for a significant FPS increase on AMD CPUs\n\nSettings:\n\nStart at RayTracing Ultra preset and change the following settings:\n\n* Cascaded Shadow Range to Medium\n* Cascaded Shadow Resolution to Medium\n* Volumetric Fog Resolution to High\n* Volumetric Cloud Quality to High\n* Max Dynamic Decals to High\n* DLSS - Quality\n\nDepending on your CPU, you may want to turn crowd density in the Gameplay settings to Medium.  I would recommend it with an R5 3600 for a 5-10 fps increase in the most crowded city areas of the game. If you're looking for even more FPS gains, the next thing to drop would probably be Volumetric Fog and Clouds to Medium.\n\nSettings I turned off based on preference:\n\n* Film Grain off\n* Chromatic Aberration off\n* Depth of Field off\n* Motion Blur off\n\nHope this helps!  The main thing that makes this game pop is the ray-traced lighting in my opinion, so I've tried to cut the visuals where it's less noticeable to keep the game running smooth with RTX on."], "2020-12-14": ["Hi all!\n\nI'm not sure if this has been asked here before or not. Please do forgive me if this has been asked and answered a zillion times and just kindly link me to the current working solution.\n\nSo, I've just downloaded Cyberpunk 2077 on GOG Galaxy today, with the latest patch and all. I decided not to have a go at it on launch day after hearing about the terrible performance everywhere, and I also didn't really have any time to spare to play. But, I figured that maybe after a few days and a few patches, the game would at least be somewhat playable.\n\nAnyway, I have got the latest available driver for the 6900XT, version 20.12.1 according to Radeon Software, and I have got the latest chipset driver as well for my X570 motherboard, version  2.10.13.408 according to AMD's website.\n\nI only have a 1080p monitor at the moment, but an upgrade to 1440p/4K is imminent, but I'm still undecided yet between 1440p and 4K. I tested different resolutions, however, between 1080p, 1440p, and 2160p, using the virtual super resolution feature and I can set FidelityFX dynamic rendering to off, making the GPU technically rendering the full virtual resolution of my choice.\n\nAcross all resolutions, I only see cinematic 25-35 fps at max graphical settings, as chosen by Cyberpunk for my hardware. There are no RT features enabled yet for AMD cards, so, this is with RT off. This already is an unusual behavior as the performance basically doesn't scale with the resolution at all.\n\nI also notice that at 1080p, my GPU is cool as a cucumber at 50C with a usage of at most 25%. At 1440p, it goes up a bit higher at 35% peak, and at 4K it goes even higher at 55% peak. But it never pins the GPU at 100% and the core clock is just everywhere.\n\nDoes anybody have any idea what to do in this case or how to fix it? Aside from waiting for the CDPR to fix it or AMD to release new drivers of course..."], "2020-12-15": ["I've never built a PC myself. I did a couple of part-swappings in a pre-built PC so I kinda had the idea what to do, but this is the first time I ever actually did it.  \nPreviously I was using a i5-6600 barebone kit with no GPU, which the fans literally starts screaming any time I launch any game. The recently-released Genshin Impact simply crashed on it. And with a new remake of MYST coming along the way, I decided to build a new one from scratch.\n\nThis is the result of 3 months of lurking in this sub and some Youtube channels.\n\nPart list (Note: I live in Japan so some of them might appear obscure)   \nCPU\t\tAMD Ryzen5 3600\t\t\t\t\t$253\t¥26,378   \nGPU\t\tPalit GeForce GTX 1660 SUPER GP OC\t$240\t¥24,980  \nMB\t\t\tGIGABYTE B450I AORUS PRO WIFI\t\t$129\t¥13,472   \nRAM\t\tCFD 8Gx2 3200MHz\t\t\t\t\t$71\t\t¥7,376  \nPSU\t\tCoolerMaster V650 SFX Gold\t\t\t$139\t¥14,498   \nCPU Cooler\tSCYTHE Choten\t\t\t\t\t\t$34\t\t¥3,498   \nCase\t\tCoolerMaster NR200\t\t\t\t\t$79\t\t¥8,259   \nSSD\t\tSAMSUNG 970 EVO M.2 (500GB)\t\t$86\t\t¥8,980  \nPlus a 2.5 HDD and a 2.5 SSD from my old PC.\n\nThe RAM runs 2666MHz out of the box, and comes with an XMP profile to boost to 3200MHz, which I applied.\n\nI didn't add any case fans except the 92+120 that came with the case. 92 is on the back, exhausting. 120 was too thick to fit above the CPU cooler, so it sits above the PSU instead, exhausting. All fans are set to silent mode in BIOS.  \nI didn't do any proper benchmarks, but when playing Genshin Impact with all graphic set to the highest, both CPU and GPU sits around 55-60C which I'm fairly comfortable with. Maybe I'll add some fans next summer.  \nI did notice though, that CPU tends to jump from 45C-ish to 60C-ish, and back to 45C-ish again. I'm not sure if this is normal since this is the first time I ever monitored the temps.\n\nAt first I was aiming for an absolutely no LED build, since I wasn't a big fan of it. But after seeing the white LED of GPU leaking from the mesh panel, I decided to keep it. The back of MB glows in white as well.\n\nCable management was somewhat problematic because of the 2 SATA drives. The cables that came with the PSU were also very stiff, so all I could do was to pretty much tuck them away and pray that they won't affect the air flow.  \nThey WILL be more of a problem when I try to add fans at the bottom in the future though..."], "2020-12-16": [" paypal only. acquired through AMD Raise The Game Promo. Already done the AMD steps. Purchased codes are to be redeemed through Epic Games Launcher and blizzard [battle.net](https://battle.net/) respectively. I'm from Australia (might be affected region-wise? might need a VPN)"], "2020-12-17": ["[https://www.bestbuy.com/site/lenovo-yoga-6-13-2-in-1-13-3-touch-screen-laptop-amd-ryzen-5-8gb-memory-256gb-ssd-abyss-blue-fabric-cover/6427161.p?skuId=6427161&amp;ref=212&amp;loc=1&amp;extStoreId=602&amp;ref=212&amp;loc=1&amp;ds\\_rl=1260576&amp;gclid=CjwKCAiA\\_eb-BRB2EiwAGBnXXoeDT29a1WjMBfZp7Zoy\\_7qaDz5bDKWWleogSBytjl0Cz2p6LRWjHRoCX58QAvD\\_BwE&amp;gclsrc=aw.ds](https://www.bestbuy.com/site/lenovo-yoga-6-13-2-in-1-13-3-touch-screen-laptop-amd-ryzen-5-8gb-memory-256gb-ssd-abyss-blue-fabric-cover/6427161.p?skuId=6427161&amp;ref=212&amp;loc=1&amp;extStoreId=602&amp;ref=212&amp;loc=1&amp;ds_rl=1260576&amp;gclid=CjwKCAiA_eb-BRB2EiwAGBnXXoeDT29a1WjMBfZp7Zoy_7qaDz5bDKWWleogSBytjl0Cz2p6LRWjHRoCX58QAvD_BwE&amp;gclsrc=aw.ds)\n\nChoose an open box."], "2020-12-18": [" I  just purchased all my parts for my new gaming pc. \n\nAMD 5600x \n\nMSI B550  Gaming Edge WiFi \n\n32gb Ballistix 3200mhz \n\nSabrent 1TB NVME \n\nMSI GEForce  1080ti \n\nCorsair AX1200 PSU\n\nI am  trying to start it up for the first time and the computer starts up but I  get errors on the EZ Debug LED. The first time I had VGA and Boot lit  up so I fastened the graphics cards and now I have just Boot lit up. I  restarted a few more times and have had CPU lit up a few times as well. I  only installed 1 16gb. I have unplugged and fastened all the pieces but  still have not found a solution.\n\nNothing displays on my monitor and it still shows the BOOT led still on.\n\nAny  ideas? I’ve spent the last 15 hours digging into solutions and may just  return everything if I can’t get it to work :( Thanks in advance"], "2020-12-19": ["About to pull the trigger on a 6900xt and complete my amd build. I hear a lot of guys on nvidia using it on a 3090"], "2020-12-20": [""], "2020-12-21": ["CPU: AMD Ryzen 5 3400G 3.7 GHz Quad-Core Processor  ($225.95 @ Amazon) \n\nMotherboard: ASRock B450 Pro4 ATX AM4 Motherboard  ($90.99 @ Amazon) \n\nMemory: G.Skill Ripjaws V Series 16 GB (2 x 8 GB) DDR4-3600 CL16 Memory  ($107.99 @ Newegg) \n\nStorage: Patriot Burst 480 GB 2.5\" Solid State Drive  ($47.99 @ Amazon) \n\nCase: Thermaltake Versa H21 ATX Mid Tower Case  ($29.99 @ Newegg) \n\nPower Supply: EVGA BR 500 W 80+ Bronze Certified ATX Power Supply  ($54.99 @ Walmart) \n\nMonitor: LG 22MK430H-B 21.5\" 1920x1080 75 Hz Monitor  ($116.99 @ Amazon) \n\nPC Internal Speaker:  [TOTOT 2pcs PC Motherboard Mini Speaker Desktop Computer Case DIY Internal Code Mini Plug Beep Alarm Buzzer](https://www.amazon.com/gp/product/B079DKDSJ9/ref=ppx_yo_dt_b_asin_title_o02_s00?ie=UTF8&amp;psc=1) \n\nI've been struggling to get this build to boot for a while, hence why I got the PC internal speaker for further troubleshooting. Connected it and couldn't even get a single beep from the thing. So, I went about reseating all the components. When I unscrewed the CPU fan and removed it, I noticed the CPU itself came out with it. There was a single bent pin that I fixed by following JayzTwoCents method of using a razor. Also noticed I got a little bit of thermal paste in between a few pins. Cleaned it up by using a brush with a little isopropyl, plus running the razor in between the pins. Reseating everything, and still no boot, no beeps from the internal PC speak. \n\nPerhaps the CPU is toast?"], "2020-12-22": [""], "2020-12-23": [""], "2020-12-24": ["So I have a bunch of my investments in the Dynamic Power American Growth fund, which is a tech-heavy fund (Twilio, ServiceNow, Amazon, AMD, Nvidia were their top 5 holdings as of Halloween) that has done really well the last few years. Normally I check how it did each day on the Dynamic website (https://funds.dynamic.ca/fundprofiles/en-US/PW2K/A/CAD) and today I expected it to be down a bit, given that there was a bit of a tech pulback, and sure enough their page says it was down 0.82 or 2.37% today. But then I checked my bank accounts and my total value was down *way* more than I was expecting. Did a bit of Googling and found the fund's value on YCharts (https://ycharts.com/mutual_funds/M:DYN004.TO) which lists it as down 21.73%. I noticed at that point that the unit value of $27.22 did match what was on the Dynamic site and I remember it was around $34 yesterday, which would align with a 20+% drop.\n\nSo, what happened? Is it a website error? What could they have possible been holding that caused them to drop so precipitously? Was there some kind of a dividend that I can find no information about? \n\nThanks all."], "2020-12-25": ["Hi everyone. I’m going to keep things short and simple; I know next to nothing about PCs, let alone building one or finding the right parts. For the past couple of weeks i’ve been researching different budget builds and parts to use and i’ve come up with this. If you have any suggestions or tips on which parts might be better or tips on assembly, please let me know! I have a budget range of around 1k, but i wouldn’t mind paying $150 above or below this price range. I specifically need advice on which GPU would work best with this build. I also would appreciate alternatives for the motherboard and case. Thanks and happy holidays!\n\nCPU - RYZEN 5 3600 (200$)\n\nGPU - ??? (maybe 5700xt or 2070 super?)\n\nPSU - Cooler Master Watt 650 Watt Semifanless Modular Power Supply, 80 PLUS Bronze Certified Power Supply for Computers (85$)\n\nMEMORY - OLOy DDR4 RAM 16GB (2x8GB) 3000 MHz CL16 1.35V 288-Pin Desktop Gaming UDIMM (62$)\n\nMOTHERBOARD- ASUS Prime B550M-A WiFi AMD AM4 Zen 3 Ryzen 5000 &amp; 3rd Gen Ryzen Micro ATX Motherboard (129$)\n\nSTORAGE - Crucial MX500 1TB 3D NAND SATA 2.5 Inch Internal SSD, up to 560MB/s - CT1000MX500SSD1(Z) ($95)\n\nCASE - Corsair 275R Airflow Tempered Glass Mid-Tower Gaming Case, Black (80$)"], "2020-12-26": ["I recently got the game for free from the Epic Games store. Today, I finally decided to install it, and after 3 times of trying, the game never makes it past the intro, and a message appears saying: Metro 2033 Executable has stopped working. The second time I tried getting into the game,  it says previous launch was unsuccessful, would you like to start in safe mode? My PC specs are  **AMD Radeon HD 7800 Series, and**  AMD Phenom(tm) II X4 955 Processor. Can someone please tell me how to fix this?"], "2020-12-27": ["**The Background:**\n\nSo recently my pc of 8 years started getting small burning smells and started not being able to hold a stable overclock. Given that it's likely the psu or the motherboard, and given the current shortages/used market prices, I decided to finally upgrade after managing to get about $500 from friends and family.\n\nOnly problem? Because I genuinely cannot afford to set aside any other money for this, I have to kind of get creative with my build setup. My pc space only has about 2 feet squared of space next to it so I had a mini-itx build for a long time. Unfortunately, I tried pricing out all kinds of mini itx builds so I could reuse my case but all of them were way over budget. Then I tried looking at what kind of cases were available for my uses but every single one would go over the budget I had and I didn't want to sacrifice the psu quality/upgrade paths or the ram which I need for a few projects I'm working on (blender, handbrake, video editing, etc) so that wasn't an option either. \n\nIn my parents' old house, I saw they had one of those small couch dinner tables they were planning on throwing out and suddenly got an idea. After test-fitting it in the space of my pc, I realized it would fit perfectly. Now my new plan is to just build an open-air test bench where I would just run the pc on my motherboard box but also at the same time use the front IO and optical drive of my old case. \n\n**The Plan:**\n\nSo I have the couch table next to my tiny desk, the case on my desk, and the computer would be placed on top of the motherboard box on the table. The case I have is a Corsair 250D mini itx cube, and the side panels are able to be put on in a way where they aren't flush with the case. This leaves *just* enough room for a few cables to come out. My plan was to get a cheap set of front IO extension cables, route them through the side of the case through that small opening, connect them to my motherboard, then connect my hdd and optical drive through a small hole in the bottom of the case at the front. I checked the sizing and it's just enough room to pass through a couple sata cables and power cables. Then I would \"mount\" the ssd on the side of the motherboard box using some velcro or similar, let the gpu be free-standing (horrible idea, but I will get a brace for it when I can), and get a longer monitor cable for my gpu to connect it to my monitor since my setup would likely see the rear of the gpu facing forward rather than back. [Here's an extremely crude visualization of what I had in mind.](https://i.imgur.com/m6WcqFy.png) Note that I can fit the psu on the table too but it would be behind the motherboard and I didn't have a good way of showing that/was too lazy to mess with layers in GIMP. \n\n**The Unsure Of Myself**\n\nIs there anything I'm not considering in this? I won't have a direct way to cool the VRMs given the lack of case airflow, I assume this will get dusty over time, and the entire thing will be pretty fragile overall. Given that the only thing my local microcenter has within my budget are 3600s, this is pretty much my only option after researching this for about week. Moreover, I can't find any good used deals in my area or online or else I would have immediately turned to that given how many used parts I've purchased in the past. Is there anything you guys think I'm missing?\n\nBuild below, based on my local microcenter's prices\n\n[PCPartPicker Part List](https://pcpartpicker.com/list/KHmNsX)\n\nType|Item|Price\n:----|:----|:----\n**CPU** | [AMD Ryzen 5 3600 3.6 GHz 6-Core Processor](https://pcpartpicker.com/product/9nm323/amd-ryzen-5-3600-36-thz-6-core-processor-100-100000031box) | $199.99 \n**Motherboard** | [Gigabyte B450 AORUS M Micro ATX AM4 Motherboard](https://pcpartpicker.com/product/WcjJ7P/gigabyte-b450-aorus-m-micro-atx-am4-motherboard-b450-aorus-m) | $54.99 \n**Memory** | [G.Skill Ripjaws V Series 32 GB (2 x 16 GB) DDR4-3200 CL16 Memory](https://pcpartpicker.com/product/kXbkcf/gskill-memory-f43200c16d32gvk) | $118.99 \n**Storage** | [Samsung 860 Evo 500 GB 2.5\" Solid State Drive](https://pcpartpicker.com/product/6yKcCJ/samsung-860-evo-500gb-25-solid-state-drive-mz-76e500bam) | $54.99 \n**Storage** | [Western Digital Caviar Blue 1 TB 3.5\" 7200RPM Internal Hard Drive](https://pcpartpicker.com/product/MwW9TW/western-digital-internal-hard-drive-wd10ezex) | Purchased For $0.00 \n**Video Card** | [MSI GeForce GTX 660 Ti 2 GB Video Card](https://pcpartpicker.com/product/mmw323/msi-video-card-n660ti2gd5oc) | Purchased For $0.00 \n**Power Supply** | [Corsair CXM 650 W 80+ Bronze Certified Semi-modular ATX Power Supply](https://pcpartpicker.com/product/R2mxFT/corsair-power-supply-cp9020103na) | $89.99 \n**Optical Drive** | [LG UH12NS40 Blu-Ray Reader, DVD/CD Writer](https://pcpartpicker.com/product/QC648d/lg-uh12ns40-blu-ray-reader-dvdcd-writer-uh12ns40) | Purchased For $0.00 \n | *Prices include shipping, taxes, rebates, and discounts* |\n | **Total** | **$518.95**\n | Generated by [PCPartPicker](https://pcpartpicker.com) 2020-12-27 00:00 EST-0500 |\n\nThanks in advance y'all. I've been a part of this community since mid 2012 and you guys have been amazing the entire way."], "2020-12-28": ["Eye care is a topic most people know nothing about. Sure, we all know that you buy glasses when you're unable to see,  [revision capsules review](https://apnews.com/press-release/ts-newswire/nutrition-north-america-lifestyle-health-eye-health-b0864b27d689bbb5c72b10a054e99854)  but what more is there? If you want to learn all about caring for your eyes the right way, the tips and tricks found in this article will be sure to help you out.\n\nYou should wear sunglasses as often as possible. Sunglasses are more than just a fashion statement, they're a source of much-needed protection from the sun. Sunglasses block Ultra-Violet radiation, which can cause serious and long-term damage to the eye. Sunglasses can even prevent wrinkles and cancer from forming around the eye!\n\nWear sunglasses to help keep your eyes protected from sun light. Keep ones that have really good UV safety features with you at all times. The sun can injure your eyes and the delicate skin which surrounds them. Do not take risks with your eyes.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/h1e8vol71v761.png?width=300&amp;format=png&amp;auto=webp&amp;s=2992e5649f9d238b1fdea6198d80c11b9ebf91dc\n\nDon't smoke. You probably already know that there are many serious dangers related to cigarette smoking. One of the less-known dangers is developing Age-related Macular Degeneration(AMD). Several scientific studies have shown that the patients who did smoke were much more likely to develop AMD than those who didn't smoke. Just another reason not to start smoking or to quit today.\n\nWhen selecting an eye care  [improve eye vision](https://www.webmd.com/eye-health/features/natural-vision-correction-does-it-work#1)  professional, do not skimp when it comes to doing your homework on each prospective doctor's qualifications. Check their educational background, certifications and licensure to ensure that everything is as represented. Doing these things will help you feel confident when it comes to entrusting the health of your eyes to someone new.\n\nDrink plenty of water to keep your eyes hydrated. Your eyes are made mostly of water, and they need to stay moist at all times to remain healthy. Dry eyes are more prone to eye problems and diseases. Keeping your body fully hydrated will ensure that your eyes stay moisturized.\n\nWhat you consume effects your eye health. Look for foods with vitamin C and E, as well as foods that have zinc and omega-3 fatty acids. They can ward off things like macular degeneration and cataracts. You can consume foods such as beans, nuts, tuna, salmon and oranges which all have these healthy nutrients.\n\nDon't strain the eyes for too long. When you strain your vision and focus on something, such as a computer or television screen, you typically forget to blink as much as you should. When you don't blink enough, it means your eyes are getting the lubrication they need, which can lead to more serious problems.\n\nIf you suffer from dry eyes, this can be painful. You may want to try a high quality saline drop. In addition, little things, such as blinking, can increase tear production. Try to avoid using products that are filled with chemicals. Over time, these may actually worsen your dry eyes.\n\nWear good sunglasses.   [revision supplement review](https://apnews.com/press-release/ts-newswire/nutrition-north-america-health-eye-health-dietary-supplements-1f9a700a2f57a435bac6898a08434671)  This helps keep the UV rays from harming your eyes when out in the sun. Choose a pair that blocks 99 to 100 percent of both UVA and UVB rays. If you enjoy driving, polarized lenses are important. They also help you reduce glare. Sunglasses are still a good idea, even with the right contacts.\n\nIf you are a smoker, butt out! Of course, smoking will lead your eyes to yellow and the skin around them to wrinkle and thin. On top of that, smoking is linked to a high risk of macular degeneration, cataracts and even damage to the optic nerve, all of which can lead to blindness.\n\nAre you now prepared to care for your eyes to ensure they support you for many more years? If so, take these tips and use them to make changes in your life. The sooner you better your eye care agenda, the better the results will be once you implement it."], "2020-12-29": ["Geforce gtx 1660  , amd ryzen 3 3100 4-core, 16 gb ddr4 ram , A520 mobo , 500 w psu.  I wanna upgrade graphics for better performance but dont know where to start. Any help much appreciated."], "2020-12-30": ["v6.1\n\nno addons\n\nhost os w10\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nFailed to open a session for the virtual machine **windows 8.1 64**.\n\nNot in a hypervisor partition (HVP=0) (VERR\\_NEM\\_NOT\\_AVAILABLE).\n\nAMD-V is disabled in the BIOS (or by the host OS) (VERR\\_SVM\\_DISABLED).\n\nResult Code: E\\_FAIL (0x80004005)Component: ConsoleWrapInterface: IConsole {872da645-4a9b-1727-bee2-5585105b9eed}"], "2020-12-31": [], "2021-01-01": ["Hello [r/davinciresolve](https://www.reddit.com/r/davinciresolve/)! Welcome to the first official FAQ/FAQ Friday of 2021! I'm doing these to help people with common questions, the \"dumb\" questions you're afraid to post (there are no dumb questions, trust me), and *slowly* get enough feedback/input to make a wiki!\n\nOf course, I can't (and shouldn't) be writing this alone, so please tear apart what I've written, ask any questions, offer your favorite resources/tips, and help make it a useful resource for everyone.\n\nThis week's post is about the differences between the Free and Studio versions of Resolve. It's more of a list of what's \"locked\" to the Studio version - if you've got more information or thoughts on how this should be better organized, feedback is, as always, appreciated. (Sources cited at the end, for further reading)\n\n**Note on v17:**\n\nVersion 17 is still in a public beta. Bugs are to be expected. It's strongly suggested that you start with 16 if you rely on Resolve for professional/paid work, or you're just starting out. Some exciting new tools are included in Resolve 17, and they're noted as being specific to 17 where applicable.\n\n# Media Importing and Processing\n\n* Deinterlacing\n* 3:2 Pulldown\n* Face Detection\n* 10-bit H.264/H.265 Codec Importing\\*\\*\n* GPU Accelerated Encoding/Decoding of H.264 and H.265 on Windows; Import/Export of H.264 and H.265 on Linux\\*\\*\n* AMD-Accelerated H.264/H.265 Decoding Support^(+)\n* Multiple GPU support\\*\\*\\*\n\n# Editing Tools\n\n* Superscale\n* Speed Warp (Retime Algorithm)\n* Timeline creation using CPLs (v17 Studio only)\n* Smart Reframe (v17 Studio only)\n\n# OFX Plugins\n\n||||\n|:-|:-|:-|\n|Aperture Diffraction|Analog Damage|Automatic Dirt Removal|\n|Chromatic Adaptation|Chromatic Aberration|Color Stabilizer|\n|Contrast Pop|Deflicker|Dehaze|\n|Dust Buster|Face Refinement|Film Grain|\n|Lens Blur|Lens Distortion|Lens Flares|\n|Lens Reflections|Patch Replacer|Pencil Sketch|\n|Sharpen|Sharpen Edges|Soft Sharpen Skin|\n|Stylize|Warper||\n\n**Coming in v17:**\n\n||||\n|:-|:-|:-|\n|Detail Recovery|False Color|Motion Trails|\n|Noise Reduction|Smear|Texture Pop|\n\n* Improvements to Revival, some Blurs, and Film Grain OFX plugins\n\n# Color Page Tools\n\n* DCTL support\n* Spatial/Temporal Noise Reduction\n* Object Removal\n* Dolby Vision HDR\\*\n* Lens Correction\n* 3D Stereoscopic Tools\n* Remote Grading\n* Dust Removal\n* Magic Mask (v17 Studio only)\n\n# Fusion Tools\n\nIf somebody braver than I wants to read the 1581 pages dedicated to Fusion or spend hours in Resolve to find a comprehensive list of tools exclusive to the Studio version, please do share your findings. All I can offer offhand is 3D Camera Tracking is currently a Studio-only feature.\n\n[Fusion's got a dedicated comparison page between Fusion in Resolve and Fusion Studio.](https://www.blackmagicdesign.com/products/fusion/compare)\n\n# Immersive Audio Formats\n\n* Dolby Atmos Audio\\*^(+)\n* MPEG-H Audio^(+)\n* SMPTE ST.2098 Audio^(+)\n* Auro-3D Audio^(+)\n* B-Chain Audio^(+)\n\n# Rendering &amp; Exports\n\n* Render resolutions greater than 4K UHD\\*\\*\n* Remote Rendering\n* ProRes Rendering on Linux\\*\\*^(,) \\*\n\n# General Studio Features\n\n* Collaboration (subject to change with v17, which is still in beta)\n* [Frame.io](https://frame.io/) integration\n* Remote Scripting API Access (*Most* of the Python/LUA API is accessible from the console in Resolve, and this is more important for Fusion anyways.)\n* Video Clean Feed - fullscreen video playback on a GUI display without the need for a Decklink or UltraStudio and a broadcast monitor.\n\n# Sources, Asterisks, and Further Reading\n\n**Sources**\n\nThe only *official* document I could find is for [v15, but most of it's the same.](https://documents.blackmagicdesign.com/SupportNotes/DaVinci_Resolve_15_Feature_Comparison.pdf?_v=1523288400000)\n\n[Here's one article](https://www.toolfarm.com/tutorial/in-depth-davinci-resolve-studio-vs-the-free-version/) I found that lists most of the differences.\n\n[I checked every plugin in the Free version of 16 and screenshotted what works because I was too lazy to type it out.](https://imgur.com/a/R5L4aZ2)\n\n**Asterisks**\n\n\\*Separate licensing and/or additional hardware may be required\n\n\\*\\*[Supported Codecs Doc](https://documents.blackmagicdesign.com/SupportNotes/DaVinci_Resolve_16_Supported_Codec_List.pdf) offers more information on these\n\n\\*\\*\\*Except on macOS systems pre-built with 2 GPUs, apparently - you get 2 and then need Studio.\n\n^(+)Source is [v16 New Features Guide](https://documents.blackmagicdesign.com/SupportNotes/DaVinci_Resolve_16_New_Features_Guide.pdf?_v=1554708600000)\n\n**Further Reading**\n\n[An older article from Mixing Light on buying Studio from the Mac App Store vs. Dongle/License-based versions.](https://mixinglight.com/color-grading-tutorials/davinci-resolve-studio-on-the-mac-app-store-what-you-need-to-know/)\n\n[**Previous FAQ Fridays**](https://www.reddit.com/r/davinciresolve/?f=flair_name%3A%22FAQ%20Friday%22)"], "2021-01-02": ["this is my first build i am very new to pc stuff and i just wanted some advice because i’m not sure if everything is compatible also is there a better motherboard to get thanks in advance \n\n[PCPartPicker Part List](https://pcpartpicker.com/list/GVYf2V)\n\nType|Item|Price\n:----|:----|:----\n**CPU** | [AMD Ryzen 5 3600 3.6 GHz 6-Core Processor](https://pcpartpicker.com/product/9nm323/amd-ryzen-5-3600-36-thz-6-core-processor-100-100000031box) | $194.99 @ Newegg \n**Motherboard** | [ASRock B450M PRO4 Micro ATX AM4 Motherboard](https://pcpartpicker.com/product/dQgzK8/asrock-b450m-pro4-micro-atx-am4-motherboard-b450m-pro4) | $82.99 @ Amazon \n**Memory** | [G.Skill Ripjaws V 16 GB (2 x 8 GB) DDR4-3600 CL16 Memory](https://pcpartpicker.com/product/jBZzK8/gskill-ripjaws-v-16-gb-2-x-8-gb-ddr4-3600-memory-f4-3600c16d-16gvkc) | $88.99 @ Newegg \n**Storage** | [Samsung 970 Evo 500 GB M.2-2280 NVME Solid State Drive](https://pcpartpicker.com/product/P4ZFf7/samsung-970-evo-500gb-m2-2280-solid-state-drive-mz-v7e500bw) | $64.99 @ B&amp;H \n**Storage** | [Seagate Barracuda Compute 2 TB 3.5\" 7200RPM Internal Hard Drive](https://pcpartpicker.com/product/mwrYcf/seagate-barracuda-computer-2-tb-35-7200rpm-internal-hard-drive-st2000dm008) | $54.99 @ Newegg \n**Video Card** | [MSI GeForce GTX 1660 Ti 6 GB GAMING X Video Card](https://pcpartpicker.com/product/K8fhP6/msi-geforce-gtx-1660-ti-6-gb-gaming-x-video-card-gtx-1660-ti-gaming-x-6g) | $479.98 @ Amazon \n**Case** | [NZXT H510 ATX Mid Tower Case](https://pcpartpicker.com/product/b7hmP6/nzxt-h510-atx-mid-tower-case-ca-h510b-b1) | $69.98 @ Amazon \n**Power Supply** | [EVGA BQ 600 W 80+ Bronze Certified Semi-modular ATX Power Supply](https://pcpartpicker.com/product/DmWrxr/evga-bq-600w-80-bronze-certified-semi-modular-atx-power-supply-110-bq-0600-k1) | $78.98 @ Amazon \n**Wireless Network Adapter** | [TP-Link TL-WN881ND PCIe x1 802.11a/b/g/n Wi-Fi Adapter](https://pcpartpicker.com/product/Chh9TW/tp-link-wireless-network-card-tlwn881nd) | $17.98 @ Amazon \n | *Prices include shipping, taxes, rebates, and discounts* |\n | **Total** | **$1133.87**\n | Generated by [PCPartPicker](https://pcpartpicker.com) 2021-01-01 23:58 EST-0500 |"], "2021-01-03": ["Hi all, I am struggling with crashes and looking for some troubleshooting advice.\n\nRecently I've been struggling with crashes during all sorts of gaming. Crashes will usually result in the screen freezing, becoming unresponsive, and then a black screen for a moment, followed by the PC searching for my monitor as if it is looking for hardware, and when found, I return to desktop. Sometimes, the crash is severe enough that it does not find the monitor and a reboot is initiated after about 30 seconds (my guess is that the GPU fails, but then fails to restart).\n\nIt only seems to occur with certain games that are \"newer\" (Rust, Star Wars Battlefront II) but spares some games that are older (Company of Heroes). \n\nCiv VI was also a crash causer, but after lowering settings to minimum I haven't experienced any crashes (even though on max settings I run said game comfortably FPS, just unpredictable crashes). I can't seem to determine which individual setting could be the culprit.\n\nI adjusted the settings for other games with no luck.\n\nI have tried the following:\n\n\\-Ensuring the GPU drivers are the most up to date\n\n\\-Downloading and using nVidia GE Force Experience\n\n\\-Changing PCI Express -&gt; Link State Power Management to \"Off\"\n\n\\-Switching off Vsync\n\n\\-Switching to DX12 in supported games (and then back to DX11 after this didn't seem to resolve anything)\n\n\\-Virus scans\n\n\\-\"Rolling back\" drivers in the device manager, and then reinstalling drivers\n\n\\-Using DDU to remove all drivers in safe mode, and then reinstalling drivers directly from nVIDIA and not Windows update\n\nStill no luck. I do not see large fluctuations in power use or temperature when I am playing. Games that  I used to run for hours 60+ FPS now crash frequently. I built this PC in August and this only became an issue \\~November, with no major software/hardware changes.\n\nI posted this in BuildaPC reddit, and was advised to just completely reinstall windows - I'd prefer not to do this but I will if I have to.\n\nI have crash logs for Civ VI and SW Battlefront II, and can probably get them for Rust, but I have no idea how to open them. I can also post my DxDiag if that is of any use. Any advice?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n [PCPartPicker Part List](https://pcpartpicker.com/list/Dw7Fcq)\n\n|Type|Item|\n|:-|:-|\n|**CPU**|[AMD Ryzen 5 2600 3.4 GHz 6-Core Processor](https://pcpartpicker.com/product/jLF48d/amd-ryzen-5-2600-34ghz-6-core-processor-yd2600bbafbox)|\n|**Motherboard**|[Gigabyte B450M DS3H WIFI Micro ATX AM4 Motherboard](https://pcpartpicker.com/product/HQVG3C/gigabyte-b450m-ds3h-wifi-micro-atx-am4-motherboard-b450m-ds3h-wifi)|\n|**Memory**|[Team T-FORCE VULCAN Z 16 GB (2 x 8 GB) DDR4-3200 CL16 Memory](https://pcpartpicker.com/product/JmyV3C/team-t-force-vulcan-z-16-gb-2-x-8-gb-ddr4-3200-memory-tlzrd416g3200hc16cdc01)|\n|**Storage**|[Western Digital Blue SN550 1 TB M.2-2280 NVME Solid State Drive](https://pcpartpicker.com/product/BhmFf7/western-digital-blue-sn550-1-tb-m2-2280-nvme-solid-state-drive-wds100t2b0c)|\n|**Video Card**|[Asus GeForce GTX 1650 SUPER 4 GB TUF GAMING OC Video Card](https://pcpartpicker.com/product/DNyqqs/asus-geforce-gtx-1650-super-4-gb-tuf-gaming-oc-video-card-tuf-gtx1650s-o4g-gaming)|\n|**Case**|[MUSETEX Phantom ATX Mid Tower Case](https://pcpartpicker.com/product/RYmFf7/musetex-phantom-atx-mid-tower-case-903-s6)|\n|**Power Supply**|[EVGA 600 W 80+ Certified ATX Power Supply](https://pcpartpicker.com/product/4FH48d/evga-600w-80-certified-atx-power-supply-100-w1-0600-k1)|\n|Generated by [PCPartPicker](https://pcpartpicker.com) 2021-01-02 23:54 EST-0500||"], "2021-01-04": ["Host: Manjaro \nGuest Win 10\nVM gpu: radeon 6800\nHost: nvidia 1650\nMobo: msi x570 edge wifi\nCPU: Ryzen 2700x\n\nWith the GPU running in hidden state the driver finishes installing but when I reboot the VM black screens. No option to live boot into it. Everything up to date\n\n\nIs anyone else experiencing this and are theyre any fixes available?"], "2021-01-05": ["AMD Ryzen 9 5950X new, sealed in box, asking for $1050 + shipping.\n\nLocal cash preferred.\n\nWill add timestamp later."], "2021-01-06": ["AMD AM4 Ryzen 7 3700X Eight Core 3.6GHz 65W CPU 100-100000071BOX\t\t\n\nCooler Master A71C AMD RGB CPU Cooler RR-A71C-18PA-R1\t\t\n\nGigabyte AM4 Mini-ITX B450 I AORUS PRO WIFI DDR4 Motherboard\t\t\n\n16GB DDR4 G.Skill (2x8GB) 3200Mhz Aegis RAM F4-3200C16D-16GIS\t\t\n\n500GB Crucial MX500 2.5\" SATA SSD Drive PN CT500MX500SSD1\t\t\n\n1TB Seagate 3.5\" 7200rpm SATA 6Gb/s \nBarraCuda HDD PN ST1000DM010\t\t\n\nMSI RTX3060Ti 8GB VENTUS 2X OC PCIe Video Card\t\t\n\nMSI ATX MAG VAMPIRIC 100R RGB Tempered Glass Mid Tower Black Case (No PSU)\t\t\n\n650 Watt Cooler Master MWE Power Supply MPE-6501-ACABW-AU\t\t\n\nIntegrated Sound Card\n\t\t\nIntegrated Network Connection\n\t\t\nIntegrated WiFi\t\t\n\n80mm Deepcool Case Fan"], "2021-01-07": ["A friend of mine put together a new gaming PC built Winter of 2020. Specs are:   \nAMD 5600x  \nEVGA RTX 3080 FTW Ultra  \nSamsung 980 Pro NVMe SSD  \n 32GB DDR4 Gskill memory.  \n\n\nHe played the game for awhile on his laptop on low to medium settings perfectly fine no errors and crashes.  His new PC is much more powerful yet cannot get past the lobby screen. The game crashes and reboots the PC every time he launches the game about 15-30 secs in.  There is no BSOD and no Windows error reports.  This is the ONLY game out of the 20 games (including Division 1)  he tried in his library that is giving me issues. Below are the list of things tried according to what other people did to fix the crashing.  All troubleshooting below resulted in the same type of crashing.    \n\n\n1) Turned off all overclocks and reformatted with only windows updates and graphics drivers = Crash followed by reboot   \n2) Copied the whole functioning game from the laptop(works on laptop) along with the user settings = Crash followed by reboot   \n3) Latest GPU drivers, Latest updates, Verified game files, DX12 off using DX11 = Crash followed by reboot   \n4) Changed the compatibility settings to Run as Admin and Disable fullscreen optimization, and High Scaling DPI override = Crash followed by reboot   \n5) Lowered the Graphics settings and changed the virtual memory to higher levels = Crash followed by reboot   \n6) Installed all of the from 2008-2019 Microsoft Visual C++ and . net Framework = Crash followed by reboot   \n7) Reformatted 1-3 times = Crash followed by reboot   \n8) Checked firewall settings and allowed game client, uplay, and EasyAntiCheat through = Crash followed by reboot\n\n&amp;#x200B;\n\nAny help is appreciated. Thank you!"], "2021-01-08": ["I have a AMD Radeon 5700xt and Ryzen 3700x. My monitor isn't allowing me to select black equalizer, Aim Stabilizer. Contrast, color vibrance, sharpness, Gamma Color temperature, low blue light, dynamic contrast or senseye demo. When I first got my monitor they all were adjustable, but now they are not. I have no idea what I'm doing, just trying to see if I missed some easy setting that is making my monitor act this way. If someone has any idea, I will see if it works! Thank you in advance haha"], "2021-01-09": ["Hey guys, first post on reddit ever. I am putting together my first ever PC as my previous one came pre-built and just isn't doing the job anymore. I work from home so I really need a PC that is of high performance, runs smoothly/quickly and being a gamer something that allows me to play on the best settings possible without an issue (inc. screen resolution and framerate).\n\nI already have a PC guy that is able to source majority of parts. I also have three monitors- 2x benq rl2755 and 1x 34\" asus rog strix XG35v.\n\nThis is the build I've put together myself already, which took me ages upon sifting through various reviews and comparisons. I like the build I’ve put together, I just don’t want to spend so much money on out-dated parts or potentially something that is better than what I’ve chosen as this isn’t my specialty. \n\n[PCPartPicker Part List](https://pcpartpicker.com/list/jLy33Z)\n\nType|Item|Price\n:----|:----|:----\n**CPU** | [AMD Ryzen 9 3950X 3.5 GHz 16-Core Processor](https://pcpartpicker.com/product/t7CFf7/amd-ryzen-9-3950x-35-ghz-16-core-processor-100-100000051wof) | $719.99 @ Amazon \n**CPU Cooler** | [Corsair H150i PRO 47.3 CFM Liquid CPU Cooler](https://pcpartpicker.com/product/brVD4D/corsair-h150i-pro-473-cfm-liquid-cpu-cooler-cw-9060031-ww) | $349.00 @ Amazon \n**Motherboard** | [Asus ROG Strix X570-E Gaming ATX AM4 Motherboard](https://pcpartpicker.com/product/CLkgXL/asus-rog-strix-x570-e-gaming-atx-am4-motherboard-rog-strix-x570-e-gaming) | $319.00 @ B&amp;H \n**Memory** | [G.Skill Trident Z Neo 32 GB (2 x 16 GB) DDR4-3600 CL16 Memory](https://pcpartpicker.com/product/w3FKHx/gskill-trident-z-neo-32-gb-2-x-16-gb-ddr4-3600-memory-f4-3600c16d-32gtznc) | $204.99 @ Newegg \n**Storage** | [Western Digital SN750 500 GB M.2-2280 NVME Solid State Drive](https://pcpartpicker.com/product/KTQG3C/western-digital-sn750-500-gb-m2-2280-solid-state-drive-wds500g3x0c) | $69.99 @ Adorama \n**Storage** | [Samsung 850 EVO-Series 1 TB 2.5\" Solid State Drive](https://pcpartpicker.com/product/RbvZxr/samsung-internal-hard-drive-mz75e1t0bam) | $196.55 @ Amazon \n**Video Card** | [MSI GeForce RTX 3070 8 GB GAMING X TRIO Video Card](https://pcpartpicker.com/product/WRrYcf/msi-geforce-rtx-3070-8-gb-gaming-x-trio-video-card-rtx3070gamingxtrio) | $1149.99 @ Amazon \n**Case** | [Lian Li PC-O11 Dynamic ATX Full Tower Case](https://pcpartpicker.com/product/VxRzK8/lian-li-pc-o11dw-atx-full-tower-case-pc-o11dw) | $159.98 @ Newegg \n**Power Supply** | [EVGA G2 650 W 80+ Gold Certified Fully Modular ATX Power Supply](https://pcpartpicker.com/product/9q4NnQ/evga-power-supply-220g20650y1) | $197.98 @ Amazon \n**Case Fan** | [Corsair LL120 43.25 CFM 120 mm Fans 3-Pack](https://pcpartpicker.com/product/8KFXsY/corsair-ll120rgb-led-4325-cfm-120-mm-fans-3-pack-co-9050072-ww) | $129.99 @ Best Buy \n | *Prices include shipping, taxes, rebates, and discounts* |\n | **Total** | **$3497.46**\n | Generated by [PCPartPicker](https://pcpartpicker.com) 2021-01-08 23:54 EST-0500 |\n\nAppreciate your help guys- thank you!\n\nps: budget of ~$3.5k"], "2021-01-10": ["I chose the wrong time. I managed to get a cpu but I haven't been able to get a gpu yet. I want an AMD 6800 or 6800xt but they sell out so fast. Times are tough I guess."], "2021-01-11": ["Hello gents,\n\n I'm thinking on replacing my GTX 980, I confess I\\`m inclined to purchase another NVIDIA card (3070) but need more opinions since I should go with a Radeon 6800 considering that I'm probably getting a AMD Ryzen 9 3900 around May next year and the shared memory featured seens interesting.\n\nI will mostly game in 1440p (PC) or at 1080p (streamed to my TV).\n\nAny options would be appreciated :)"], "2021-01-12": ["So I've just bought all the parts for my new pc, all of them are here minus the case and gpu. Gpu because it's out of stock. Currently I have a gtx 950, the new gpu will be a rx 5700 xt. Is it fine to use the 950 in my new build until the new gpu comes in? This way I could use the new pc until the the gpu comes back in stock, but I'm not sure if there are any software issues with this. My dad thinks it could mess with the DLL files, but we're not sure. Thanks for any help."], "2021-01-13": ["Here's the problem. Pops feeling really low nowdays. He haven't slept for 3 nights now all the stress and few fights verbally have probably on his mind. The problem is that my pops was victim of abusive family not parents but his brother was control freak 2/3 property on his name and other on grandparents name. After constantly being belittled he is insecure. I could have had brother ans a sister but they both died before I was born. And that also may have keep toll on him. Mum was very supportive and took stand to my dad. Mum was also not secure to this toxic ass family. Dad's bhauju yes that control freaks wife was too the same always making mum do work. Aunt always had her way through word and social butterfly had control and could get away though not doing work cheating. Mum dad to do most work and she I think didn't mind the worl too the problem was she was not appreciated partly maybe due to death of her children.\n\n\nFast forward to now. We have equalish share of property. 1/3 to all uncle tahba and dad but. The psychological toll is still there now more emersive. Father has been struggling on his self worth. Takes offensive to smallest things not showing through anger but belittling himself. Insecure and have to be man of the house, constantly wants to pease everyone and he think and says we need everyone. I agree but this makes him succeptible to manipulation this my mum says sometimes. He always defends his mates and fails to see they are there because my pops pays for food ams stuffs amd are for benifits. That is what my mum tells. Majority of income is through rent so he thinks he is not enough. Whenever someone compliments him he is way appreciative exposes all his problems to them showed all properties and everything to them. Lied to us many times. He fails to see the bigger picture. Mum adressed all these problems to him he said my life I want to live however I want you don't have a saying. To that mum tightened finances. Pops lied to her wanting to spend more maybe due to envy seeing splurge even though being not being on the condition to do so(bad financial decisions). Mum had thick skin and she is the one keeping the house on control but past had taken a large toll on her too. One time things came up to divorce because my dad felt we were controlling. But only thing we said were to be honest with us still he lied on many things we came to find out.\n\n\nRecently this week or so he isn't having proper sleep. Maybe guilt maybe realization. But he said he needs professional help. I am so glad he said so. He says he's don't nothing bad. Maybe realized his friend group was bad influence. Maybe insecurities. Maybe ambition.\n\n\nI mean noone is perfect these past few months nothing to distract from events and work. These past problems are seemed more apparent bigger than I thought. \n\n\nRecommend psychiatrist and marriage counselor!!!"], "2021-01-14": ["Guys Im trying to quit doing cocaine.\nIn good moments I want to party, in bad maybe I want to lift my mood up.\nThese up and downs are killinkg my brhavior.\nFor this reason I bought some xanax (origignal lfizer 1mg)\nBut I cant control my self I usually finish it very quickly, like 1 blister (10 pils 1mg) before bed or during the night just to chill amd try to stay away from cocaine.\nIs it damgerous. In your opinion guys what vould be the most effective dosage for a 24 male... Im confused.. because it doesent hit me soo hard.. soo I keep poppin pills.. please I need advices.\nThnks folks &lt;3"], "2021-01-15": ["So first off Im 32 amd my girl is 24, one night after some shots we got to talking about sexual fantasies and she let it slip that she always wanted a gangbang. Few weeks go by and we get to talking one night and I told her it would be very hot to watch her with another man. Boy, she took the idea and ran with it 100%. The next day I was posting an add on DL for another man to join her in the bedroom. So, few weeks of them talking she decided to meet him and have him over for drinks. The man was definitely the alpha type and took control of the situation. Slowly grabbing her leg and hand, finally he just leans in and kisses her. My girl turns to me to see if I reacted and I had the biggest grin on my face and my cock was rock hard. She starts making out with him and climbs on top of him. Few moments later he was sucking on her huge tits and rubbing her pussy through her jeans. I was just watching this event unfold still not believing it was real. He took her to our bedroom and she revealed her lingerie (which she has only worn once for me in 6 months) and started touching her everywhere. He started to finger her, pretty violently in my opinion but she was losing it. I couldnt believe that he made her squirt, a feat I have never accomplished. He stood up and she undid his pants and starts blowing him. The guy was fairly large and thick, Im only 5-5.5\" myself and he had some length on me. She bends over in front of him a few minutes later and he starts fucking her, without a condom. I couldn't fathom this and within a few moments I covered in my own cum. He was tossing and turning her in all positions and at one point was spanking her with his belt so hard that it left bruises. Eventually after what seemed like forever he came in her mouth, she swallowed it, and kissed me afterwards. He got dressed and was out the door within minutes. I can't wait for their next encounter."], "2021-01-16": ["so I'm at a point where I'm working on possible upgrades to [my pc](https://pcpartpicker.com/user/cartime99/saved/3nYTYJ). my original intent was to switch to AMD and almost completely [rebuild my computer](https://pcpartpicker.com/user/cartime99/saved/7GskJx). but I recently thought that maybe [I should actually compare a 10900k to a 5950x.](https://cpu.userbenchmark.com/Compare/Intel-Core-i9-10900K-vs-AMD-Ryzen-9-5950X/4071vs4086)  To me, it seems like the 10900k isn't very far if at all behind the 5950x. I've also read that intel plans to release their 11th gen soon with a 10nm process. so I'm wondering if the 11900k might win intel back. I'm almost certain they're going nowhere till they release 7nm."], "2021-01-17": ["i can't seem to download radeon adrenalin. i was able to installed radeon before my PC was reformat (it was reformat because my PC keeps turning off and restarting) My processor is AMD A10-5800K with Radeon(tm) HD Graphics. Edition is windows 10 pro. 64 bit. Version is 20H 2. After reformatted. i open the radeon setup. this pop up comes up. This App Can't Run On Your PC. To find a software for Your PC. check with the software publisher"], "2021-01-18": ["I'm building the ultimate ROG setup but struggling to decide on the GPU... I mostly use my computer for work, lots of tabs and programs open. But, I am planning to get into gaming a bit with this build and also do some video editing. \n\nRight now I'm planning:\n\nAsus Crosshair VIII Dark Hero - motherboard \nAMD Ryzen 9 5950X - CPU\nASUS Strix Helios - tower case \nG.Skill Trident Z Nero 64GB DDR4-3600MHz CL14\nSamsung 980 Pro\n\nI already have the Samsung 49\" G9 monitor - 5120 x 1440 resolution at 240 Hz 1ms response time \n\nThe monitor does have G-Sync and FreeSync Premium Pro. \n\nI'm struggling to decide between Nvidia and AMD. \n\nI really like the look and cooling of the ASUS Strix. So leaning towards and debaiting between  RTX 3080 or RX 6800 \n\nOn one side I'm thinking the faster VRAM (Nvidia) will benefit me on work stuff. \nOn the other side more VRAM (AMD) feels better for years to come, better for my current monitor, and better for games in the future. \n\nOr screw it all, future proof this bad boy and go RTX 3090 (complete overkill for my purposes 😂 and obv way more money that I may never benefit from) \n\nAnother option I'm leaning towards too is the Red Devil RX 6900 XT. Love the look, would probably vertically mount that.\n\nOpen to other options too, just want really good cooling. Just looking for opinions. Thanks in advance!"], "2021-01-19": ["BNIB Sealed AMD Ryzen 5 5600x\n\n[https://imgur.com/a/4cNyCf8](https://imgur.com/a/4cNyCf8)\n\n-----\n\nLocal (90012) - $350\n\nShipped - $370"], "2021-01-20": ["Hello everyone! After quite a lot of research, I've managed to put together my first build, and I was wondering if I could get some thoughts on my part choices, if any of them have better upgrades for the same price or are not necessarily compatible or something like that, I'm still pretty new so the learning/advice would be incredibly appreciated.\n\nI was aiming for a generally strong all-rounder gaming/work PC with some potential for stuff like content creation, wasn't looking to go very over the top with power but enough that it'll last me a good few years and be able to run most games on higher settings. Currently only own the CPU and SSD and I might reuse my old hard drive. Of course finding the GPU is going to be the big hurdle and I still have to figure out peripherals.\n\nBudget w/o peripherals is looking to be \\~1.3k to \\~1.4k\n\n[PCPartPicker Part List](https://pcpartpicker.com/list/q7yNW3)\n\n|Type|Item|Price|\n|:-|:-|:-|\n|**CPU**|[AMD Ryzen 5 5600X 3.7 GHz 6-Core Processor](https://pcpartpicker.com/product/g94BD3/amd-ryzen-5-5600x-37-ghz-6-core-processor-100-100000065box)|\\-|\n|**CPU Cooler**|[Deepcool GAMMAXX 400 Blue 74.34 CFM CPU Cooler](https://pcpartpicker.com/product/w3c48d/deepcool-gammaxx-400-blue-7434-cfm-cpu-cooler-deepcool-gammaxx-400-blue)|$24.99 @ Amazon|\n|**Motherboard**|[MSI B550-A PRO ATX AM4 Motherboard](https://pcpartpicker.com/product/7gxbt6/msi-b550-a-pro-atx-am4-motherboard-b550-a-pro)|$139.99 @ B&amp;H|\n|**Memory**|[Crucial Ballistix 16 GB (2 x 8 GB) DDR4-3600 CL16 Memory](https://pcpartpicker.com/product/2TFKHx/crucial-ballistix-16-gb-2-x-8-gb-ddr4-3600-memory-bl2k8g36c16u4b)|$86.99 @ B&amp;H|\n|**Storage**|[Samsung 860 Evo 1 TB 2.5\" Solid State Drive](https://pcpartpicker.com/product/yzfhP6/samsung-860-evo-1tb-25-solid-state-drive-mz-76e1t0bam)|$109.99 @ Adorama|\n|**Storage**|[Seagate Barracuda Compute 2 TB 3.5\" 7200RPM Internal Hard Drive](https://pcpartpicker.com/product/mwrYcf/seagate-barracuda-computer-2-tb-35-7200rpm-internal-hard-drive-st2000dm008)|$54.99 @ Newegg|\n|**Video Card**|[NVIDIA GeForce RTX 3060 Ti 8 GB Founders Edition Video Card](https://pcpartpicker.com/product/wvgQzy/nvidia-geforce-rtx-3060-ti-8-gb-founders-edition-video-card-900-1g142-2520-000)|\\-|\n|**Case**|[Lian Li LANCOOL II-X ATX Mid Tower Case](https://pcpartpicker.com/product/kRFKHx/lian-li-lancool-ii-x-atx-mid-tower-case-lancool-ii-x)|$97.98 @ Newegg|\n|**Power Supply**|[EVGA 600 W 80+ Certified ATX Power Supply](https://pcpartpicker.com/product/4FH48d/evga-600w-80-certified-atx-power-supply-100-w1-0600-k1)|$58.15 @ Amazon|\n|*Prices include shipping, taxes, rebates, and discounts*|||\n|**Total**|**$573.08**||\n|Generated by [PCPartPicker](https://pcpartpicker.com) 2021-01-19 23:57 EST-0500|||\n\n&amp;#x200B;\n\n Many thanks to any and all who comment :)"], "2021-01-21": ["Tomorrow I am taking out my RTX 2070 Super and popping in a rx 6900 XT. \n\nI play a lot of games on a 1080p monitor and have utilized DLSS to upscale my resolution to a higher quality. Does AMD allow cards to upscale as well as I’ve heard they don’t have DLSS specifically?\n\nOn call of duty modern warfare specifically I use it’s up scaling setting to bring me to higher resolutions. Will I be able to do the same with my new AMD GPU or is this DLSS as there is debate in my friend group as to whether this is a game specific setting or a DLSS enabled setting. \n\nI’m excited to use my new card! Just want to better understand the nuisances between the companies and what performance and applications I should use and look for! \n\nI am also adding a 5600x as well the very next day. Is there any setting I need to tweak for smart access memory or is enabled automatically. \n\nThanks for any and all help!"], "2021-01-22": ["hello, r/ph. need help deciding which laptop to buy. will  use it for mostly work. skype, zoom, browsing social media, watching videos, etc. thanks! \n\noption 1:\n\nLENOVO IP3-14ARE SLIM3 (81W30075PH) BUSINESS BLACK AMD RYZEN 7 4700U/8GB DDR4/512GB NVME SSD/AMD RADEON GRAPHICS/14\" FHD/WINDOWS 10 HOME SL 64BIT/WEBCAM/WIFI/BT/CARD READER/AUDIO PORT/USB 3.0/HDMI/LAPTOP\n\noption 2:\n\nHP 15S-EQ1117AU (1R8J4PA) ROSE GOLD AMD RYZEN 5 4500U/8GB DDR4/512GB NVME SSD/AMD RADEON GRAPHICS/15.6\" HD LED/WINDOWS 10 HOME SL 64BIT/WEBCAM/WIFI/BT/CARD READER/AUDIO PORT/USB 3.0/USB TYPE-C/HDMI/LAPTOP\n\noption 3:\n\nLENOVO IP3-15IIL SLIM3 (81WE00SQPH) BUSINESS BLACK INTEL CORE I5 1035G1/4GB DDR4/256GB M.2 NVME SSD+1TB HDD/INTEL UHD GRAPHICS/15.6\" FHD TN/WINDOWS 10 HOME SL 64BIT/WEBCAM/WIFI/BT/CARD READER/HDMI/LAPTOP\n\noption 4:\n\nASUS FX505DT-HN455T TUF GAMING GUN METAL AMD RYZEN 5 3550H/4GB DDR4/1TB HDD+256GB PCIE SSD/NVIDIA GEFORCE GTX1650 4GB GDDR5/WINDOWS 10 HOME SL 64BIT/15.6\" FHD IPS 144HZ/WINDOWS 10 HOME SL/WEBCAM/RGB BACKLIT KB/WIFI/BT/LAN/HDMI/ASUS TUF 15\"/17\""], "2021-01-23": ["So like sometimes (not that much) i tell her i go to like a social event or something or to hang oit with friends to seem like i have a life but i just lie amd play video games."], "2021-01-24": ["I am quite a noob in the PC building and PC hardware universe, but I do watch YouTube videos before buying parts for a computer.\n\nI saw many complaints about the Ryzen 7 5800x overheating, reaching oddly high temperatures that no other CPU in the same 5000 series gets to. I just saw thing called PBO2, Precision Boost Overdrive 2, which from my understanding should be a newer better version of PBO.\n\nIt supports 500 series chipset motherboard and 5000 series CPU's only( I think ). And in a particular video showcase I watched, the person was able to reduce a 5900x's temperature from 90 degrees (not safe) to 81 degrees (not safe, but safer) running a Cinebench benchmark, and reducing the voltage to the cores by around 0.05 - 0.10 ( I cannot remember the exact voltage), while achieving a higher school in the benchmark.\n\nI wonder if PBO2 could fix the heat issue that the Ryzen 7 5800x has, so it doesn't reach to 85+ degrees under any cooler you give it. Please discuss below, if anyone could test this and fix the 5800x heat issue, I am cancelling my order of the 5600x and getting an 5800x instead."], "2021-01-25": ["Looking for a AMD 5700 or 5700 XT.\n\nLet me know what you got."], "2021-01-26": ["Is it always recommended to instal drivers from asus website according to my laptop model? Or should i use nvidia/intel/amd websites ? \nI mean let's take nvidia driver for example. If i download the latest from nvidia website, i might have more features, but the driver asus provides on theirs must be tested better on my laptop."], "2021-01-27": ["[removed]"], "2021-01-28": ["I explored the map before the heist mission basically,  and pick up data shards.\nSo i pick upa assault in progress shard b4 the heist so now the mission won't end even i killed them all(after heist) since ot says kill perps amd secure evidence. \nWhat do i do? Did i waste a whole time of playing."], "2021-01-29": ["[removed]"], "2021-01-30": ["I bought 4 DDR4 4000mhz RAM's with profile X.M.P. 2 and when I activate the profile and set the level to 3 the memory still shows me 2139.39 in the bios.\n\nmy motherboard is a Gigabyte Aorus X570 PRO and my processor is an AMD Ryzen 7 3800X."], "2021-01-31": ["I am a poor guy who wants to make some buck from the soon to be ground road pigs. I thought I only had £80 however I found out in a survey app that allows you to stack 10% bonuses for every guy that joins because your link. If you fellow stonknomicists use this link, download and setup the app and leave it I could possibly be able to join in and put an extra $100 towards AMD using this. Would be greatly appreciated and would recommend you try this when you download the app\n\nCheck out Swagbucks! I use it to get free gift cards (to buy amc)! Click my link to join and fuck wallstreet into the ground:\nhttp://www.swagbucks.com/?cmd=sb-register&amp;rb=97406833&amp;cmp=197&amp;cxid=2003-app"], "2021-02-01": ["Buy AMD."], "2021-02-02": ["[removed]"], "2021-02-03": ["Just built a brand new system for my dad and it will not post. I have connected a speaker from my system (also a Gigabyte) and I don't hear any beeps, the PC just powers on, sits for a few seconds, then turns off. I also have no fanspin from the CPU fan, the only way I know it's on is the sound of the HDD.\n\nPart list:  \nRyzen 3 3600  \n16GB (2x8) Corsair Vengeance LPX @ 3200  \nGigabyte 1050ti (Refurbed)  \n   \nStrangely enough I was able to boot it after disconnecting my case fan but now it refuses to boot.  \nI did change the XMP profile, but that shouldn't have any effect should it?\n\nUnfortunately I don't have another AMD system (my system and my dad's old pc are both Intel), so I can't test anything other than GPU and PSU"], "2021-02-04": [""], "2021-02-05": [], "2021-02-06": [], "2021-02-07": ["Hi my new build will be used for productivity and 1440p 160hz gaming. I would like to get some feedback on the build and if anything could be improved without spending more.\n\nThe RTX 3070 and LG UltraGear monitor have already been bought.\n\nI am also looking for a dual monitor arm with usb in the stand. Both screens should be able to be moved in all directions. Does anyone have any recommendations for this?\n\nI wanted to get a 5900x, but the prices and stock has made my change my mind.\n\n|Components|\n|:-|\n|ASUS ROG Strix X570-E Gaming|\n|AMD Ryzen 7 5800X|\n|Gigabyte GeForce RTX 3070 Gaming OC 8G|\n|be quiet! Pure Base 500DX Zwart|\n|Noctua NH-D15 chromax.black|\n|VENGEANCE RGB PRO SL 32GB (4x8GB) DDR4 DRAM 3200MHz C16|\n|Corsair RM750 (2019)|\n|Samsung 980 Pro 1TB|\n|LG UltraGear 34GN850-B|\n\n&amp;#x200B;"], "2021-02-08": ["My rig originally has 4 gpus installed with updated drivers. I added 2 additional gpus (same brand and model) and when I checked the driver versions through device manager in windows, all have the same versions. Didn’t run amd software to update drivers before checking. I just want to know why this is the case."], "2021-02-09": ["Hello guys !\n\nI can finally upgrade one thing in my PC. I was thinking of a CPU since it's so important in this game. I was also thinking of something between a Ryzen 5 3500X and 5600X because of my GPU and MB. I have about 300-350€ budget and here's my specs :\n\nCPU: AMD Ryzen 5 2600\n\nGPU: AMD RX 580\n\nSSD: Crucial P5 3D NVMe PCIe M.2 1TB\n\nSSD: SanDisk SSD Plus 480GB\n\nHDD: WD WD10S21X-24R1BT0-SSHD-8GB 1TB\n\nRAM: Corsair Vengeance LPX DDR4 2400 C14 2x8GB\n\nMBD: MSI B450 GAMING PLUS\n\nAnd here's the latest benchmark just fyi [https://www.userbenchmark.com/UserRun/39613196](https://www.userbenchmark.com/UserRun/39613196) \n\nAny ideas or recommendations ? Thanks guys &lt;3"], "2021-02-10": ["I bought a 6800 thru a friend and installed it in my PC and as soon as I turned it on it started doing this (see video) [https://photos.app.goo.gl/UhXrf3msZBq7G2rn6](https://photos.app.goo.gl/UhXrf3msZBq7G2rn6)\n\n&amp;#x200B;\n\nAt first it did it the whole time. I remounted it, and tightened it in, and it fixed it for a bit. Then it started doing it, but only at startup, once windows is up, it's fine. There are no performance issues otherwise. Latest BIOS and drivers installed. Thinking it was the card, I RMA'd it. ASUS sent me a new one, and of course as soon as I put it in, it did it again. I fixed it at first by tightening the attachment screws. Now it's doing the whole BIOS is busted but windows is fine routine. I checked for damage on the slot, tried different pressure on the screws (it does screw in different compared to my old Vega 56) and it still does it randomly. Tried the second slot, but because of clearance issues (this card is like 2½ slots) i couldn't tighten it right. I still tried turning it on, and it was doing the same thing. I think, considering that when I change the way it is tightened it acts different I'm going to assume it's the size and awkward way it slits in that causes the issues. Still doesn't make sense why it works in windows. Tried all the back ports\n\nI don't have any crashes or other issues. Any help is much appreciated!\n\nAMD Ryzen 5600X\n\nMSI MPG X570 Gaming Plus\n\nCorsair Vengeance LPX 16GB (2x8GB) DDR4 3600 (PC4 28800)\n\nAsus Radeon TUF Gaming 6800\n\nCorsair Force MP600 M.2 2280 1TB\n\nbequiet! Dark Rock 4\n\nSeasonice Prime TX-750, 750W 80+ Titanium"], "2021-02-11": ["I have my twitch connected. When I start streaming it seems to work good, but the livestream shows nothing and I only get a \" **The video download was cancelled. Please try again. (Error #1000)\"** on my livestream on twitch. Meanwhile my stream in the live streaming section of Radeon Software says,   \n**\"Whoops! This embed is misconfigured. (Developers: Please check your browser console for more information)\"**\n\nI know my stream does not show up for anybody because my friend had joined and he says he gets the same message. \n\nAny ideas?"], "2021-02-12": ["I plan to build my first rig with 4 x 3060 ti and 2 x 3070. Total of 6 GPU. I’ve been doing a lot of research but still kinda lost. What’s a good/budget motherboard and cpu for 6 NVIDIA GPU? I assume I will need 2 PSU?\n\nIntel or AMD better on Nvidia gpu?\n\nAnd for OS, what’s a good OS for ETH mining that’s compatible with the motherboard suggested?\n\nThanks in advance!"], "2021-02-13": [""], "2021-02-14": ["I'm looking into getting a new laptop. I'm looking at a use-case of more general use, schooling when I am away from my tower PC, eventually possibly running Linux VMs (Cybersecurity Major, but not very far into schooling),  and light gaming-- Like playing WoW basically.\n\nJust looking at a couple of options, I know these prices are spread out a lot, but I'm trying to verify if I am just thinking I need more out of the laptop than I actually do.\n\n [Dell XPS 15 Laptop | Dell USA](https://www.dell.com/en-us/shop/dell-laptops/xps-15-laptop/spd/xps-15-7590-laptop/xn7590ebres) \n\n [Amazon.com: ASUS UX534FTC-AS77 ZenBook 15 Laptop](https://www.amazon.com/gp/product/B0869JVMLY/ref=ox_sc_act_title_1?smid=A32XZJ8Y7GNPDI&amp;psc=1) \n\n [ASUS ROG Zephyrus G14 14\" Laptop AMD Ryzen 7 8GB Memory NVIDIA GeForce GTX 1650 512GB SSD Eclipse Gray GA401IH-BR7N2BL - Best Buy](https://www.bestbuy.com/site/asus-rog-zephyrus-g14-14-laptop-amd-ryzen-7-8gb-memory-nvidia-geforce-gtx-1650-512gb-ssd-eclipse-gray/6403425.p?skuId=6403425) \n\nExpanding system ram and storage down the road is not something I'm worried about, I have a Dell G3 that I needed to install an m.2 in recently because its HDD was giving me a headache."], "2021-02-15": ["So every time I make chocolate chip cookies they always go flat. I follow the recipe, amd habe even tried minor alterations and different recipes but always the same. Does anyone have any suggestiins or know why they might be doing that. Ive had luck making them im the past but have lost whatever recipe I used back then."], "2021-02-16": ["I have a GeForce RTX 2070 Super and an AMD Ryzen 5 3600 6 core CPU. A few days ago almost out of nowhere, my game started to have major stutters. I’ve tried deleting unneeded files, re-downloading my latest gpu drivers, and lowering my graphics in game to the lowest settings, (and that’s barely scratching the surface) however none of these things have seemed to help my situation at all. I built my pc from scratch, and it’s only a few months old so I highly doubt there’s any problems with manufacturing. If anyone has any suggestions I’ll gladly take them. I just want to play the game how it’s supposed to be played again. Please help."], "2021-02-17": ["Hey guys, I’m building my first pc and I bought the Corsair 4000d (non airflow variant) as my case. I also bought the RTX 3080 and an AMD Ryzen 7 5800x. My question is the 4000d a good case for the parts I chose or should I shop around for another case?"], "2021-02-18": ["Which laptop is better not just for games. For overall performance. Like editing, programing etc.(gaming isn't only the main priority.)\nHp omen 15 amd 7 rtx 2060 vs hp omen i7 10th gen rtx 2060."], "2021-02-19": ["I’m looking for the build parts listed above. Just trying to upgrade my current PC and these are the parts I’m interested in. Go ahead and send me any offer you’re interested in and I’m down to entertain whatever you have to offer! I’m mobile so I don’t get notifications for chats, PMs preferred. Local is 77845. Please comment before messaging"], "2021-02-20": ["Computer Type: Desktop\n\nGPU: MSI GAMING X TRIO GeForce RTX 3090\n\nCPU: Ryzen 5950x\n\nMotherboard: Asus TUF GAMING X570-PLUS (WI-FI)\n\nBIOS Version: 2607\n\nRAM:  64GB GSKILL Trident Z RGB 3200Mhz\n\nPSU: Originally Apevia 1000W 80+ Gold, now Corsair RMx 850W\n\nCase: Thermaltake View 37, 2 intake 1 exhaust\n\nOperating System &amp; Version: WINDOWS 10 HOME Version 10.0.19042 Build 19042\n\nGPU Drivers: Latest NVIDIA Game Ready\n\nChipset Drivers: AMD X570 CHIPSET DRIVERS VERSION 2.13.27.501\n\nBackground Applications: Discord, Firefox, Medal\n\n-----\n\nOut of the box, it had thermal issues. The PC would crash to black screen in games and Cinebench stress tests. Investigation lead to checking thermal paste application, and there wasn't nearly enough, as well as the overclocking was too aggressive. I reapplied the paste, reset BIOS to \"optimized defaults\" and thermals improved.\n\nCrashes did not. Now when under load, it will, at some point, crash to black screen, but in these cases restart itself. I immediately thought a PSU issue, and acquired the Corsair PSU that sits in the computer now. This did not solve the issue.\n\nI looked at my Event Viewer and noticed this entry seems to appear after every non-thermal crash (as far as I can tell): \n\n&gt;A fatal hardware error has occurred.\n\n&gt;Reported by component: Processor Core\n\n&gt;Error Source: Machine Check Exception\n\n&gt;Error Type: Bus/Interconnect Error\n\n&gt;Processor APIC ID: 22\n\nInterestingly this shows up after the PC reboots. \n\nAny ideas?"], "2021-02-21": ["I've done a lot of research and I've finally decided on all the parts I want to include in my build. I'm hoping with this post I can get any feedback on any potentially better parts such as a case or storage I could choose from. \n\n[PCPartPicker Part List](https://pcpartpicker.com/list/QPkLnL)\n\nType|Item|Price\n:----|:----|:----\n**CPU** | [AMD Ryzen 5 3600 3.6 GHz 6-Core Processor](https://pcpartpicker.com/product/9nm323/amd-ryzen-5-3600-36-thz-6-core-processor-100-100000031box) | $199.99 @ Adorama \n**Motherboard** | [ASRock A520M/ac Micro ATX AM4 Motherboard](https://pcpartpicker.com/product/jfzFf7/asrock-a520mac-micro-atx-am4-motherboard-a520mac) | $69.98 @ Amazon \n**Memory** | [Crucial Ballistix 16 GB (2 x 8 GB) DDR4-3200 CL16 Memory](https://pcpartpicker.com/product/BxTzK8/crucial-ballistix-16-gb-2-x-8-gb-ddr4-3200-memory-bl2k8g32c16u4b) | $79.95 @ B&amp;H \n**Storage** | [Western Digital Blue 500 GB M.2-2280 Solid State Drive](https://pcpartpicker.com/product/6j448d/western-digital-blue-500gb-m2-2280-solid-state-drive-wds500g2b0b) | $59.99 @ Lenovo \n**Video Card** | [Gigabyte GeForce GTX 1650 SUPER 4 GB WINDFORCE OC Video Card](https://pcpartpicker.com/product/MdFKHx/gigabyte-geforce-gtx-1650-super-4-gb-windforce-oc-video-card-gv-n165swf2oc-4gd) | Purchased For $215.00 \n**Case** | [Cougar MX330-X ATX Mid Tower Case](https://pcpartpicker.com/product/XZnG3C/cougar-mx330-x-atx-mid-tower-case-mx330-x) | $39.99 @ Newegg \n**Power Supply** | [Corsair CV 550 W 80+ Bronze Certified ATX Power Supply](https://pcpartpicker.com/product/HcgQzy/corsair-cv-550-w-80-bronze-certified-atx-power-supply-cp-9020210-na) | $59.38 @ Amazon \n | *Prices include shipping, taxes, rebates, and discounts* |\n | **Total** | **$724.28**\n | Generated by [PCPartPicker](https://pcpartpicker.com) 2021-02-20 23:57 EST-0500 |\n\nI chose most parts based off of price, but I chose that particular motherboard and case due to the fact that it has built-in wifi and the case has loads of usb ports which I really appreciate. If anyone has any advice as to whether this is a good build, I'd appreciate it a bunch!"], "2021-02-22": ["I have an RX580 that I absolutely cannot get to work in this motherboard.\n\nI have a gtx 1070 that I have been using to troubleshoot and with the 1070 the machine boots and displays just fine. \n\nI was able to put the RX580 in a separate machine, but when placed in the PCI slot that the 1070 useually goes in I got no display, and error 12 in device manager.\nWhen I switched to PCI2 the 580 worked just fine. Recognized normally in device manager, displayed output, no errors.\n\nSo the steps I have taken with the machine the RX580 is meant for have ranged from wiping the cmos to using DDU to fully uninstall all AMD and Nvidia drivers from safe mode.\n\nNo matter what the 1070 behaves perfectly fine but the 580 wont boot.\n\nOddly enough a separate 580 did work at one point when the machine first was assembled. It's what I used when installing windows. However, I got it from ebay and when it stopped working I assumed it was more used than was described and had died pretty quick. \n\nThis newer 580 is behaving the exact same way though. No display from HDMI or display port. GPU light is on and fans spinning, but 5 quick beeps and no post. \n\nBIOS version appears to be 1.60. \n\nI'm at my wits end. I feel like I've done everything. \n\nThe 580 works fine in a separate machine. The rest of the target PC works perfectly fine with the 1070. I just CANNOT get the 580 to work in the target machine."], "2021-02-23": [""], "2021-02-24": ["This is a new post to get attention on an issue I have been facing. I got some replies from /u/MSFTMissy initially, but after I gathered all the logs, I haven't heard anything since. \n\nOriginal text: \n\nI have been experiencing some weird issues with Edge, only when I am streaming Netflix. The issue is similar to https://www.reddit.com/r/edge/comments/k2tw8i/edge_freezes_during_video_playback_have_to/, but mine is for Netflix specifically.\n\nDuring playback, if I double click to exit full screen mode, the chances of it stuttering, flickering is quite high - the Edge window would just be showing on and off in the process. Sometimes it just freezes Windows 10 completely, with audio continue playing in the background; The only way to fix this is to force shut down and restart the PC.\n\nMy PC is running on AMD X570, Ryzen 5 3600, GTX 1660Ti. \n\nOriginal post with more details: https://www.reddit.com/r/edge/comments/lgyrft/edge_freezes_windows_randomly_when_playing_netflix/"], "2021-02-25": ["I have terrible frame rate issues in Minecraft.\n\nI have an AMD Radeon 5700 XT using the latest Adrenalin Drivers.\n\nI have 16 GB of ram.\n\nI'm not exactly sure what is exactly causing the issue, but from what I can gather, the AMD graphics drivers seems to be the issue.\n\nIs there possibly any way I can get minecraft to run at acceptable levels?"], "2021-02-26": [""], "2021-02-27": ["Here are a few of my favourite prompts, I've gota few more for those you ask, but if you like any of there or get a bit of inspiration I'd love to hear from y'all !\n\n1. Incestous genetics.\nOur family,  and many others hold a secret that we may not even know. That in our dna is something deeply taboo. A gene that compels one of the world fastest growing kinks. Incest! We cant fight it, it's hard coded into our dna , we need to breed our family! \n\n2. Magical toy.\nI didnt believe it. But it was such a cheap price! The omnipussy, some sort of fleshlight, it claimed to be able to become any pussy. When it arrived the instructions  where to just say a name into it and it would transform into the person you thought of! I whispered the names if neighbors,  teachers, even porn stars and watched it morph into each.  A botton on the side allowed to swap between pussy and ass, even the depth of where the toy started. I even made it morph inti fictional charaters and to my surprised it worked!  I settled on one,  something taboo, my mother.  As i entered the toy I heard a crash and then a moan.  It didn't just mimic pussies it became them! \n\n3. A mission from God for a very special nun\nI would be playing a futa nun, who one night awoke to a blinding light amd a voice from an angel telling her that god has chosen her to sire children for them. That she will be blessed with holy seed to cleanse painful women. The details can be discussed,(  was she born with a cock? Is this really god?  Who will be cleansed? )\n\n4.knotty island\nA secluded island in the Pacific is home to a certain tribe of women. They run a all womens resort that isnt what it seems. On this island animals are seen as gods,  and to submit your body is worship. To take part in their seed is holy. Many come unknowingly but all are converted. The island holds much magic so all is possible.\n\nBonus prompt dc rule 34, very vague but has so many opportunities. \n\nAll of my older prompts are still open so you can go through them and see what tickles your fancy. I do have quite a few so there is a buffet of cho"], "2021-02-28": ["Does anyone else think about how incredibly interesting it'd be to see full on world building? Different information on species dynamics amd world politics, like how cats would basically be autistic, or how different species' accomadations in architecture and society would play out, or how the square cube law would play out with all the various sizes of species, or the entirety of sea life, it'd be so incredible to know, beastars is the perfect world for this type of thing."], "2021-03-01": [], "2021-03-02": [""], "2021-03-03": ["I recently spoke to someone from micro center for advice on a gaming build and came up with this (Running warzone, escape from tarkov, green hell)\n\nAMD Ryzen 5 5600x\n\nNvidia Geforce rtx 3060\n\nMSI B550M MAG Mortar AMD AM4 microATX motherboard\n\nG. Skill ripjaws v 16gb (2x8gb) ddr4-3600\n\nWD Blue SN550 1TB 3D TLC NAND PCle gen 3 x4 NVMe m.2 2280 internal ssd\n\nCooler master hyper 212 evo universal cpu cooler\n\nGigabyte 750watt power source\n\nCooler master masterbox mb311L argb tempered glass matx mid-tower computer case\n\nAny thoughts would be helpful!"], "2021-03-04": ["Hi so I got a new laptop about 3 months ago and I'm noticing that my laptop will randomly freeze for a few seconds every once in a while. This problem has existed since I bought it, but i believe the frequency of the freezes has increased since (went from a few times a day to as frequent as every 10 minutes at worst). When it freezes, I can still hear audio, but no clicks, typing, or scrolling will visually update until after it unfreezes (they do still register though). This is happening across apps (Chrome, Skype, Messenger) which leads me to believe that this is a hardware issue.\n\nSpecs: HP OMEN - 15.6\" Gaming Laptop - AMD Ryzen 7 - 16GB Memory - NVIDIA GeForce GTX 1660 Ti - 1TB SSD\n\np.s. it froze again while typing this post -\\_- help would be much appreciated!\n\nalso I was able to open my task manager before the freeze (my spidey senses were tingling) and it happened sometime during/after that smaller spike as shown below (first spike is me opening it)\n\nhttps://preview.redd.it/idv0k32p0yk61.png?width=1906&amp;format=png&amp;auto=webp&amp;s=cb684098e15e116f91567aaa3c978d76a30db252"], "2021-03-05": ["Hello I'm bad at aiming first off highest ranks do far is master guardian 2 cs:go and gold 2 in valorant but this month or 2 my aim has got worse and worse. I have over 500 hrs in cs:go and around the same in val according to amd client. \nI just want some advise on what to do I've been running bardoz valorant aim train playlist for the past 4 months and these past 2 months I've been getting worse aim even after switching playlist to see if that was the problem. \nI'd really like some advice on what to do because I'm about to give up it's really stressing being bad at the only thing you've ever been decent at in life.\nSens 800dpi 1.27=Cs:Go sensitivity\nSens .4 800dpi=Valorant sens\nMouse= G pro wireless 70 grams (modded)"], "2021-03-06": [], "2021-03-07": ["Thank you to everyone in this community. I joined Reddit about a week ago amd am so happy I found r/adhd! It is really great to read everyone's posts and be able to communicate with others that have the same struggles. Also great to hear about people's successes and everything in between. This totally helps my dopamine levels and is rewarding. People who actually understand and care - so cool!!\n\nSo just wanted to say THANK YOU everyone for being you and reading this. YOU ARE AWESOME!"], "2021-03-08": [""], "2021-03-09": ["In the past 6 hours on r/WallStreetBets...\n\n 1. GME has been mentioned 807 times.\n\n 2. TSLA has been mentioned 166 times.\n\n 3. PLTR has been mentioned 163 times.\n\n 4. AMC has been mentioned 150 times.\n\n 5. AAPL has been mentioned 84 times.\n\n 6. SPY has been mentioned 68 times.\n\n 7. RKT has been mentioned 50 times.\n\n 8. AMD has been mentioned 48 times.\n\n 9. QQQ has been mentioned 48 times.\n\n 10. DASH has been mentioned 45 times.\n\n 11. BB has been mentioned 42 times.\n\n 12. NIO has been mentioned 41 times.\n\n 13. DKNG has been mentioned 24 times.\n\n 14. NOK has been mentioned 23 times.\n\n 15. TD has been mentioned 22 times.\n\n 16. NVDA has been mentioned 21 times.\n\n 17. RIOT has been mentioned 20 times.\n\n 18. SQ has been mentioned 19 times.\n\n 19. GE has been mentioned 18 times.\n\n 20. ASO has been mentioned 17 times.\n\n 21. SQQQ has been mentioned 16 times.\n\n 22. XOM has been mentioned 16 times.\n\n 23. TQQQ has been mentioned 13 times.\n\n 24. MARA has been mentioned 12 times.\n\n 25. DIS has been mentioned 12 times.\n\n 26. TSM has been mentioned 11 times.\n\n 27. DOW has been mentioned 11 times.\n\n 28. AI has been mentioned 10 times.\n\n 29. EYES has been mentioned 10 times.\n\n 30. PE has been mentioned 10 times.\n\n&amp;#x200B;\n\nThis hourly update has been bought to you by MemeStock.com."], "2021-03-10": ["I have a cyberpowerpc with an NVIDIA GeForce RTX 2060. I’m new to PCs and still learning all about them. My question is what is the next upgrade as far as graphics cards go that will be a noticeable difference? \n\n•Here are the specs of my PC if that helps!\n\n3.80GHz (Max 5.10GHz) Intel i7-10700K Processor\n1TB SSD\n16GB DDR4 SDRAM\nNVIDIA GeForce RTX 2060\n\n•Also my monitor \nRefresh RateInfo\n144Hz\nMaximum ResolutionInfo\n2560 x 1440\nNative ResolutionInfo\n2560 x 1440\nResponse TimeInfo\n1 milliseconds\nPanel TypeInfo\nIPS\nSynchronization TechnologyInfo\nFreeSync (AMD Adaptive Sync), G-SYNC Compatible (NVIDIA Adaptive Sync)"], "2021-03-11": ["So, in AMD settings, in the custom resolution settings when making a custom res., it asks at the bottom: \"Timing Polarity Vertical: (Negative or Positive) and Timing Polarity Horizontal: (Negative or Positive)\" which should I pick, negative or positive for both vertical and horizontal? Not sure what this does and Google is no help..."], "2021-03-12": ["[removed]"], "2021-03-13": ["Ok folks, the question of the day....\n\n&amp;#x200B;\n\nI can get my hands on a iMac for parts.  It has a Pro 5700xt 8gb in and uses a MXM 3.0b (I think) interface.  I'm looking at adapters and I do find some mxm to pci-e 16 on ebay/amzon.  I do notice the power limit on them is 75w.  \n\nSooo... anyone have experience with this kind of thing?  I run my 5600s at 100w, my 5700 about 110w, so 75w seems to be reallllly low to me.  Also, how about heat?  Adapter to a riser I get, but all power from the riser as I don't see any kind of Sata or 4pin power to the adapter?  I run HiveOs so it's Linux, I guess as long as it fires is gtg?  \n\nTy in advance \n\n\\-Tate"], "2021-03-14": [""], "2021-03-15": ["[https://i.imgur.com/8l8jMUm.png](https://i.imgur.com/8l8jMUm.png) so thats my cinebench along with ryzen master you can see the bumps every few seconds. it bumps up to 3800/sometimes 4000 but then it shoots down to 546 and i dont know why. \n\n&amp;#x200B;\n\ni downloaded the latest chipset, drivers are up to date, bios is up to date. power mode is on balance(since for some reason i cant see the amd power settings(ive tried high and the other higher one though)) on ryzen master im on precision boost overdrive(but tried on oc and default). im getting ready to rma this thing if i cant find a solution."], "2021-03-16": [""], "2021-03-17": ["So im in school for electrical and my friend needed to get his switch rewired in his bathroom which was easy enough. But long story short the face plate wasn't flush enough to the wall and he was tryna poke the switch out more with the screw driver (the power is on at this point) and before i could think to tell him not to do that he accidentally touches the screwdriver to the screw amd it sparks up and the power turns off. There's 2 switches in one box and the switch next to it works completely fine. We tried a lot of things nothing worked what could be the problem?"], "2021-03-18": [], "2021-03-19": [], "2021-03-20": [], "2021-03-21": [], "2021-03-22": [], "2021-03-23": [], "2021-03-24": [], "2021-03-25": [], "2021-03-26": [], "2021-03-27": [], "2021-03-28": [], "2021-03-29": [], "2021-03-30": [], "2021-03-31": ["[removed]"], "2021-04-01": [""], "2021-04-02": ["Hey there Im Tony, 26 M, aussie slightly bi :) Im a open minded, adventurous fun loving guy, usually with plenty to say and a try anything once attitude :p i am a big slut for toys and anal too ;) 😂 would love to find a lovely lady to chat with and help me keep outta this boredom. Especially if they think they can sway me into sucking cock! swing me a pm if youd feel like chatting! i have kik amd snap aswell :)"], "2021-04-03": ["Both BNIB. Looking for\n\n    $970 shipped for 5950x\n    $570 shipped for dark hero\n    $1500 shipped for both\n\nTimestamps: https://imgur.com/a/mQrzLzP\n\nPlease comment before pm"], "2021-04-04": ["I'm having an issue on Mission 6 (AKA Return to Me, in the mausoleum) of Cindered shadows where the game attempts to load the map. I then get a black screen, music plays, driver-timeout (AMD), and Yuzu freezes. I tried a number of workarounds but couldn't fix it. With that in mind I need a completed save or more ideal, a save during the battle setup screen of mission 6 of the DLC. Otherwise I can't use the DLC content in the main story. \n\nAnother thing, I tried using some save files on GBAtemp but it didn't work, in-fact, when I \"open save-game data\" on the yuzu main menu and overwrite or delete my old save files, Yuzu doesn't seem to care and my saves will still be there and loadable. I'm not sure what's the issue, is there some sort of automatic backup or extra file I need to delete/overwrite?"], "2021-04-05": ["I’m 23 and last month I became an official apparel graphics designer for a international Canadian apparel brand. After years of freelance and odd jobs, I feel like it all paid off and I’m at the start of my career as a professional artist. I feel genuinely validated and reaffirmed I’m on the right track with my life and what I was born to be doing. What I’m best at \n\nI’m self taught and would only dream of the job I’m doing now and I’m so proud of myself I did it really early in my lifespan despite the years of confusion and setbacks I still managed to score a huge job. \n\nI’m so proud of myself none of my family has to look at me with concern I’m going to be a starving artist my whole life. Like. My family doesn’t really respect or value art as a career move and here I am working with a brand even they know amd wear. Like. I draw the clothes! It’s unreal and I feel like I’m dreaming. But it’s the start to a hopefully long career as a artist and designer."], "2021-04-06": ["Hey Everyone! This is my first post but I want to build my own PC. I know that GPU's are pretty scarce right now but the main thing I want is an RTX 3080, and I really like the Founders Edition, at least the way it looks. My budget is about $2000. I need some advice on all the other specs that will work best with the 3080. I am willing to wait to get that but figured I can start buying all the other pieces and wait on the GPU. I also really like the way NZXT cases look. I am currently studying Computer Science: Animation, and just got a job at my universities broadcasting studio doing VFX. So I am leaning towards an AMD processor to run simulations and render animations. Any and ALL tips are greatly appreciated!"], "2021-04-07": [""], "2021-04-08": ["so maybe a bit TMI but so be it. had a dx of slight perf bit no emergency surgery. they said it was likely quick burst then heal. havent been on meds since. but after i healed my bowel habits changed. from initially very urgent to now i cant really force a movement but its like if i wait amd withhold.them they are really large and can be very urgent. in my armchair degree like the last few inches or some ft of intestime is weaker so it needs the bulk to allow muscles further up to work harder. yeah its a bit hard on qualitity of life of im not near a restroom plus ot can be 'leaky' if inwalk a lot so i get rashes to manage. ive been scoped and at that time i was 'moderate' with the diverticilum. they said id be looking at losing a few feet and bowel habits can be more watery so its like it would be worse on quality of.life if. i did the surgery. at least now i can control it and ive got an idea of diet/bowel habit response. im do for another scope.next year, hopefully no cancer indocators or more degradation. has the surgery returned you to 'normal', i view it as opening a can of worms."], "2021-04-09": ["Hey there r/bourbon community. Thanks to this group I have really expanded my bourbon collection with some great bottles.  I realize this is blasphemy to many but my go to drinks are bourbon with a splash of coke (probably 3 parts bourbon to 1 part coke) and bourbon and montenegro amaro (again usually 3 to 1).\n\nI continue to try every new bottle I get neat but really struggle. I just don't love straight bourbon as much as cutting it. I will definitely do some bourbon on the rocks amd enjoy it but straight is a struggle.\n\nSo... I am looking for suggestions of other relatively simple bourbon cocktails to enjoy my collection.  Ideally nothing too complex (I'm lazy after a long day of work so highly complex ones with lots of ingredients are a no go that I will leave to a bartender).  Thanks in advance!\n\nFor reference I seem to prefer bourbons around 100 proof/BiB... I found Stagg Jr and JD SB BP to be fantastic for higher proof - I have only done those over a large cube."], "2021-04-10": [], "2021-04-11": [], "2021-04-12": [], "2021-04-13": ["So i finally started to play SSBU on Yuzu just to find out that the game is crashing/freezes randomly. I try playing classic mode and sometimes i can finish it, sometimes it freezes or crashes.   \n\n\nMy system:\n\n10th gen intel i7 6Core\n\nNvidia RTX 2070\n\n32gb of Ram\n\nThere is absolutely no problems when the game is running so idk what is causing the crash. I have seen many other post complaining over this a few month back and people saying it was an AMD related problem. Its not... this happens on Nvidia and intel hardware as well currently."], "2021-04-14": ["Reworked my build to a smaller form factor case as well as swapped from Blue Team to Red Team, and after figuring out Vengeance RAM doesn't play nice on AMD like it does Intel, swapped it out for G.Skill and am now selling the Corsair. Also realized I don't like the 10/13mm tubing. \n\n&amp;#x200B;\n\n|Type|Item|Description|Price|\n|:-|:-|:-|:-|\n|RAM|Corsair Vengeance LPX 3600 MHz CL18 64 GB (4 Sticks/16GB each)|After trying and failing to get these to post XMP settings on the new AMD platform, swapped to G.Skill Tridentz Neo memory and no longer need this memory.|$325|\n|HDD|Seagate Barracuda 4 TB HDD|Used as mass storage for anime, until I realized I needed more than 4 TB for anime. Drive health is at 99% but idiot me didn't take a screenshot of the CDI before taking it out of the old computer. If you've doubts as to the health of the drive, please refer to previous drives I've sold, I give you my word.|$60|\n|Radiator|EK XE 240+360|These chonky bois were originally installed in an E-ATX case for maximum cooling. Then I realized I don't like trying to move such a gigantic case, and went mATX, so no longer need these. Perfect working condition, used for about 6 months.|$100 (240), $120 (360)|\n|Soft Tubing|EK DuraClear 10/13mm|BNIB, was using some extra tubing while putting the new build together and had a mix of 13mm and 16mm, realized I hated the 13mm, so never used this.|$20|\n\n&amp;#x200B;\n\nAll prices include shipping to the continental US. \n\n[Timestamps](https://photos.app.goo.gl/7aaYQHwF5PU4dNtQ8)"], "2021-04-15": ["So, I'm finally in the market for a new notebook. Unfortunately, my options are kinda limited, cause of where I live, and I've narrowed my best choices in the following machines:\n\n**A) Lenovo IdeaPad Gaming 3**  **15ARH05**\n* CPU: AMD Ryzen 5 4600h\n* GPU: Nvidia GTX 1650ti 4gb\n* 120hz Panel\n* Price:  € 849\n\n**B) Lenovo Legion Y540-15irh**\n* CPU: Intel i7 9750hf\n* GPU: Nvidia GTX 1660ti 6gb\n* 144hz Panel\n* Price:  € 1075\n\nI'll be upgrading the memory to dual channel 16gb no matter the choice (both have 8gb single channel stock), as well as expanding the storage, so those things aren't really a concern. As for FreeSync, Optimus etc, i must admit I haven't found anything solid about the particular models.\n\nI want the laptop to be able to handle heavy multitasking, light video &amp; photo editing - rendering, non-professional music production, 3d modeling as well as extensive gaming (I don't expect achieving high end performance and billion fps with either of those machines on AAA titles, I just want to be able to play smoothly anything I might like, even on lower settings) - example games being Doom Eternal, ridiculously modded Skyrim, GTA V, Cyberpunk 77, The Medium, Scorn etc. \n\n\nI know that either laptop is able to provide these at a different level, but i wanna know if the improved performance of the 1660ti compared to the 1650ti justifies choosing the inferior i7. I also know that the 1660ti is a better choice regarding future proofing for a couple of years - until I manage to build a solid pc - don't know about the i7 though.\n\nI would really appreciate elaborated answers since I wanna understand better the priorities regarding hardware.\n\nThanks everybody in advance, have a cookie on me!\n\nCheers"], "2021-04-16": ["Hello r/davinciresolve! In light of a recent outpouring of hardware posts and system requirements, I'm dusting off an old hardware post, now featuring 17's minimum hardware requirements and a couple other notes.\n\n# Stores and Other Resources\n\n* [Puget Systems has an excellent hardware guide and store](https://www.pugetsystems.com/recommended/Recommended-Systems-for-DaVinci-Resolve-187) for Linux/Windows systems\n* [Apple](https://www.apple.com/mac/) is, well, Apple\n* HP Workstations (if you've got the cash or are in a studio environment)\n   * [The Z8 is the current workhorse model](https://www8.hp.com/us/en/workstations/z8.html)\n   * [Z Mobile Laptops may also fit these needs](https://www8.hp.com/us/en/workstations-family-page/index.html?jumpid=in_r12139_us/en/psg/ws_overview/products/laptops)\n* [CUDA page on Wikipedia](https://en.wikipedia.org/wiki/CUDA) - to find if your NVIDIA GPU supports CUDA 11\n\n# Computer Hardware Suggestions (Unofficial)\n\n*Minimum system suggestions for all platforms:*\n\n* A recent operating system (yes, this includes other Linux distros)\n* 16 GB of system memory.\n* Discrete GPU with at least 2GB of VRAM\n   * Required for Linux, optional-ish for others but strongly recommended\n   * eGPUs are not yet supported on the recent M1 Macs, as far as I'm aware, but should be compatible with other Macs.\n* A recent CPU (Last year or two)\n* Studio GPU drivers (some people have reported issues with gaming drivers)\n* A three-button mouse^(1)\n* A 17\" or greater monitor^(2)\n\n^(1)A three-button mouse is not an official requirement. It's just *strongly* suggested.\n\n^(2)This isn't an official requirement, but as the color page GUI has a minimum screen size so you can see the viewer in the GUI and the tools.\n\n# Computer Hardware Requirements (Official)\n\n*Minimum system requirements for macOS:*\n\n* macOS 10.15 Catalina\n* 8 GB of system memory. 16 GB when using Fusion\n* Blackmagic Design Desktop Video version 12.0 or later\n* Integrated GPU or discrete GPU with at least 2GB of VRAM.\n* GPU which supports Metal or OpenCL 1.2.\n\n*Minimum system requirements for Windows:*\n\n* Windows 10 Creators Update.\n* 16 GB of system memory. 32 GB when using Fusion\n* Blackmagic Design Desktop Video 10.4.1 or later\n* Integrated GPU or discrete GPU with at least 2GB of VRAM\n* GPU which supports OpenCL 1.2 or CUDA 11\n* NVIDIA/AMD/Intel GPU Driver version – As required by your GPU\n* A minimum NVIDIA driver version of 451.82 is recommended.\\*\n\n*Minimum system requirements for Linux:*\n\n* CentOS 7.3\\*\\*\n* 32 GB of system memory\n* Blackmagic Design Desktop Video 10.4.1 or later\n* Discrete GPU with at least 2GB of VRAM\n* GPU which supports OpenCL 1.2 or CUDA 11\n* NVIDIA/AMD Driver version – As required by your GPU\n* A minimum NVIDIA driver version of 450.51.06 is recommended.\n\n\\*There's an issue with NVIDIA Game-Ready driver version 461.09 that has been resolved in later driver versions. Update your GPU drivers to a later version or the Studio version of the NVIDIA drivers. [More information from BMD on changing driver versions.](https://forum.blackmagicdesign.com/viewtopic.php?f=21&amp;t=50352&amp;start=100#p713477)\n\n\\*\\*CentOS is the only officially supported distro of Linux. Ubuntu is a more common distro with community support. An officially recommended centOS ISO is included with the official Linux download, also [linked here](https://downloads.blackmagicdesign.com/DaVinciResolve/DaVinci-Resolve-Linux-16.0-CentOS_7.3.iso)\n\n[**Previous FAQ Fridays**](https://www.reddit.com/r/davinciresolve/search?q=flair_name%3A%22FAQ%20Friday%22&amp;restrict_sr=1)"], "2021-04-17": ["I need a new machine ASAP and seems like prebuilt is the way to go. Configured this one from Origin:\n\nNEURON\t$2,784.95\t$2,784.95\nCustomizations\nCase : Corsair 4000D Airflow\t\t\nExterior Color : White\t\t\nLaser Etching : None\t\t\nCurrent Special Offer: Free US Ground Shipping $50 value\t\t\nProcessors: AMD Ryzen 7 5800X 8-Core 3.8GHz (4.7GHz Max Boost)\nCPU : Thermal Compound\nMotherboard: Asrock B550 Phantom Gaming 4/ac\t\t\nMemory: 32GB CORSAIR VENGEANCE RGB PRO 3000MHz (2x16GB)\t\t\nSystem Cooling: Corsair A500 Air Cooler (Fans matched w/ System Fans)\t\t\nSystem Fans: ORIGIN PC Standard Fan Kit\t\t\nGraphics Cards: NVIDIA 8GB GeForce RTX 3070\t\t\nOperating System: MS Windows 10 Home\t\t\nOperating System Drive: 240GB Force MP510 NVMe PCIe M.2 SSD \nRAID : No RAID\nHard Drive: 1TB Seagate BarraCuda SSD\nPower Supply: CORSAIR 750X RMX SERIES PLUS GOLD - White\nPower Supply Sleeved Cable : No Sleeved Cable\nAudio: Integrated High-Definition Audio\t\t\nNetworking: Onboard Network Port\t\t\nThe ORIGIN Difference: The Best Gaming Experience Guaranteed\t\t\n24/7 U.S Based Warranty: 1 Year Part Replacement with 45 Day Free Shipping\t\t\nAdditional Charges\nFree ORIGIN PC Gear: ORIGIN PC T-Shirt\nSize : Medium\nFree ORIGIN PC Gear: ORIGIN PC Mousepad\t\t\nGearshop\nSubtotal:\t$2,784.95\nShipping:\t$0.00\n\nHow bad is it?"], "2021-04-18": ["This is a copy of my Imgur log from here: [https://imgur.com/gallery/BECPBzi](https://imgur.com/gallery/BECPBzi)\n\n*Processing img 2smd3hnfuut61...*\n\nThis my first ever PC build. I wanted to make a beast of a S620 with as many fans as possible, so here it is. Case is configured as a rear and bottom intake to top and side exhaust.  \n\n&amp;#x200B;\n\nComponents:    \n\nCASE: Sliger S620    \n\nCPU: AMD 5900X    \n\nGPU: Asus TUF RTX 3090 OC (Deshrouded)    \n\nRAM: Crucial Ballistix 3600 Mhz DDR4 32 Gb    \n\nMOTHERBOARD: Asus ROG Strix X570-I with a Fujipoly thermal pad replacing the stock chip thermal pad    \n\nPSU: Cooler Master V850 SFX (Newer model that fixes the fan ramp issue)    \n\nSTORAGE: 2TB Samsung 950 Pro, 1TB Samsung 980 Pro  \n\n&amp;#x200B;\n\nCooling:    \n\nController - Corsair Commander Pro    \n\nCPU Cooler - Noctua D15S (mounted inverted to fit an A12x15 above it) using Thermalgrizzly Kryonaut    \n\n2 x Noctua Chromax HS NF-A15s on the D15S in pull configuration    \n\n1 x Noctua Chromax NF-A12x15 on the D15S as a rear push    \n\n1 x Noctua Chromax NF-A12x15 above the D15S as an exhaust    \n\n1 x Noctua NF-A12x25 on top as an exhaust    \n\n1 x Noctua Chromax NF-A12x15 on the side as an exhaust    \n\n2 x Noctua Chromax HS NF-A15s below the GPU as intakes  \n\n&amp;#x200B;\n\nThe 2 A15s on the D15S are daisy chained together \n\nThe 2 A15s below the GPU are daisy chained together \n\nThe 2 A12x15s on and above the D15S are daisy chained together \n\n&amp;#x200B;\n\n*Processing img ff68r6vruut61...*\n\n&amp;#x200B;\n\n*Processing img 97ezqv2uuut61...*\n\nDeshrouding the GPU was pretty easy. There were 6 screws mounting the fan setup that needed to be removed, and then each fan had 4 screws holding it to the heatsink.  \n\nThe only issue was that the metal tabs used to mount the cooler took up too much room to fit the A15s below the GPU, so I had to bend them up with some pliers to make room (similar to other builds I've seen with a deshrouded Asus Strix 3090). \n\nOnce the tabs were bent, the fans fit perfectly and one of the smaller tabs that I didn't have to bend rests on the fans frames, giving the GPU some nice support too. The fans are practically flush with the GPU, so the fit is near perfect. \n\n&amp;#x200B;\n\n*Processing img 4ry15tzwuut61...*\n\n&amp;#x200B;\n\nhttps://preview.redd.it/rfnpln32vut61.png?width=1361&amp;format=png&amp;auto=webp&amp;s=a78f62363e62472b663772e6534e5c59ab35d4f8\n\nI initially also had an NF-A9 as a front exhaust, but it created turbulence when running at the same time as the side exhaust NF-A12x15. Since the A12x15 can move more air, I decided to keep it and get rid of the front A9. \n\n&amp;#x200B;\n\n*Processing img n907s5n3vut61...*\n\nI used the stock cables that came with the Coolermaster PSU. They are rigid, so I had to \"pre-bend\" them before I put them into the case so they wouldn't be pushing against the second A15 or the top of the GPU. I put some grills on the top A12x25 and side A12x15 so the cables wouldn't hit the blades. To reach the power button when the case is fully assembled, I stick a long thin screw driver between the blades of the side exhaust A12x15. The joys of an SFF case lol. \n\n&amp;#x200B;\n\n*Processing img q2xzj2d5vut61...*\n\nBack view. The PSU gets fresh air from the side and exhausts to the top, which works out really well with the top exhaust configuration. \n\nIn order to fit the PSU and another A15 on the D15S, I mounted it in a \"half-cage\" configuration that's detailed in this other build: [https://imgur.com/gallery/yvA9C11](https://imgur.com/gallery/yvA9C11) \n\nSome 6-32 nuts from Home Depot/Lowes perfectly fit on some of the extra short screws that came with the case, which is how I fastened the cage to the case. \n\n&amp;#x200B;\n\n*Processing img 5oj1ja2avut61...*\n\nFinished build. Didn't show it, but the commander pro is in the front of the case behind the front panel. I just used some double-sided tape to stick it on there and have all the fan cables running through the top and bottom outlets on the front. The front panel fits just fine with the commander pro behind it since its so thin. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/c4h2tzwdvut61.png?width=1363&amp;format=png&amp;auto=webp&amp;s=3316b84dfa998b743a85256b000fc53ee9565f8c\n\nRan a 1 hour long unnecessary OMEGA stress test consisting of all of the following running at the same time and monitoring with HWinfo: \n\n\\-A 4k Youtube video playing \n\n\\-Unigine Heaven 1440p highest settings \n\n\\-Unigine Superposition 8k highest settings \n\n\\-Aida64 stress test with ALL of the stress settings on (including the GPU and storage) \n\n\\-All stock hardware settings. No manual tweaking of the GPU, CPU, or RAM (aside from enabling DOCP in the BIOS for 3600 Mhz RAM and resizable bar for the GPU)  \n\nFPS for everything was of course garbage, but the main point was to make sure fans and PSU could keep up with the heat and power draw for an extremely unrealistic scenario so that there would be absolutely no worries while gaming. Here were the results: \n\n\\-CPU Max Temp: 79 C \n\n\\-GPU Max Temp: 75 C \n\n\\-GPU VRAM Max Temp: 92 C \n\n\\-Motherboard Max Temp: 46 C \n\nPretty happy with those aside from the VRAM, but thats a known general problem with all 3080s and 3090s regardless of case and coolers. Might replace the VRAM thermal pads eventually since thats been shown to lower temps by around 20 C, but its nothing worrying so I'll leave it for now.  \n\n&amp;#x200B;\n\nIf anyone wants to do a similar build, here's how I'd recommend assembling it to save some headache: \n\n1. Mount the motherboard to the case \n\n2. Mount the PSU cage (not the PSU yet) \n\n3. Mount the 2 bottom intake A15s and run their cables through the bottom outlet behind the front panel \n\n4. Run the SATA power cable you'll need for the commander pro through bottom outlet behind the front panel (don't connect it to anything yet) \n\n5. Run the commander pro's USB cable through the bottom outlet behind the front panel (don't connect it to the motherboard yet) \n\n6. Mount the GPU, making sure the cables for the commander pro are going past and above it so they'll be able to reach the motherboard when its all connected (the GPU would've gotten in the way of the SATA power cable later, which is why we did it before this step) \n\n7. Attach all the cables you need to the PSU (including the main power cable) \n\n8. Mount the PSU to the cage, run your main power cable to the back of the case, and attach it with whatever option you purchased for the case \n\n9. Attach all your cables (for the PSU, commander pro, power button, etc) to the motherboard \n\n10. Outside of the case, mount the front pull A15 and rear push A12x15 on the D15S. You can't mount the middle A15 or else you wont be able to get to the screws, but there's an issue of the GPU not giving you ANY room to put a fan clip on the bottom of the D15S once its in the case. So here's what I did to fix that:    \n\n   A. Put the bottom fan clip for the middle A15 on the D15S and use a rubber band to hold it in place.   \n   Make sure you'll be able to easily remove the rubberband once the D15S is mounted!    \n\n   B. Mount the D15S on the motherboard    \n\n   C. The bottom fan clip will now be held in place by the GPU, so you can remove the rubber band.    \n\n   D. Put the middle A15 in and use some needle nose pliers or long scissors to pull the inside bottom   \n   fan clip (the one closer to the motherboard) into the clip hole on the A15. Then attach the outside   \n   clip too (you'll be able to reach this one normally)    \n\n   E. Attach the top fan clip to the A15 and D15S \n\n11. Run all the D15S' fan cables along the top of the case through the top outlet behind the front panel (around the power button cables) \n\n12. Slide in and mount the top A12x15 and run its cable along the top of the case through the top outlet behind the front panel \n\n13. Mount the top A12x25 and run its cable along the top of the case through the top outlet behind the front panel \n\n14. Attach your cables to the GPU \n\n15. Mount the side A12x15 and run its cable through the bottom or top outlet behind the front panel \n\n16. Attach the commander pro to the front of the case and plug in all the cables"], "2021-04-19": ["Hey all, as the title suggests, I really want to get the game on my pc as I want to play without my family constantly watching over my shoulder (ya know lol). I don't really know anything about computer specs so I thought I'd ask here to be sure before I make any purchases. \n\nCPU:  AMD Ryzen 5 3500U with Radeon Vega Mobile Gfx 2.10 GHz \n\nGPU:  AMD Radeon RX Vega 8 (Ryzen 2000/3000)\n\nRAM: 8GB DDR4, 2400MHz \n\n\nI have a few other games such as the dragon age series and other witcher games, but just from looking at graphics alone, I know TW3 would probably be more intense aha.\n\n\nThanks!"], "2021-04-20": ["Long shot?\n\nsome work some dont \n\n16 - 755\n\n21 - amd sempron/athalon 64  some fx\n\n48 - celeron D pentium 4\n\n10 - 306/486 + cyrix486\n\n37 - old intel celeron and AMD's from 2000 they dont have caps?\n\n18 - amd ceramic ones\n\nlike 8 more oddballs . I have some pictures if anyone is interested ill figure out how to send them"], "2021-04-21": ["Hello !\n\nI have an AMD 6700 XT Sapphire I am looking to trade for Nvidia GPU - 3060 Ti, 3070, or 3080. I paid \\~ $900 ($849 + TAX) and can provide the receipt. LOCAL TRADE ONLY. \n\nDifference in MSRP with Local Cash\n\nLocated in the Bay Area (94949)\n\n[https://imgur.com/a/qjNgMWY](https://imgur.com/a/qjNgMWY)"], "2021-04-22": ["So I've got an RX 580, I recently repasted the GPU and upgraded the drivers, and since then the GPU has been crashing whenever under load (grey screen, pink screen, brown screen, some lines and then the PC shuts itself off.) I have tried going back to previous driver versions, and I have tried updating my motherboard BIOS. I'm really not sure what it is. \n\nMy PC specs:\n\nAsus Prime B555M-A\n\n16GB (2x8GB) 3600MHz DDR4\n\nRyzen 5 3600\n\n600W PSU\n\nAMD RX 580 8GB (Blower style reference card)"], "2021-04-23": ["Hi,\n\nI recently bought the HP Omen 15 with Ryzen 5800h and Nvidia 3060 from BestBuy. [https://www.bestbuy.com/site/hp-omen-15-6-gaming-laptop-amd-ryzen-7-16gb-memory-nvidia-geforce-rtx-3060-512gb-ssd-mica-silver/6450804.p?skuId=6450804](https://www.bestbuy.com/site/hp-omen-15-6-gaming-laptop-amd-ryzen-7-16gb-memory-nvidia-geforce-rtx-3060-512gb-ssd-mica-silver/6450804.p?skuId=6450804)\n\nI want to upgrade the memory to 64 Gb for virtualization and need help in choosing the right memory. I found the following 2 crucial kits on BH Photo, please advise.\n\n[https://www.bhphotovideo.com/c/product/1600343-REG/crucial\\_ct2k32g4sfd832a\\_2\\_32gb\\_ddr4\\_3200\\_sodimm\\_1\\_2v.html](https://www.bhphotovideo.com/c/product/1600343-REG/crucial_ct2k32g4sfd832a_2_32gb_ddr4_3200_sodimm_1_2v.html)\n\n[https://www.bhphotovideo.com/c/product/1548889-REG/crucial\\_bl2k32g32c16s4b\\_ballistix\\_64gb\\_32x2\\_3200\\_cl16.html](https://www.bhphotovideo.com/c/product/1548889-REG/crucial_bl2k32g32c16s4b_ballistix_64gb_32x2_3200_cl16.html)\n\nThank you."], "2021-04-24": ["I went to buy the Sapphire locally and the guy asked me if I wanted two and I was just like...uhhh sure.  What I'm most interested in is trading up for a 3080.  Most likely an even trade but maybe some cash depending on model.  From what I can tell 3080s are going for about $2000-2200 on ebay, and RX 6700XTs are going for about $1000.  FB you see an average of about $1700-2000 (asking) for 3080s, and about $800-900 (asking) for 6700XTs.  All in all, a 2 for 1 seems about right but again, I am willing to talk about particular swaps.   \n\n\nI'm also interested in maybe trading one of the cards for a PS5.  The two seem to have virtually identical market values as well as MSRPs. The digital PS5 has $399 MSRP, disc $499, and 6700XT $479.  Just curious to try out a PS5 to be honest.    \n\n\nI would consider selling as well.  Say $925 obo for either card.  The Sapphire has been verified to be fully functional and in mint condition.  The AMD Reference is BNIB.   For those who are not aware, the Sapphire 6700XT and AMD 6700XT are identical.  I assume sapphire is the AIB that makes the AMD card, but maybe they're also allowed to just use the same design? Regardless they are identical for all intents and purposes.   \n\n\n[Sapphite 6700XT Timestamp](https://photos.app.goo.gl/PnPvEecoM6SQHJYj6)  \n[6700Xt Ref Timestamp w/seal](https://photos.app.goo.gl/zGPJRUxvgVgtyXjw9)  \n[6700XT Ref Front Timestamp](https://photos.app.goo.gl/B6ZWRJnxvNDLJ8Mv8)"], "2021-04-25": ["I currently have a [Ryzen 7 3700X C](https://www.amd.com/en/products/cpu/amd-ryzen-7-3700x)PU and have it in a B350M Bazooka motherboard that I had to flash to make it work.  I have been reading/watching more stuff about chipsets and CPU's and motherboards and realized there is a lot I don't know.  What kind of changes would I see if I got a X570 or B550 motherboard instead?  I don't want overclock and I play a good amount of CPU heavy games, so my CPU is sometimes a bottleneck."], "2021-04-26": ["I have a 75hz monitor that is AMD FreeSync compatible. When I enable freesync on my my monitor it forces my monitor to do 72hz but when I diable freesync it goes back to 75hz? is this normal? how do I make my monitor 75hz when freesync is enabled?"], "2021-04-27": [""], "2021-04-28": ["**Content created by**: u/JayArlington(**Karma:** 86441, **Created:** Aug-2016). Thanks for adding to the DD hub of reddit, r/MillennialBets! \n\n [**DD: Semiconductors - AMD ($AMD) \"Now I am the Master...\" on r/vitards**](https://www.reddit.com/r/vitards/comments/n058rc)\n\n--------------------------\n\n\n\n[PICTURES DETECTED: this DD post is better viewed in it's original post](https://www.reddit.com/r/vitards/comments/n058rc)\n\n**TL;DR:** AMD is well positioned to dominate along several segments in a highly growing semiconductor market at the expense of Intel.  They don't fear a semiconductor shortage either.  Easy to root for too.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Let's start with two very important disclaimers:**\n\n* AMD doesn't manufacture their own chips.  Neither does Xilinx.  TSMC and Global Foundries do.\n* Just because you *feel* their product is better, doesn't mean it is *better* from a stock performance standpoint.  No fanboy behavior please.\n\nI am leading with this because it is so important for understanding the difference between liking AMD as a company versus liking them as a stock.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Long ago, in a Valley far far away...\n\n***The year is 1981.***\n\nIBM has created it's first PC and was looking to power it with the HOT SHIT of it's time - the Intel x86 processor.  There was a catch... IBM needed a 'second-source' manufacturer.  This is someone other than Intel who could produce the x86 chips in order to ensure that IBM would always have access.  When Intel scanned the horizon of other early semiconductor companies they went ahead and chose plucky little AMD.\n\nAt this time, you may have forgiven Intel for viewing AMD as their little brother.  They both came from Fairchild Semiconductor in the 60's with AMD's core group (Jerry Sanders +7) leaving less than two years after Noyce and Moore had left to start Intel.  AMD wasn't a competitor at the 'leading edge' of semiconductor design or production.  Remember this is an era when semiconductor companies manufactured their own chips.\n\nIntel had a dominant position in the microprocessor space.  They didn't fear AMD.  So they chose their little brother and signed the agreement which naturally included technology transfers and licensing deals.  With this 'training', AMD would learn a great deal about the ways of silicon.\n\n[Sorry AMD fans but in this analogy you are Whiny-Kin.](https://preview.redd.it/ee83p7ouisv61.jpg?width=480&amp;format=pjpg&amp;auto=webp&amp;s=55b7d59ad9a7a518c29c4b13c1de395d4ab4a40f)\n\nOver the next 15 years AMD and Intel would battle over AMD's ability to utilize the x86 architecture taught to them by Intel.  Court cases lead to arbitration lead to more court cases.  This is one of the nastier corporate disagreements and I would rather focus on the outcome of their war because it says what you need to know about AMD.\n\n# AMD's DNA\n\nIntel's falling out with AMD forced **AMD to become great chip designers**.  Everything that comes after 1996 regarding AMD relates to them actively pursuing performance leadership in every category they compete in.   Note that performance leadership means the best performing... not necessarily the highest selling.\n\nThis means that from a corporate DNA standpoint... every decision AMD makes is to produce the 'best' in the future and to dominate the top end of their market.  AMD built upon the x86 architecture while also working with the new ARM architecture - so they could develop better performing chips.   AMD spun out their manufacturing footprint (creating Global Foundries) to focus more effort on developing better performance chips.   When it came time to move into GPUs AMD acquired ATI for 5B because they were already developing the best performing chips.\n\nAMD may enter a segment as a low cost 'value' option (akin to them being second-source manufacturers for others) but this was always to get their foot in the door before developing what would become the performance leader of that category.  When AMD says it's coming for your market... they aren't aiming for anything less than being the best.\n\nAnd why do they do this?  It's simple.\n\n[FUCK Intel](https://preview.redd.it/u110pdt03tv61.jpg?width=680&amp;format=pjpg&amp;auto=webp&amp;s=f70ac6a8f9b6e49cabfc591801600ae6033e75cf)\n\n***Now let's fast forward... the year is 2020.***\n\n# Exiting the Pandemic\n\nAMD has very cleanly organized itself into 2 segments.\n\n* **Computing and Graphics:** This segment includes their GPUs and CPUs.  Think PCs and laptops.\n* **Enterprise/Embedded/Semi-Custom:** This segment includes their Xbox/PS chips as well as their servers and datacenter chips.\n\nUsing their Q4 2020 results, AMD generates roughly **60%** of their revenue on their Computing/Graphics side with **40%** on the Enterprise Side.  While their C/G business may be where many of you reading this 'know' AMD from (RADEON GPUs or RYZEN CPUs), we need to focus on their 'smaller' side - Enterprise/Embedded/Semi-Custom (E/E/SC).\n\nAMD's E/E/SC segment is where AMD gets to pursue it's true passion: developing stupidly powerful chips while making Intel it's bitch.  This is the business segment that puts AMD chips inside the newest generation of consoles (both Xbox and PS), [supercomputers,](https://www.nextplatform.com/2021/02/09/amd-takes-down-another-supercomputer-deal-in-europe/) servers, crypto mining rigs, and **datacenters** (remember this).\n\n[This is what happens when you can design beyond 10 nm](https://preview.redd.it/r3gnwlzy2nv61.png?width=1016&amp;format=png&amp;auto=webp&amp;s=384068deb5d4b882972ef2a07241551ba55422df)\n\nComing into 2021, AMD has a well stocked product portfolio with popular performance leaders across several categories.  They even felt confident enough to approach Xilinx for a merger (not going to cover this acquisition here).\n\n# Dude... where's your datacenter customers?\n\nLast week Intel released their Q1 2021 quarterly results.  They beat both revenue and earnings estimates.  Let's see if you spot the moment they released their results by just looking at their stock price against AMD (in yellow):\n\n[FUUUUUUUUUU](https://preview.redd.it/uwczq30fetv61.jpg?width=967&amp;format=pjpg&amp;auto=webp&amp;s=0483369d62df2b545fac0f5fa7f68d99c8fd79cc)\n\nWhat happened?  It's simple, Intel showed that they lost **20%** of their datacenter revenue.  While Intel CEO and well loved YOLO'er Pat Gelsinger tried to dance around the topic of the gaping hole where their remaining cash cow previously laid... the market was quick to figure it out.  Intel just got its ass kicked in the datacenter.\n\nThe only question was how bad was it?\n\n# AMD's BLOWOUT\n\nIt was bad.  The market was correct.  AMD had whipped Intel's ass.\n\nIn the datacenter, AMD doubled their revenue from a year ago.  They notched significant customer acquisitions like AWS, Oracle, and Microsoft... many of these being previously loyal Intel customers.\n\nOutside of their datacenter they notched revenue gains across all the lines of business along with increased margins due to a better product mix.\n\nHere is how AMD viewed their results:\n\n[Their prior quarter also had record revenue.](https://preview.redd.it/x0g3yvuyjtv61.jpg?width=981&amp;format=pjpg&amp;auto=webp&amp;s=78b745cad7dc76b3d43e2a8751fec81572013281)\n\nWhile the revenue and gross margin numbers are impressive; I want to focus on the bottom where AMD generated $832M in Free Cash Flow (FCF).  FCF for AMD is very nice because AMD is extremely low debt.  As of this quarter, they have 10x the amount of cash/cash equivalents than total debt (300M).  This much cash post-R&amp;D funding represents a lot of tendies AMD can serve to their shareholders in the form of buybacks and dividends.\n\n# Isn't there a semiconductor shortage?\n\nI believe that semiconductors are just kicking off their own commodity supercycle and this is independent of the existing semiconductor shortage, but I want to show how AMD is well positioned in both the near and far term with where the semiconductor industry is heading.\n\nIn the near term, AMD is not terribly impacted by the shortage because their chips are built on the more advanced processes (less than 10nm sorry Intel).  The chips that are in the most demand for the automotive and appliance industries tend to be the commodity chips built on the less advanced process nodes.  Also, due to their products having nice fat margins, AMD is able to pay more to get their chips moved to the front of line.\n\nIn the long term, I think ALL fabless chip producers are going to benefit from the supercycle as more production coming online means the costs associated with manufacturing should decrease.  As long as the chip designers can charge high prices to the end customer, this will only result in fatter margins and crispier tendies.\n\nIf you are already invested in AMD... you can stop reading here.  Nothing I say is going to change how you feel about them as I am sure you have appreciated their growth over the past few years.\n\n[Trends are soothing...](https://preview.redd.it/izkf13u7otv61.jpg?width=895&amp;format=pjpg&amp;auto=webp&amp;s=7d55d1edb44ae08c02054092567334d48bdbbeb3)\n\nFor everyone who is looking for a scenario to jump into AMD... allow me to present my BULLCASE.\n\n# BULLCASE on AMD: They kill off Intel Design\n\nIntel's YOLO is the idea that Intel will open up as a contract manufacturer for fabless chip designers (like AMD) to become a western version of TSMC.  What may not be apparent is what this actually does to Intel's chip design side of the house.\n\nIn order for Intel to effectively serve as an external foundry, they will have to invest an UNGODLY sum of money just on the manufacturing side.  They may be able to sign checks to ASML and skip a process node completely (just move to 5nm) but all of this represents capital that is not being deployed to design better chips for the datacenter or for the next generation of laptops.  Meanwhile demand for CPUs/GPUs is consistently increasing year over year - particularly along the leading edge of performance where AMD is known to rule.\n\nWhile Intel's production capabilities improve; their design side withers.  Starved of R&amp;D dollars and executive focus, Intel Design fails to keep up with both AMD and the newly merged Nvidia/ARM.\n\nAfter close to a decade of efforts,  Intel Foundry is finally confident about producing semiconductors beyond 10nm.  Is Intel Design ready to be their first customer?\n\nNothing would be more poetic for AMD to have Intel's first 5nm process used on AMD chips.\n\nPositions: none.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**References:**\n\n[DD - Intel](https://www.reddit.com/r/Vitards/comments/mp2f3b/dd_semiconductors_intel_intc_the_280b_corporate/)\n\n[Q1 2021 Earnings AMD](https://d1io3yog0oux5.cloudfront.net/_ee24874d4888cc56b59891df4ac06e6f/amd/db/778/6634/file/AMD+Q1%2721+Financial+Results+Slides.pdf)\n\n&amp;#x200B;\n\n ------------------- \n\n **[TickerDatabase](https://www.reddit.com/r/MillennialBets/wiki/index) entries updated:**\n\n[INTC](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/INTC)\n\n[MSFT](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/MSFT)\n\n[NVDA](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/NVDA)\n\n[ORCL](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/ORCL)\n\n[XLNX](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/XLNX)\n\n[AMD](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AMD)\n\n[ASML](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/ASML)"], "2021-04-29": [" I bought the Best Buy model of the ROG Zephyrus G15 that has an AMD processor, QHD screen, 3070 with 1tb of memory for 1799. I'm looking to buy a backup AC adapter and I can't seem to be able to find where to exactly buy it on Asus's site or what SKU i actually have to look it up properly. Anyone know where to get it?"], "2021-04-30": ["I have a rig with a AMD 3700x mining. Hive OS says it’s mining but it’s missing from Moerocean. Any ideas why? The flight sheet is setup properly"], "2021-05-01": [""], "2021-05-02": ["Managed to get my hands on a 3070, but it doesn't fit in my current case, and the case I would upgrade to doesn't fit my CPU cooler. So I've left it fully sealed up in hopes I can trade.\n\nThe EVGA 3060ti XC is my definite first preference, and I would be willing to take one for less than the MSRP difference between the cards depending on the deal. Would be willing to buy instead of trade as well. The new AMDs are a strong second.\n\nUltimately I'm not super picky, and I would consider trades for most GPUs shorter than 270mm internal length (like the 3070/3060Ti reference and the base ASUS/MSI, or the reference AMD cards), but I would prefer to get some cash with anything unless we're talking about the 6800XT. Last gen or lower spec would even be fine with enough money on top.\n\nVery much would prefer sealed-in-box and a local deal, and can drive a fair bit outside the Twin Cities, but could do shipped or used if we worked out enough security.\n\n[timestamp](https://imgur.com/a/2DJHzNj)"], "2021-05-03": ["[removed]"], "2021-05-04": [""], "2021-05-05": [" \n\n* Model: Asus D509DJ \n* AMD Ryzen 7 3700U Processor (4M Cache, 2.3GHz up to 4.0GHz) \n* 8GB DDR4 RAM + 512GB SSD \n* NVIDIA MX230 2GB Graphics \n* 15.6'' Full HD (1920x1080) Display"], "2021-05-06": ["As previously posted my Ex and I were exhibitionists. And I wanted to share another story(Yes I have permission to post) \n\nSo after the first time she blew me at the park on plain daylight we made an agreement that we were going to do this more often. We had met up after class and went to the mall since we had some time to kill before she had to go to her tennis practice class. I bought her a jeweled butt plug for her and I was like here you gotta wear this while we walk at the mall. She was wearing some leggings that were see tjrough if she bent over, so she went into the womens bathroom to insert it and I told her that I wanted to hold her panties while we walked. She was kinda nervous amd said asked me \"what if people can see it\" and I was like well lets give them a show. So after she inserted the plug we decided to and walk throughout the mall and she said she was getting really wet. Now i thought that it was really hot and was getting turned on more and more, we walked over to the JCP store and \"were browsing\" clothing we both picked up several thimgs to got into the changing rooms, we both went into the same room and just started kissing and I was rubbing her pussy feeling her juice all over her hand. She then gets on her knees and started to suck me off but then we hear someone walking to one of the other rooms so we get dressed immediately, I poke my head out to make sure the coast is clear and walked out with my ex following after a little bit.\n\nI was already horny and turned on and need to blow a load so we go to the photo booth and start we start making out with her again(people are walking by) so were trying to be quiet, then I shove my cock into her and she starts riding it while trying to be quiet and not get caught. After a while I shoot my load in her and we just sit there, here with a plug in her ass and cum running onto the seat, I give her, her panties back and quickly puts them on and leaves the plug in and we walk out after taking some pics, left some of my load on the seat and continue on our way back to her practice class, I sat there watxhing her knowing she had a load in her pussy while wearing a skirt made me even more horny. That was another one of our adventures"], "2021-05-07": [""], "2021-05-08": ["I installed the game today, and I'm having a lot of framerate drops and stuttering. Anyone can help me?\n\nThings I've already done:\n\nUsed a single monitor to run the game\n\nTried to turn off post process\n\nTried to play with DirectX 9\n\nTried lowering settings to low, medium\n\nTried to turn VSync on and off\n\nNothing worked.\n\nMy drivers are update, I've got the following config:\n\nGTX 1060\nAMD Ryzen 3700\n16GB Ram"], "2021-05-09": ["TL;DR - RIOT has an issue with WiFi 802.11ax (wifi 6), disable that in your router if able and perfect solid ping. \n\nSo like many I've been struggling with lag spikes. They aren't all the time but at least 1-2 times per game and varying intensity. It's maddening. I've read all the posts I could find and tried all the solutions listed to no avail. I'm an engineer and tech savvy to boot so I started really thinking and believe I've cracked the issue. \n\nTo be clear, I tried router location, wifi only, settings galore etc. Like many my issue only seemed to happen on WIFI but I have bad cell service at home so trying mobile data wasn't a good option. I tried airplane mode too etc etc. Finally I realized on my work iPhone XR, same wifi and settings the issue didn't occur. That's when it hit me. My S20 ultra supports Wifi6. My router puts out a mixed signal for devices that do and don't support it. I tried changing my router to 802.11a/g/n only amd BAM, PERFECT 33ms ping at 120FPS solid. It's amazing. I hope this helps even one person. I'm in touch with RIOT tech support to let them know as well. \n\nHappy grinding!!!"], "2021-05-10": ["[removed]"], "2021-05-11": ["I want to buy a Dell Optiplex 3040 and I was wondering if I could replace the gpu with something a little more powerful. It says it has integrated graphic but \"Supports optional discrete graphics (MT/SFF only): AMD Radeon™ R7 350X, AMD Radeon™ R5 340X\" ([https://i.dell.com/sites/doccontent/shared-content/data-sheets/en/Documents/ecemea-optiplex-3040-technical-spec-sheet.pdf](https://i.dell.com/sites/doccontent/shared-content/data-sheets/en/Documents/ecemea-optiplex-3040-technical-spec-sheet.pdf)). I was wondering if this meant I can put a different GPU in?"], "2021-05-12": ["is a NVIDIA GPU good for gaming on Linux, or would AMD be a better GPU? I was told NVIDIA has bad support for Linux"], "2021-05-13": ["Hello.   \nI'm choosing my first PC and I'm wondering if this build sound okay?   \nI'm not building it myself since I found a good option where I basically get it built for me for free by the company I'm buying from (I'm too anxious to mess anything up anyway). The downside is that they don't have many different options for parts but it seems like I found what I need for a good price.\n\nMotherboard: ASUS TUF GAMING B550-PRO  \nProcessor: AMD Ryzen 7 5800X  \nMemory: hyperx fury rgb ddr4 3200mhz 16gb  \nPower Supply: Corsair TX650M, 650W PSU  \nWireless: ASUS PCE-AC68  \nGraphics Card: ASUS GeForce RTX 3060 DUAL OC  \nHDD/SSD: Kingston NV1 NVMe M.2 SSD 1TB  \nCPU Cooling: CM ML120L V2 ARGB (120mm Radiator, 120mm ARGB Fan 650-2000 RPM, ARGB pump)\\*\n\n\\*The CPU Cooler doesn’t have a known label that’s why I included the numbers, I could change it to a better one but that cost 100$+.  \nThere's also a few different choices for parts that I can choose, but I'm not sure if that is necessary.  \nShould I be getting extra ssd/hdd's?"], "2021-05-14": ["Hello [r/davinciresolve](https://www.reddit.com/r/davinciresolve/)! Following up from the recent [FAQ Friday on hardware](https://www.reddit.com/r/davinciresolve/comments/mrvdgk/faq_friday_hardware/), I'm doing a series of posts that cover setups at three different levels: consumer, prosumer, and professional. Two weeks ago, the [FAQ Friday covered peripherals](https://www.reddit.com/r/davinciresolve/comments/n1lu2t/faq_friday_peripherals/), such as mice, monitors, and control surfaces. Some hardware will make a repeat appearance in the different setups.\n\nAs with all FAQ Fridays, *any* topic is welcome here, not just the subject of the FAQ.\n\n# About These Setup Suggestions\n\nThese requirements will get you going on HD editing with most types of footage. Fusion work is minimal, or basic titles, and optimized media or proxies are a must for H.264 or H.265 footage. Storage isn't included - that's either a future FAQ Friday or another topic of discussion.\n\nIntel vs. AMD and NVIDIA vs. AMD isn't included here on purpose, as it's up to personal preference and availability at the consumer price level.\n\nAlso, while you *can* run Resolve on 8 GB of RAM, it's not ideal - 16 is the minimum suggested amount of RAM. I understand that computers are expensive, but Resolve is not for you if you've got less than 8 GB of RAM.\n\n# All Setups\n\n* A three-button mouse\n* A keyboard, numeric keypad optional\n* Headphones or speakers *not* connected via USB\n* A monitor 17\" in size or greater\n\n# macOS Setup System Suggestions\n\n* macOS 10.15 Catalina or later\n* 8-16 GB of system memory\n* Integrated GPU or discrete GPU with at least 2 GB of VRAM\n* GPU which supports Metal or OpenCL 1.2\n\n# Linux Setup System Suggestions\n\n* CentOS 7.3, a similar distro, or a recent Debian-based distro like Ubuntu\n* A recent i7 or faster CPU (or AMD equivalent)\n* 8-16 GB of system memory\n* Discrete GPU with at least 4 GB of VRAM (NVIDIA recommended)\n* GPU which supports OpenCL 1.2 or CUDA 11\n* NVIDIA/AMD GPU Driver version – As required by your GPU.\n\n# Windows Setup System Suggestions\n\n* Windows 10 Creators Update\n* 8-16 GB of system memory\n* Integrated GPU or discrete GPU with at least 4 GB of VRAM\n* A recent i7 or faster CPU (or AMD equivalent)\n* GPU which supports OpenCL 1.2 or CUDA 11\n* NVIDIA/AMD/Intel GPU Driver version – As required by your GPU.\\*\n\n\\*There's an issue with NVIDIA Game-Ready driver version 461.09 that has been resolved in later driver versions. Update your GPU drivers to a later version or the Studio version of the NVIDIA drivers. [More information from BMD on changing driver versions.](https://forum.blackmagicdesign.com/viewtopic.php?f=21&amp;t=50352&amp;start=100#p713477)\n\n# Detailed Recommendations &amp; Notes\n\nA lot of this is personal preference, but I do have a few recommendations. On the Apple side, I personally recommend a Macbook Pro or Mac Mini. I've got a personal concern about heat with Macbook Airs, but if that's what you want, go for it. On the Windows/Linux side, *most* pre-built gaming laptops or gaming computers that meet these minimum specs should be fine. Expect prices for decently specced systems to start around $900-$1000 USD.\n\nA three-button mouse isn't a hard and fast requirement, but is ideal for quickly copying grades or Fusion compositions with the middle mouse button, or moving the image around in a viewer. Again, you don't have to drop $100 on a mouse - a cheap USB mouse will work fine.\n\nUSB headphones and speakers can have additional tuning introduced to the audio, changing the sound profile. Pre 17.2, these can also cause issues with launching Resolve. You don't have to go out and buy a pair of $80 studio-quality headphones at this level. The built-in speakers on your laptop or a pair of earbuds will work fine.\n\n[**Previous FAQ Fridays**](https://www.reddit.com/r/davinciresolve/search?q=flair_name%3A%22FAQ%20Friday%22&amp;restrict_sr=1)"], "2021-05-15": ["Hi there,\n\nI've got a PC that I built a few months ago that's been working fine until a week or two ago.  Suddenly while gaming (Fortnite, VR) my computer would crash, in that the screens would go black, the fans speed up, and does nothing until I reset it.  When it comes back it's like nothing happened, but often logs me out of the Epic Games Launcher.  Right now I'm at a state where I've reset windows and installed the latest drivers and am trying to simply run Valve's VR Performance Test and it's crashing about 45 seconds in.\n\nHere's what I've got:\n\nZotac 3070 AMP Holo\n\nEVGA 210-GQ-0750-V1 750 GQ 80+ GOLD 750w Semi Modular Power Supply\n\nG Skill RipJaws V Series 16GB (2x 8GB) DDR4 3600 (was set to 3300 in BIOS but dropped to 2133 with same results)\n\nMSI MAG B550 Tomahawk w/ AMD Ryzen 5 5600X \n\n&amp;#x200B;\n\nThe Zotac is connected via 2 cables, not a splitter.  I've tried setting the PCIe to Gen3 (it was automatically selecting Gen4) with no change.  I've reinstalled Windows.  I've used older drivers with some luck in that I stopped crashing in Fortnite, but continue crashing in Half Life Alyx, but that may just be coincidence.  The temperature of the card doesn't go above 80, it hits 100% performance when running the VR test.  I have not yet tried resetting windows and using older drivers, I'm not sure it would be worth it.  \n\nWhat am I missing, what should my next steps be?  I'd rate my PC hardware knowledge these days at \"Just enough to be dangerous\", so please bear with me on answering questions you might have."], "2021-05-16": [""], "2021-05-17": ["My framerate and performance in a game was tanking really bad randomly, so I checked task manager and started closing unnecessary programs. The problem immediately went away once I closed these three Intel programs (I have an AMD GPU).\n\nHere is an image of the three processes: https://i.gyazo.com/666024008d530bc6d5a86029ecc732fd.png\n\nAnyone know what these are and why closing them immediately made my framerate and performance go back to normal? A search of these names online yielded little. They seem like unnecessary drivers or something that were interfering with my GPU, anyone know how to prevent this from happening again?"], "2021-05-18": ["Building my first PC, gigabyte b550i with a 5600x. When I tried to boot all the fans, rgb, aio, and gpu turn on, but I got no signal on my monitor.\n\nAny help is appreciated:)"], "2021-05-19": ["I've been interested in getting a gaming computer recently but have been struggling with choosing the right one, right now I'm considering the following two that are currently on sale but I'm really open to any suggestions.\n\nThe first one is a Lenovo Legion\n\n[https://www.bestbuy.ca/en-ca/product/lenovo-legion-tower-5i-gaming-pc-intel-core-i7-10700-1tb-hdd-256gb-ssd-16-ram-gtx-1660-super-en/15309488](https://www.bestbuy.ca/en-ca/product/lenovo-legion-tower-5i-gaming-pc-intel-core-i7-10700-1tb-hdd-256gb-ssd-16-ram-gtx-1660-super-en/15309488)\n\nIt seems really great hardware wise though the price is a bit higher than ideal even with it on sale. I'm also not a huge fan of the case as it's mainly plastic and the computer doesn't pop as much as I would like. As well, this isn't really a big thing, but the mouse and keyboard it comes with seem very plain and cheap.\n\nMy second option just sold out a few hours ago so it's not really an option anymore but I'd still be interested to hear thoughts on it.\n\n[https://www.bestbuy.ca/en-ca/product/ibuypower-slate-4-163a-gaming-pc-black-amd-ryzen-5-3600-1tb-hdd-240gb-ssd-16gb-ram-radeon-rx-580/15348484](https://www.bestbuy.ca/en-ca/product/ibuypower-slate-4-163a-gaming-pc-black-amd-ryzen-5-3600-1tb-hdd-240gb-ssd-16gb-ram-radeon-rx-580/15348484)\n\nOverall the PC seemed great though I'm not really sure about the company as I can't find much information on IBUYPOWER. The other main drawback was the graphics card which was a bit weaker than I would have liked but I could have been wrong and it may have been fine.\n\n&amp;#x200B;\n\nOutside of these two (which is really only one now) I'm open to anything really; ideally I'd like to keep it under $1,200 CAD though I'd be willing to go up to 1,400-1,500CAD if it's worth it. As well, I'd like it to be from a Canadian company/website as shipping from America to Canada isn't something I really want to get into.\n\n(Not sure if this is relevant but I have a close family member who is a teacher so I would be able to get a teacher's discount at certain companies)\n\nThanks!"], "2021-05-20": [""], "2021-05-21": ["I just bought this laptop but the battery duration displayed keeps changing. On 'Best battery life' setting, it ranged from 11hrs to less than 2 hrs. The laptop's exact model is ASUS ROG STRIX G15 G513Q-MHN173T and here's the specs.\n\nProcessor :AMD Ryzen™ 7 5800H Processor 3.0 GHz (16M Cache, up to 4.3 GHz)  \n\nGraphics :NVIDIA® GeForce RTX™ 3060; 6GB GDDR6 \n\nDisplay : 15.6\" Full HD; 144Hz; Adaptive Sync \n\nMemory :8GB + 8GB DDR4-3200 SO-DIMM \n\nStorage : 512GB M.2 NVMe™ PCIe® 3.0 SSD \n\nBattery and Power : 90WHrs, 4S1P, 4-cell Li-ion"], "2021-05-22": ["Hello [r/davinciresolve](https://www.reddit.com/r/davinciresolve/)! Following up from the recent [FAQ Friday on hardware](https://www.reddit.com/r/davinciresolve/comments/mrvdgk/faq_friday_hardware/), I'm doing a series of posts that cover setups at three different levels: consumer, prosumer, and professional. A few weeks ago, the [FAQ Friday covered peripherals](https://www.reddit.com/r/davinciresolve/comments/n1lu2t/faq_friday_peripherals/), such as mice, monitors, and control surfaces. Some hardware will make a repeat appearance in the different setups.\n\n# About These Setup Suggestions\n\nThese requirements will get you going on HD editing with most types of footage. Fusion work is common, and optimized media or proxies are optional for H.264 or H.265 footage. Storage isn't included - that's either a future FAQ Friday or another topic of discussion.\n\nIntel vs. AMD and NVIDIA vs. AMD isn't included here on purpose, as this is the mid-range, and some of it's up to personal preference. I do have some recommendations, but it's not a requirement, which is the point of these posts.\n\n# All Setups\n\n* A three-button mouse and/or a tablet interface, like a Wacom\n* A keyboard with numeric keypad\n* Headphones or speakers *not* connected via USB\n* 2+ monitors 17\" in size or greater\n* Resolve Studio (Key or Dongle version)\n\n# Optional Additions\n\n* An UltraStudio/Decklink\n* A calibrated/calibratable monitor (LG CX, Eizo, or Flanders)\n* A Tangent Ripple, Wave, or Blackmagic Mini Panel (For color correction)\n* Fairlight Desktop Console (For mixing)\n\n# macOS Setup System Suggestions\n\n* macOS 10.15 Catalina or later\n* 16-32 GB of system memory\\*\n* Integrated GPU or discrete GPU with at least 4 GB of VRAM\\*\\*\n* GPU which supports Metal or OpenCL 1.2\n\n# Linux Setup System Suggestions\n\n* CentOS 7.3, a similar distro, or a recent Debian-based distro like Ubuntu\n* A recent i7 or faster CPU (or AMD equivalent)\n* 32 GB of system memory\n* Discrete GPU with at least 6 GB of VRAM\\*\\*\n* GPU which supports OpenCL 1.2 or CUDA 11\n*  NVIDIA/AMD GPU Driver version – As required by your GPU.\n\n# Windows Setup System Suggestions\n\n* Windows 10 Creators Update\n* 32 GB of system memory\n* Discrete GPU with at least 6 GB of VRAM\\*\\*\n* A recent i7 or faster CPU (or AMD equivalent)\n* GPU which supports OpenCL 1.2 or CUDA 11\n* NVIDIA/AMD/Intel GPU Driver version – As required by your GPU.\\*\\*\\*\n\n\\*M1 chips support a maximum of 16 GBs of RAM - if you want more, you'll have to get an Intel Mac.\n\n\\*\\*If you regularly work with or in 4K, 8 GB of VRAM is recommended.\n\n\\*\\*\\*There's an issue with NVIDIA Game-Ready driver version 461.09 that has been resolved in later driver versions. Update your GPU drivers to a later version or the Studio version of the NVIDIA drivers. [More information from BMD on changing driver versions.](https://forum.blackmagicdesign.com/viewtopic.php?f=21&amp;t=50352&amp;start=100#p713477)\n\n# Detailed Recommendations &amp; Notes\n\nOn the Apple side, Intel Macbooks, Mac Minis, and iMacs are best. Puget Systems' \"Free\" version is a good starting point for Windows or Linux. Older \"Trash Can\" Mac Pros or old servers with room for plenty of RAM and/or multiple GPUs are also good.\n\nIf you're more on the professional side than the consumer side of \"prosumer,\" try to go with an NVIDIA GPU. They're the industry standard for Hollywood. Obviously, there's a GPU shortage, so if all you can find is an AMD GPU, that's fine too.\n\nA three-button mouse isn't a hard and fast requirement, but is ideal for quickly copying grades or Fusion compositions with the middle mouse button, or moving the image around in a viewer. I like the Logitech MX Master 2S personally.\n\nUSB headphones and speakers can have additional tuning introduced to the audio, changing the sound profile. You still don't have to drop $80 on studio-quality headphones, but it's a good investment.\n\n[**Previous FAQ Fridays**](https://www.reddit.com/r/davinciresolve/search?q=flair_name%3A%22FAQ%20Friday%22&amp;restrict_sr=1)"], "2021-05-23": ["I got lucky and recently got my hands on one. Now I am in the process of coming up with a good build. Here is what I got so far. Any suggestions on how to improve it or make it cheaper? Thank you!\n\n\\[PCPartPicker Part List\\]([https://ca.pcpartpicker.com/list/PhLhp2](https://ca.pcpartpicker.com/list/PhLhp2))\n\n&amp;#x200B;\n\nType|Item|Price\n\n:----|:----|:----\n\n\\*\\*CPU\\*\\* | \\[AMD Ryzen 5 5600X 3.7 GHz 6-Core Processor\\]([https://ca.pcpartpicker.com/product/g94BD3/amd-ryzen-5-5600x-37-ghz-6-core-processor-100-100000065box](https://ca.pcpartpicker.com/product/g94BD3/amd-ryzen-5-5600x-37-ghz-6-core-processor-100-100000065box)) | $429.99 @ Canada Computers \n\n\\*\\*CPU Cooler\\*\\* | \\[Cooler Master MASTERLIQUID ML240L RGB V2 65.59 CFM Liquid CPU Cooler\\]([https://ca.pcpartpicker.com/product/fLFKHx/cooler-master-masterliquid-ml240l-rgb-v2-6559-cfm-liquid-cpu-cooler-mlw-d24m-a18pc-r2](https://ca.pcpartpicker.com/product/fLFKHx/cooler-master-masterliquid-ml240l-rgb-v2-6559-cfm-liquid-cpu-cooler-mlw-d24m-a18pc-r2)) | $80.53 @ Amazon Canada \n\n\\*\\*Motherboard\\*\\* | \\[MSI MPG B550 GAMING PLUS ATX AM4 Motherboard\\]([https://ca.pcpartpicker.com/product/yKVG3C/msi-mpg-b550-gaming-plus-atx-am4-motherboard-mpg-b550-gaming-plus](https://ca.pcpartpicker.com/product/yKVG3C/msi-mpg-b550-gaming-plus-atx-am4-motherboard-mpg-b550-gaming-plus)) | $194.99 @ Memory Express \n\n\\*\\*Memory\\*\\* | \\[Kingston HyperX Fury RGB 16 GB (2 x 8 GB) DDR4-3600 CL17 Memory\\]([https://ca.pcpartpicker.com/product/ymK2FT/kingston-hyperx-fury-rgb-16-gb-2-x-8-gb-ddr4-3600-memory-hx436c17fb3ak216](https://ca.pcpartpicker.com/product/ymK2FT/kingston-hyperx-fury-rgb-16-gb-2-x-8-gb-ddr4-3600-memory-hx436c17fb3ak216)) | $134.99 @ Canada Computers \n\n\\*\\*Storage\\*\\* | \\[Crucial P2 1 TB M.2-2280 NVME Solid State Drive\\]([https://ca.pcpartpicker.com/product/KMkgXL/crucial-p2-1-tb-m2-2280-nvme-solid-state-drive-ct1000p2ssd8](https://ca.pcpartpicker.com/product/KMkgXL/crucial-p2-1-tb-m2-2280-nvme-solid-state-drive-ct1000p2ssd8)) | $129.99 @ Amazon Canada \n\n\\*\\*Video Card\\*\\* | \\[Zotac GeForce RTX 3070 8 GB GAMING Twin Edge Video Card\\]([https://ca.pcpartpicker.com/product/qzVG3C/zotac-geforce-rtx-3070-8-gb-gaming-twin-edge-video-card-zt-a30700e-10p](https://ca.pcpartpicker.com/product/qzVG3C/zotac-geforce-rtx-3070-8-gb-gaming-twin-edge-video-card-zt-a30700e-10p)) | $899.00 @ Canada Computers \n\n\\*\\*Case\\*\\* | \\[Fractal Design Meshify C ATX Mid Tower Case\\]([https://ca.pcpartpicker.com/product/BBrmP6/fractal-design-meshify-c-white-tg-atx-mid-tower-case-fd-ca-mesh-c-wt-tgc](https://ca.pcpartpicker.com/product/BBrmP6/fractal-design-meshify-c-white-tg-atx-mid-tower-case-fd-ca-mesh-c-wt-tgc)) | $109.99 @ Memory Express \n\n\\*\\*Power Supply\\*\\* | \\[Thermaltake Smart 600 W 80+ Certified ATX Power Supply\\]([https://ca.pcpartpicker.com/product/6RTrxr/thermaltake-smart-600w-80-certified-semi-modular-atx-power-supply-ps-spd-0600npcwus-w](https://ca.pcpartpicker.com/product/6RTrxr/thermaltake-smart-600w-80-certified-semi-modular-atx-power-supply-ps-spd-0600npcwus-w)) | $59.99 @ Canada Computers \n\n\\*\\*Case Fan\\*\\* | \\[Cooler Master SickleFlow 62 CFM 120 mm Fan\\]([https://ca.pcpartpicker.com/product/sZPgXL/cooler-master-sickleflow-120-argb-62-cfm-120-mm-fan-mfx-b2dn-18npa-r1](https://ca.pcpartpicker.com/product/sZPgXL/cooler-master-sickleflow-120-argb-62-cfm-120-mm-fan-mfx-b2dn-18npa-r1)) | $15.99 @ Memory Express \n\n\\*\\*Case Fan\\*\\* | \\[Cooler Master SickleFlow 62 CFM 120 mm Fans 3-Pack\\]([https://ca.pcpartpicker.com/product/FCvqqs/cooler-master-sickleflow-62-cfm-120-mm-fans-3-pack-mfx-b2dn-183pa-r1](https://ca.pcpartpicker.com/product/FCvqqs/cooler-master-sickleflow-62-cfm-120-mm-fans-3-pack-mfx-b2dn-183pa-r1)) | $54.99 @ Memory Express \n\n\\*\\*Custom\\*\\* | \\[EZDIY-FAB Custom PSU Extension Sleeved Cable Mod GPU PC Power Supply Soft Nylon Braided with Comb Kit 24PIN/8PIN to 6+2Pin/ 8PIN to 4+4PIN-300MM-Black and Grey\\]([https://ca.pcpartpicker.com/product/K9zFf7/placeholder-](https://ca.pcpartpicker.com/product/K9zFf7/placeholder-)) | $30.99 @ Amazon Canada \n\n | \\*Prices include shipping, taxes, rebates, and discounts\\* |\n\n | \\*\\*Total\\*\\* | \\*\\*$2141.44\\*\\*\n\n | Generated by \\[PCPartPicker\\]([https://pcpartpicker.com](https://pcpartpicker.com)) 2021-05-23 00:01 EDT-0400 |"], "2021-05-24": ["Hey all, posting a bunch of crap for sale today that I am looking to sell. All prices are open to interpretation and feel free to make an offer within reason. Pretty much everything has little to no use other than the other stuff which was pulled out of some older Inspirons and what not. Once again any questions you have feel free to shoot me a message.\n\n* EVGA XC3 Ultra RTX 3070 (Lightly used, never mined on. Comes with the original box.) - $1,350 shipped OBO or $1,300 local.\n* i9-10900K and Gigabyte Aorus Z490 Pro AX Motherboard  - $550 shipped OBO or $500 local. May be out of place on this one, could not find many used prices. Feel free to correct me if I am wrong.\n* 32GB GSkill TridentZ DDR4-3200mhz - $160 shipped OBO or $140 local. Been used for a bit, no issues. 2x16GB sticks.\n* NZXT Kraken X63 AIO - $120 shipped obo or $100 local. Paired with two NZXT AER RGB fans. See these hovering between $100-$120 without the RGB fans. I unfortunately only have the intel bracket for this so that is worth noting.\n* CoolerMaster ML240L - $70 shipped obo or $50 local. Practically brand new, used for maybe a week then pulled off. I also only have the intel bracket for this.\n* NZXT C1000 80+ Gold PSU - $120 shipped obo or $100 local. Not sure what to price this as because I have never even heard of it and cannot find a price anywhere. Feel free to correct me if need be.\n* AMD FX-8120 CPU with Sabertooth 990FX Motherboard and Cooler - $140 shipped obo or $120 local.\n* (4) i3-4170 CPU's - I am looking to sell these in a bundle just to get rid of them. $100 shipped OBO or $80 local.\n* i3-4150 - $25 shipped OBO or $15 local.\n* Pentium G630 - Honestly just ask for it if you purchase literally anything else. This thing is dog water.\n* Various Sticks of DDR3 RAM if needed. Several different brands. Message for questions about those. All OEM variants.\n\n[Timestamp](https://imgur.com/a/s3bNQbv)\n\nLocal is 39047 located in Central MS if there is anyone local wondering. I am free most days/times for now until I start work as I am home from college. I would like to reiterate prices are OBO and open to interpretation. Thank you and have a blessed day."], "2021-05-25": ["I have tested SkyFactory 4 with no Optifine or Shaders and there was no RAM leak.\n\nTesting SkyFactory 4 with Optifine, but no Shaders also fails to produce a RAM leak.\n\nHowever, adding a Shaders pack such as SEUS or BSL Shaders, when unfocusing the Minecraft window, your RAM begins to increase dramatically passing your maximum allocated until you are left with no RAM.\n\nI wasn't finding any post about this online so I've decided to make one.\n\nThis RAM leak occurs using either MultiMC or Curseforge launcher. I have 10GB of RAM allocated.\n\nSpecs:\n\nCPU: AMD Ryzen 5900x\n\nGPU: NVIDIA 3080\n\nRAM: 32GB 3800CL14"], "2021-05-26": ["Hola gente, capaz me recuerden porque hice un post preguntando que juegos me podian andar en mi pc. En fin, esa misma pc, le puse una GT 710 de 1gb ddr3 que fue una mejora masiva de una grafica integrada TE.RRI.BLE. Por ahora va todo bien, pero tengo un problema, y una duda.\n\nUn problema que tengo es que se me apaga sola la PC que no pasaba antes, empezo a pasar cuando le puse la nueva grafica, y se me apaga hasta con juegos como Roblox, que no pasaba antes tampoco, y una vez se apago viendo un directo de Twitch. Que puede ser? Mi fuente de poder y el disipador estan re contra sucios, lo tengo que decir, pero creo que es la fuente porque me pasa lo mismo de que se apaga al prender las luces de un teclado Noga.\n\nPienso ponerle una fuente nueva que es una Noga ATX-600 de 600 Watts, deberia ponersela? porque por ser Noga no confio mucho. Esta es mi pc abajo:\n\nProcesador: AMD Sempron 145, 2.80ghz, 1 nucleo y 1 hilo, sin overclockear o desbloquear los nucleos\n\nRAM: 2gb DDR3, 1333 mhz, solo un stick, no tengo Dual Channel\n\nGrafica: MSI NVIDIA GeForce 710 1GB DDR3\n\nPor cierto, encontre un procesador en Mercado Libre que es un AMD Athlon II X4 635, que sale $3750 y tiene envio gratis, pero no se si comprar mejor un stick de RAM de 4GB DDR3 1600 mhz que sale $3850 y esta en una tienda fisica, que deberia hacer?"], "2021-05-27": ["I have a wifi card and I wanted to know if the  intel drivers will work with the ryzen build."], "2021-05-28": ["Yesterday when browsing web suddenly my PC froze. Had to restart, but there was no response after that, no BIOS screen. Tried restarting several times, had no luck.\nThen deassembled the PC and put together only the essential parts amd tried. No luck there too.. So I pulled out one RAM stick and.. Voila! It turned on.\nThen I put back the RAM. Again PC refuses to boot up. I tried every solution I could find, but no luck so far.\n\nMy PC is a very old one. Just using for light tasks.(Intel Core 2 Quad Q9400\n2X2GB DDR2). Has been using for years with same parts without much of a problem)\n\n&gt;Tried switching RAM sticks and Slots. Tried every combination. Both RAM sticks and slots work, but PC turns only with one stick no matter what’s the slot is.\n&gt;Tried resetting the BIOS. Haven’t changed much otherthan CPU fan profile.\nDoes anyone has a idea about what’s going on.\nThank you\nSorry for bad English.!\n\nSolutions I don’t wanna hear\n&gt;Buy a new PC."], "2021-05-29": ["**Computer Type:** Desktop\n\n**GPU:** RX460 2GB\n\n**CPU:** RYZEN 9 3600X 12 CORE 24 THREADS\n\n**Motherboard:** TUF B450-PLUS GAMING\n\n**BIOS Version:** 3002\n\n**RAM:** 32GB CORSAIR VENGEANCE 3200MHZ\n\n**PSU:** CORSAIR 650W  80+ GOLD FULLY MODULAR\n\n**Operating System &amp; Version:** WINDOWS 10 PRO 20H2\n\n**GPU Drivers:** Adrenalin Driver Version: 21.4.1\n\n**Description of Original Problem:**  I am using an AMD RX460 2GB graphic card. I face the above problem a couple of days ago. every morning it's happening., but windows is boot normally and the display is still in black and the monitor shows no signal."], "2021-05-30": ["Fellow apes, need a hand. Much love this past year taking about $30k to $200k between TSLA and the first GME play, but was too impatient for AMC. \n\nThat’s left me crab walking for almost two months. I’ve avoided the big loses with the dip, but can’t quite get back on track. I’m up on DDs, but always appreciate feedback. I have a simple goal to hit $250k so I can pull the trigger on doing some good. \n\nSitting on Apple, Microsoft and AMD for safety right now."], "2021-05-31": ["My friend recently just tried to play Swtor for the first time. When he was running it his computer started heating up and made jet sounds. Swtor was taking very low cpu power.  My friend says he reset the computer twice. He thinks it might of worn the computer hardware down. He has turned down the graphicsin swtor already. Does anyone know why it is doing this? \n\n&amp;#x200B;\n\nHis specs are:\n\nCPU: AMD Ryzen 5 1600 Six-Core Processor\n\nGPU: Radeon RX 580 Series\n\n16GB RAM\n\nWindows 10 home"]}